&НаКлиенте
Процедура ВидРасчетаБонусаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ПроверитьЗаполнениеРеквизитов("ТипРасчетаБонуса") Тогда 
		Возврат
	КонецЕсли;
	
	УстановитьТипВидРасчетаБонусаНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипВидРасчетаБонусаНаСервере()

	Если Запись.ТипРасчетаБонуса = Перечисления.ТипыРасчетаБонусов.РасчетПоВидамЦен Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыЦен");
		ЗначениеТипа = Справочники.ВидыЦен.ПустаяСсылка();
	ИначеЕсли Запись.ТипРасчетаБонуса = Перечисления.ТипыРасчетаБонусов.РасчетПоСегментамНоменклатуры Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.СегментыНоменклатуры");
		ЗначениеТипа = Справочники.СегментыНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Элементы.ВидРасчетаБонуса.ОграничениеТипа = ОписаниеТипа;
	Элементы.ВидРасчетаБонуса.ОграничениеТипа.ПривестиЗначение(ЗначениеТипа);
	Элементы.ВидРасчетаБонуса.ВыбиратьТип = Ложь;	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеРеквизитов(ИмяРеквизита)
	
	Если Запись[ИмяРеквизита].Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
	 	Сообщение.Поле = "Запись." + ИмяРеквизита;
	 	Сообщение.Текст = "Поле """ + ИмяРеквизита + """ не заполнено";
	 	Сообщение.Сообщить();
		Возврат Истина
	КонецЕсли;
	
	Возврат Ложь
	
КонецФункции

&НаКлиенте
Процедура КатегорияТовараНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПолучитьДанныеВыбораНаСервере(ДанныеВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеВыбораНаСервере(ДанныеВыбора)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	                      |ГДЕ
	                      |	ЗначенияСвойствОбъектов.Владелец = &Владелец");
	
	Запрос.УстановитьПараметр("Владелец", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ГруппаТоваров"));
	
	ДанныеЗапроса = Запрос.Выполнить().Выгрузить();
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ДанныеЗапроса.ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

