
&НаКлиенте
Процедура УдалениеДоОпределеннойДаты(Команда)
	
	ДатаНапоминания = ТекущаяДата() - 60*60*24*7;
	Подсказка = "Введите дату, по которую будет удален лог";
	ЧастьДаты = ЧастиДаты.Дата;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты", ЭтотОбъект, Параметры);
	ПоказатьВводДаты(Оповещение, ДатаНапоминания, Подсказка, ЧастьДаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(Дата, Параметры) Экспорт
    Если НЕ Дата = Неопределено Тогда
		УдалениеЛогаСервер(Дата);
		Элементы.Список.Обновить();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалениеЛогаСервер(Дата)
	
	Выборка = РегистрыСведений.Б24_Логирование.Выбрать(,Дата); 
	
	Пока Выборка.Следующий() Цикл
		Выборка.ПолучитьМенеджерЗаписи().Удалить();	
	КонецЦикла;
	
КонецПроцедуры
