#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьВсеЗаписи(Команда)
	
	УдалитьВсе();
	ЭтаФорма.Элементы.Список.Обновить();
	
	Элементы.СписокНеотправелнныеПакеты.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВсе()
	
	НаборЗаписей = РегистрыСведений.Б24_ПакетыВыгрузки.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНеиспользуемыеРегистрации(Команда)
	
	Б24_ВыгрузкаВызовСервера.УдалитьНеиспользуемыеРегистрации() ;
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
