
&НаКлиенте
Процедура ВидБонусаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Если Запись.ВидБонуса = Перечисления.ВидыБонусов.Личные или Запись.ВидБонуса = Перечисления.ВидыБонусов.Партнерские тогда
		Элементы.ПроцентОтОбщихБонусов.ТолькоПросмотр = Истина;
		Элементы.ПропорциональноОтОбщихПродаж.ТолькоПросмотр = Истина;
		Элементы.НижнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.ВерхнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.БонусныйПроцент.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Должность.ТолькоПросмотр = Ложь;
		Элементы.Основной.ТолькоПросмотр = Истина;
	ИначеЕсли Запись.ВидБонуса = Перечисления.ВидыБонусов.Групповые или Запись.ВидБонуса = Перечисления.ВидыБонусов.ПартнерскиеГрупповые тогда
		Элементы.ПроцентОтОбщихБонусов.ТолькоПросмотр = Истина;
		Элементы.ПропорциональноОтОбщихПродаж.ТолькоПросмотр = Истина;
		Элементы.НижнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.ВерхнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.БонусныйПроцент.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Должность.ТолькоПросмотр = Ложь;
		Элементы.Основной.ТолькоПросмотр = Истина;
	ИначеЕсли Запись.ВидБонуса = Перечисления.ВидыБонусов.КотелПропорциональный тогда
		Элементы.НижнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.ВерхнийПорогОбъемаПродаж.ТолькоПросмотр = Истина;
		Элементы.БонусныйПроцент.ТолькоПросмотр = Истина;
		Элементы.ПроцентОтОбщихБонусов.ТолькоПросмотр = Истина;
		Элементы.ПропорциональноОтОбщихПродаж.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Должность.ТолькоПросмотр = Ложь;
		Элементы.Основной.ТолькоПросмотр = Истина;
	ИначеЕсли Запись.ВидБонуса = Перечисления.ВидыБонусов.КотелРуководителя тогда
		Элементы.ПроцентОтОбщихБонусов.ТолькоПросмотр = Ложь;
		Элементы.ПропорциональноОтОбщихПродаж.ТолькоПросмотр = Истина;
		Элементы.НижнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.ВерхнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.БонусныйПроцент.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Должность.ТолькоПросмотр = Ложь;
		Элементы.Основной.ТолькоПросмотр = Ложь;
	ИначеЕсли Запись.ВидБонуса = Перечисления.ВидыБонусов.Проектные или Запись.ВидБонуса.Пустая() тогда
		Элементы.Подразделение.ТолькоПросмотр = Истина;
		Элементы.Должность.ТолькоПросмотр = Истина;
		Элементы.ПроцентОтОбщихБонусов.ТолькоПросмотр = Истина;
		Элементы.ПропорциональноОтОбщихПродаж.ТолькоПросмотр = Истина;
		Элементы.НижнийПорогОбъемаПродаж.ТолькоПросмотр = Истина;
		Элементы.ВерхнийПорогОбъемаПродаж.ТолькоПросмотр = Истина;
		Элементы.БонусныйПроцент.ТолькоПросмотр = Истина;
		Элементы.Основной.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеЭлементамиФормы();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	

	
КонецПроцедуры

