
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Элементы.Ставка.Доступность              = НЕ Объект.ДляОсвобожденногоОборота И НЕ Объект.МестоРеализацииНеРК;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Ставка", "Видимость", НЕ Объект.ДляОсвобожденногоОборота И НЕ Объект.МестоРеализацииНеРК);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Ставка", "Видимость", НЕ Объект.ДляОсвобожденногоОборота И НЕ Объект.МестоРеализацииНеРК);
	
	Если Объект.Предопределенный Тогда
		Элементы.ГруппаРеквизиты.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДляОсвобожденногоОборотаПриИзменении(Элемент)
	
	Если Объект.ДляОсвобожденногоОборота Тогда
		Объект.Ставка = 0;
		Объект.МестоРеализацииНеРК = Ложь;
	КонецЕсли;
	
	Элементы.Ставка.Доступность              = НЕ Объект.ДляОсвобожденногоОборота И НЕ Объект.МестоРеализацииНеРК;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Ставка", "Видимость", НЕ Объект.ДляОсвобожденногоОборота И НЕ Объект.МестоРеализацииНеРК);
	
КонецПроцедуры

&НаКлиенте
Процедура МестоРеализацииНеРКПриИзменении(Элемент)
	
	Если Объект.МестоРеализацииНеРК Тогда
		Объект.Ставка = 0;
		Объект.ДляОсвобожденногоОборота = Ложь;
	КонецЕсли;
	
	Элементы.Ставка.Доступность              = НЕ Объект.ДляОсвобожденногоОборота И НЕ Объект.МестоРеализацииНеРК;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Ставка", "Видимость", НЕ Объект.ДляОсвобожденногоОборота И НЕ Объект.МестоРеализацииНеРК);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры


#КонецОбласти