
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("КлючНазначенияФормы", "ДокументыПродажи");
	
	//кт Начало Апаев_О [10.09.2022] - Задача № 6010 Доработка журнала
	//ОткрытьФорму("Обработка.ЖурналДокументовПродажи.Форма.СписокДокументов",
	ОткрытьФорму("Обработка.ЖурналДокументовПродажи.Форма.кт_СписокДокументов", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//кт Окончание Апаев_О [10.09.2022
		
КонецПроцедуры
