
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторРаздела) тогда
	
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Б24_ПользовательскиеГруппыТоваров.ИдентификаторРаздела
		|ИЗ
		|	Справочник.Б24_ПользовательскиеГруппыТоваров КАК Б24_ПользовательскиеГруппыТоваров";
		
		мИдентификаторовРазделов =   Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторРаздела");
		
		ИдентификаторСовпадает = Истина;
		
		Пока ИдентификаторСовпадает Цикл
			
			лУникальныйИдентификатор = Новый УникальныйИдентификатор;
			лИдентификатор = Строка(лУникальныйИдентификатор);
			
			Если мИдентификаторовРазделов.Найти(лИдентификатор) = Неопределено тогда
				ИдентификаторСовпадает = Ложь;	
			КонецЕсли;
			
		КонецЦикла;
		
		Объект.ИдентификаторРаздела = лИдентификатор;
		
	КонецЕсли;

КонецПроцедуры

