
&НаКлиенте
Процедура new_РучныеСкидкиКонтроль(Команда)
	ОткрытьФорму("РегистрСведений.new_РучныеСкидкиКонтроль.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура new_ДоступПотльзователейКТипамЦен(Команда)
	ОткрытьФорму("РегистрСведений.new_ДоступПотльзователейКТипамЦен.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонстан(Команда)
	ОткрытьФорму("ОбщаяФорма.new_ФормаКонстантПомАдмина"); 
КонецПроцедуры

&НаКлиенте
Процедура new_ЗапретВыбораКлиентаТочетно(Команда)
	ОткрытьФорму("РегистрСведений.new_ЗапретВыбораКлиентаТочетно.ФормаСписка");
КонецПроцедуры
