////////////////////////////////////////////////////////////////////////////////
// Подсистема "Торговые предложения".
// ОбщийМодуль.ТорговыеПредложенияПереопределяемый.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает признак того, что функциональная опция использования видов номенклатуры включена.
// 
// Параметры:
//   ИмяФормы - Строка - имя формы, для которой получаются данные.
//   Результат - Булево - признак того, что функциональная опция включена.
//
Процедура ФункциональнаяОпцияИспользуется(Знач ИмяФормы, Результат) Экспорт
	
	МассивОпций = ЗависимостьФункционалаОтФункциональныхОпций().Получить(ИмяФормы);
	Если ЗначениеЗаполнено(МассивОпций) Тогда
		Для Каждого Опция из МассивОпций Цикл
			Если Не ПолучитьФункциональнуюОпцию(Опция) Тогда
				Результат = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Результат = Истина;
	
КонецПроцедуры

// Выдает сообщение пользователю о том, что функциональная опция использования видов номенклатуры отключена.
//
// Параметры:
//  ИмяФормы - Строка - имя формы из которой вызывается сообщение.
//  Используется - Булево - признак того, что функциональная опция включена или нет.
//  Отказ - Булево - признак того, что форму сопоставления номенклатуры открывать не нужно.
//
Процедура СообщитьОНеобходимостиИспользованияФункциональнойОпции(Знач ИмяФормы, Знач Используется, Отказ) Экспорт
	
	Если Используется Тогда
		Возврат;
	КонецЕсли;
	
	МассивОпций = ЗависимостьФункционалаОтФункциональныхОпций().Получить(ИмяФормы);
	
	Для Каждого Опция из МассивОпций Цикл
		Если Опция = "ИспользоватьНесколькоВидовНоменклатуры" Тогда
			ТекстСообщения = НСтр("ru = 'Опция использования нескольких видов номенклатуры отключена.'");
		ИначеЕсли Опция = "ИспользоватьСоглашенияСКлиентами" Тогда
			ТекстСообщения = НСтр("ru = 'Опция использования соглашений с клиентами отключена.'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,,,,Отказ);
	КонецЦикла;
	
КонецПроцедуры

// Получение валюты регламентированного учета.
// 
// Параметры:
//  Валюта - СправочникСсылка - валюта регламентированного учета.
//
Процедура ПолучитьВалютуРегламентированногоУчета(Валюта) Экспорт
	
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
КонецПроцедуры

// Создает документ заказ поставщику на основании данных торгового предложения.
//
// Параметры:
//  ДанныеЗаполнения - Структура - данные торгового предложения:
//   * Организация       - СправочникСсылка - организация торгового предложения.
//   * Контрагент        - СправочникСсылка - поставщик торгового предложения.
//   * Валюта            - СправочникСсылка.Валюты - валюта торгового предложения.
//   * СтрокиЗаказа      - ТаблицаЗначений - содержит данные табличной части.
//   * КонтекстИсточника - Структура - набор данных из основания содержащий данные для заполнения шапки документа.
//   * СпособДоставки    - Ссылка - способ доставки прикладного решения.
//   * АдресДоставки     - Строка - представление адреса доставки.
//   * АдресДоставкиЗначенияПолей - Строка - значение адреса доставки в формате XML.
//  ДокументОбъект - ДокументОбъект - возвращается созданный, но не записанный документ.
//
Процедура СоздатьДокументЗаказПоставщикуНаОснованииТорговогоПредложения(Знач ДанныеЗаполнения, ДокументОбъект) Экспорт
	
	КонтекстИсточника = ДанныеЗаполнения.КонтекстИсточника;
	СтрокиЗаказа = ДанныеЗаполнения.СтрокиЗаказа;
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Валюта = ДанныеЗаполнения.Валюта;
	
	ДокументОбъект = Документы.ЗаказПоставщику.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Автор = Пользователи.АвторизованныйПользователь();

	// Реквизиты шапки.
	ДокументОбъект.Организация = Организация;
	ДокументОбъект.Контрагент =  Контрагент;
	ДокументОбъект.Партнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Партнер");
	ДокументОбъект.Валюта = Валюта;
	ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	ДокументОбъект.Статус = Перечисления.СтатусыЗаказовПоставщикам.НеСогласован;
	Если КонтекстИсточника <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДокументОбъект, КонтекстИсточника);
	КонецЕсли;
	
	// Заполнение данных по доставке.
	Если ДанныеЗаполнения.Свойство("СпособДоставки") Тогда
		ДокументОбъект.СпособДоставки = ДанныеЗаполнения.СпособДоставки;
		Если ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя Тогда
			ДокументОбъект.АдресДоставки = ДанныеЗаполнения.АдресДоставки;
			ДокументОбъект.АдресДоставкиЗначенияПолей = ДанныеЗаполнения.АдресДоставкиЗначенияПолей;
		ИначеЕсли ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада Тогда
			ДокументОбъект.АдресДоставкиДляПоставщика = ДанныеЗаполнения.АдресДоставки;
			ДокументОбъект.АдресДоставкиЗначенияПолей = ДанныеЗаполнения.АдресДоставкиЗначенияПолей;
		КонецЕсли;
	КонецЕсли;

	// Заполнение соглашения по статистике.
	ЗаполняемыеРеквизиты = Новый Структура("Соглашение");
	РеквизитыДляОтбора = Новый Структура;
	РеквизитыДляОтбора.Вставить("Партнер", ДокументОбъект.Партнер);
	РеквизитыДляОтбора.Вставить("Валюта", ДокументОбъект.Валюта);
	РеквизитыДляОтбора.Вставить("ЦенаВключаетНДС", ДокументОбъект.ЦенаВключаетНДС);
	ЗаполнениеСвойствПоСтатистикеСервер.ПолучитьЗначенияСвойств(
		ДокументОбъект.Ссылка, ЗаполняемыеРеквизиты, РеквизитыДляОтбора);
	Если ЗначениеЗаполнено(ЗаполняемыеРеквизиты.Соглашение) Тогда
		ДокументОбъект.Соглашение = ЗаполняемыеРеквизиты.Соглашение;
	КонецЕсли;
	
	Сегодня = НачалоДня(ТекущаяДата());
	Сутки = 60 * 60 * 24;
	
	// Товары.
	Для каждого СтрокаЗаказа Из СтрокиЗаказа Цикл
		СтрокаТовары = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаЗаказа);
		СтрокаТовары.Характеристика = СтрокаЗаказа.ХарактеристикаНоменклатуры;
		СтрокаТовары.КоличествоУпаковок = СтрокаЗаказа.Количество;
		СтрокаТовары.ДатаПоступления = Сегодня + (СтрокаЗаказа.СрокПоставки * Сутки);
		Если ЗначениеЗаполнено(СтрокаЗаказа.КонтекстСтроки) Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаЗаказа.КонтекстСтроки);
		КонецЕсли;
	КонецЦикла;
	
	ДокументОбъект.Заполнить(Неопределено); // Инициализация документа.
	ДокументОбъект.ЗаполнитьЭтапыГрафикаОплаты();
	ДокументОбъект.УстановитьНовыйНомер();
	
	ТаблицаДатПоступления = ДокументОбъект.Товары.Выгрузить(, "ДатаПоступления");
	ТаблицаДатПоступления.Свернуть("ДатаПоступления");
	ДокументОбъект.ПоступлениеОднойДатой = ТаблицаДатПоступления.Количество() = 1;
	Если ДокументОбъект.ПоступлениеОднойДатой Тогда
		ДокументОбъект.ДатаПоступления = ТаблицаДатПоступления[0].ДатаПоступления;
	КонецЕсли;
	
КонецПроцедуры

// Удаляет созданные заказы поставщику при переходе на шаг назад.
//
// Параметры:
//  ТаблицаДокументы - ТаблицаЗначений - таблица документов для удаления, состав:
//    * Ссылка - ДокументСсылка - ссылка на удаляемый документ.
//  Отказ - Булево - признак результата удаления документов.
//
Процедура УдалитьДокументыЗаказПоставщику(ТаблицаДокументы, Отказ) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	ТекстИмеютсяСсылки = НСтр("ru = 'Имеются ссылки на %1 - %2.'");
	ТекстПомечен = НСтр("ru = '%1 - помечен на удаление.'");
	ТекстЗаблокирован  = НСтр("ru = '%1 - заблокирован. Пометить на удаление не удалось.'");
	ТекстУдален = НСтр("ru = '%1 - удален.'");
	
	ИменаОбъектовМетаданных = "Документ.ЗаказПоставщику";
	Регистры = ОбщегоНазначенияУТПовтИсп.РегистрыСведенийПоМетаданнымИзмерений(ИменаОбъектовМетаданных, Истина);
	
	СсылкиНаУдаление = Новый Массив();
	Для Каждого Строка Из ТаблицаДокументы Цикл
		СсылкиНаУдаление.Добавить(Строка.Ссылка);
	КонецЦикла;
	
	НазначенияЗаказов = НазначенияЗаказов(СсылкиНаУдаление);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СсылкиНаУдаление, НазначенияЗаказов);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаСсылок = НайтиПоСсылкам(СсылкиНаУдаление);
	
	ВсегоСтрок = ТаблицаСсылок.Количество();
	Для Счетчик = 1 По ВсегоСтрок Цикл
		Ссылка = ТаблицаСсылок[ВсегоСтрок - Счетчик];
		Если Ссылка[0] = Ссылка[1] Или ЭтоЗаписьВедомогоРегистраСведений(Ссылка[1], Регистры) Тогда
			ТаблицаСсылок.Удалить(Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ПомечатьНаУдаление = Новый Массив();
	
	ВсегоСтрок = ТаблицаСсылок.Количество();
	Для Счетчик = 1 По ВсегоСтрок Цикл
		Ссылка = ТаблицаСсылок[ВсегоСтрок - Счетчик];
		Индекс = СсылкиНаУдаление.Найти(Ссылка[1]);
		Если Индекс = Неопределено Тогда
			Если ПомечатьНаУдаление.Найти(Ссылка[0]) = Неопределено Тогда
				ПомечатьНаУдаление.Добавить(Ссылка[0]);
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстИмеютсяСсылки, СокрЛП(Ссылка[0]), СокрЛП(Ссылка[1]));
				Сообщение.Сообщить();
			КонецЕсли;
			ТаблицаСсылок.Удалить(Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ОбработкаЗавершена = Ложь;
	Пока Не ОбработкаЗавершена Цикл
		ОбработкаЗавершена = Истина;
		ВсегоСтрок = ТаблицаСсылок.Количество();
		Для Счетчик = 1 По ВсегоСтрок Цикл
			Ссылка = ТаблицаСсылок[ВсегоСтрок - Счетчик];
			Если ПомечатьНаУдаление.Найти(Ссылка[0]) <> Неопределено Тогда
				Если ПомечатьНаУдаление.Найти(Ссылка[1]) = Неопределено Тогда
					ПомечатьНаУдаление.Добавить(Ссылка[1]);
				КонецЕсли;
				ТаблицаСсылок.Удалить(Ссылка);
				ОбработкаЗавершена = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаДокументы.Очистить();
	
	Для Каждого Ссылка из ПомечатьНаУдаление Цикл
		Индекс = СсылкиНаУдаление.Найти(Ссылка);
		Если Индекс <> Неопределено Тогда
			СсылкиНаУдаление.Удалить(Индекс);
		КонецЕсли;
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		Если Не ДокументОбъект.Заблокирован() Тогда
			ДокументОбъект.УстановитьПометкуУдаления(Истина);
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПомечен, СокрЛП(Ссылка));
		Иначе
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаблокирован, СокрЛП(Ссылка));
		КонецЕсли;
		Сообщение.Сообщить();
	КонецЦикла;
	
	Для Каждого Ссылка Из СсылкиНаУдаление Цикл
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУдален, СокрЛП(Ссылка));
		Сообщение.Сообщить();
	КонецЦикла;
	
	УдалитьОбъекты(СсылкиНаУдаление, Ложь);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Получает значения контекста на основании которого будет производиться поиск предложений
// и которые будут переданы в шапку создаваемых заказов.
//
// Параметры:
//  ПараметрКоманды - Массив - ссылки на документы для заполнения таблицы поиска товаров в 1С:Бизнес-сеть.
//  КонтекстИсточника - Структура - свойства источника, используемые для формирования заказов.
//  ТаблицаТовары - ТаблицаЗначений - товары для поиска с реквизитами, состав:
//    * Номенклатура - СправочникСсылка - номенклатура.
//    * Характеристика - СправочникСсылка - характеристика номенклатуры.
//    * Упаковка - СправочникСсылка - упаковка номенклатуры.
//    * Количество - Число - количество.
//    * ЕдиницаИзмерения - СправочникСсылка - единица измерения номенклатуры.
//    * Числитель - Число - числитель упаковки.
//    * Знаменатель - число - знаменатель номенклатуры.
//    * Склад - СправочникСсылка - склад для заказа.
//    * КонтекстСтроки - Произвольный - дополнительные свойства по источнику.
//
Процедура СвойстваКонтекстаДокументовДляПоискаПредложений(Знач ПараметрКоманды, КонтекстИсточника, ТаблицаТовары) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ДополнительныеРеквизиты = Новый Структура();
		ДополнительныеРеквизиты.Вставить("Организация");
		ДополнительныеРеквизиты.Вставить("Валюта");
		ДополнительныеРеквизиты.Вставить("Приоритет");
		ДополнительныеРеквизиты.Вставить("Проведен");
		ДополнительныеРеквизиты.Вставить("Сделка");
		ДополнительныеРеквизиты.Вставить("Статус");
		ДополнительныеРеквизиты.Вставить("Склад");
		ДополнительныеРеквизиты.Вставить("НаправлениеДеятельности");
		ДополнительныеРеквизиты.Вставить("ЗакупкаПодДеятельность");
		
		СтруктураКонтекстаСтроки = Новый Структура("КонтекстСтрокиСклад");
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура                      КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика                    КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка
		|	КОНЕЦ                                                   КАК Упаковка,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок                КАК Количество,
		|	ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
		|	ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	ЗаказПоставщикуТовары.Упаковка.Числитель                КАК Числитель,
		|	ЗаказПоставщикуТовары.Упаковка.Знаменатель              КАК Знаменатель,
		|	ЗаказПоставщикуТовары.Склад                             КАК КонтекстСтрокиСклад
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка В(&СписокСсылок)"
		
	ИначеЕсли ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ПланЗакупок") Тогда
		
		ДополнительныеРеквизиты = "Валюта, Склад";
		СтруктураКонтекстаСтроки = Новый Структура("КонтекстСтрокиСклад");
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПланЗакупокТовары.Номенклатура                      КАК Номенклатура,
		|	ПланЗакупокТовары.Характеристика                    КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ПланЗакупокТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ПланЗакупокТовары.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ПланЗакупокТовары.Упаковка
		|	КОНЕЦ                                               КАК Упаковка,
		|	ПланЗакупокТовары.КоличествоУпаковок                КАК Количество,
		|	ПланЗакупокТовары.Номенклатура.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
		|	ПланЗакупокТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	ПланЗакупокТовары.Упаковка.Числитель                КАК Числитель,
		|	ПланЗакупокТовары.Упаковка.Знаменатель              КАК Знаменатель,
		|	ПланЗакупокТовары.Склад                             КАК КонтекстСтрокиСклад
		|ИЗ
		|	Документ.ПланЗакупок.Товары КАК ПланЗакупокТовары
		|ГДЕ
		|	ПланЗакупокТовары.Ссылка В(&СписокСсылок)"
		
	ИначеЕсли ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ДополнительныеРеквизиты = Новый Структура();
		ДополнительныеРеквизиты.Вставить("Организация");
		ДополнительныеРеквизиты.Вставить("Валюта");
		ДополнительныеРеквизиты.Вставить("Приоритет");
		ДополнительныеРеквизиты.Вставить("Проведен");
		ДополнительныеРеквизиты.Вставить("Сделка");
		ДополнительныеРеквизиты.Вставить("Склад");
		ДополнительныеРеквизиты.Вставить("Статус");
		ДополнительныеРеквизиты.Вставить("НаправлениеДеятельности");
		ДополнительныеРеквизиты.Вставить("ДокументОснование",      "Ссылка");
		ДополнительныеРеквизиты.Вставить("ЗакупкаПодДеятельность", "НалогообложениеНДС");
		
		СтруктураКонтекстаСтроки = Новый Структура("КонтекстСтрокиСклад");
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура                      КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика                    КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка
		|	КОНЕЦ                                                КАК Упаковка,
		|	ЗаказКлиентаТовары.КоличествоУпаковок                КАК Количество,
		|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
		|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	ЗаказКлиентаТовары.Упаковка.Числитель                КАК Числитель,
		|	ЗаказКлиентаТовары.Упаковка.Знаменатель              КАК Знаменатель,
		|	ЗаказКлиентаТовары.Склад                             КАК КонтекстСтрокиСклад
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка В(&СписокСсылок)"
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокСсылок", ПараметрКоманды);
	Товары = Запрос.Выполнить().Выгрузить();
	Товары.Колонки.Добавить("КонтекстСтроки");
	Для Каждого СтрокаТоваров Из Товары Цикл
		КонтекстСтроки = Новый Структура();
		Для Каждого Свойство из СтруктураКонтекстаСтроки Цикл
			ИмяРеквизита = СтрЗаменить(Свойство.Ключ, "КонтекстСтроки", "");
			КонтекстСтроки.Вставить(ИмяРеквизита, СтрокаТоваров[Свойство.Ключ])
		КонецЦикла;
		СтрокаТоваров.КонтекстСтроки = КонтекстСтроки;
		ЗаполнитьЗначенияСвойств(ТаблицаТовары.Добавить(), СтрокаТоваров);
	КонецЦикла;
	КонтекстИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрКоманды[0], ДополнительныеРеквизиты);
	
КонецПроцедуры

// Производит пересчет суммы для заказа товаров.
//
// Параметры:
//  СтрокаТоваров - Структура - реквизиты строки товаров для пересчета суммы при формировании заказов.
//                              См. ФормированиеЗаказов.ОписаниеСтрокиТаблицыТовары(), состав:
//    * ПроцентНДС      - Строка - значение НДС, полученное из сервиса.
//    * СтавкаНДС       - Ссылка - значение ставки НДС.
//    * Цена            - Число - цена товара для заказа.
//    * ЦенаВключаетНДС - Булево - признак включения НДС в цену.
//    * Количество      - Число - количество товара для заказа.
//    * Сумма           - Число - сумма заказа по строке.
//    * СуммаНДС        - Число - сумма НДС строки.
//    * СуммаСНДС       - Число - значение суммы с НДС.
//
Процедура ПересчитатьСуммуПоСтроке(СтрокаТоваров) Экспорт
	
	ПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтрокаТоваров.СтавкаНДС);
	СтрокаТоваров.Сумма = СтрокаТоваров.Количество * СтрокаТоваров.Цена;
	СтрокаТоваров.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаТоваров.Сумма, ПроцентНДС,
		СтрокаТоваров.ЦенаВключаетНДС);
	Если СтрокаТоваров.ЦенаВключаетНДС Тогда
		СтрокаТоваров.СуммаСНДС = СтрокаТоваров.Сумма;
	Иначе
		СтрокаТоваров.СуммаСНДС = СтрокаТоваров.Сумма + СтрокаТоваров.СуммаНДС;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливаем условное оформление для единиц измерения номенклатуры.
//
// Параметры:
// 	 Форма - Форма - управляемая форму.
// 	 ИмяПоляВводаЕдиницИзмерения - Строка - наименование элемента формы, содержащего ед. измерения номенклатуры.
// 	 ПутьКПолюОтбора - Строка - полный путь к реквизиту.
//
Процедура УстановитьУсловноеОформлениеЕдиницИзмерения(Форма, Знач ИмяПоляВводаЕдиницИзмерения, Знач ПутьКПолюОтбора) Экспорт
	
	// См. процедуру НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения.
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(Форма, ИмяПоляВводаЕдиницИзмерения, ПутьКПолюОтбора);
	
КонецПроцедуры

// Устанавливает значение свойства элементов формы, если находит элемент на форме.
//
// Параметры:
//  ЭлементыФормы  - ВсеЭлементыФормы - элементы формы, среди которых содержится искомый элемент.
//  ИменаЭлементов - Массив, Строка, Структура - имена искомых элементов.
//  ИмяСвойства    - Строка - имя свойства, для которого будет устанавливаться значение.
//  Значение       - Произвольный - значение, которое будет установлено.
//  УстанавливатьДляПодчиненных - Булево - установить аналогичное свойство для подчиненных элементов искомых элементов.
//
Процедура УстановитьСвойствоЭлементовФормы(ЭлементыФормы, ИменаЭлементов, ИмяСвойства, Значение, УстанавливатьДляПодчиненных = Ложь) Экспорт
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭлементыФормы, ИменаЭлементов, ИмяСвойства, Значение, УстанавливатьДляПодчиненных);
	
КонецПроцедуры

// Получение доступных типов значений свойств для сопоставления.
// 
// Параметры:
//  ТипыЗначенийСвойств - СписокЗначений - доступные типы значений, например Тип("СправочникСсылка.Производители").
//
Процедура ПолучитьДоступныеТипыЗначенийСвойствДляСопоставления(ТипыЗначенийСвойств) Экспорт
	
	ТипыЗначенийСвойств.Добавить(Тип("СправочникСсылка.ЗначенияСвойствОбъектов"));
	ТипыЗначенийСвойств.Добавить(Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия"));
	ТипыЗначенийСвойств.Добавить(Тип("СправочникСсылка.Производители"));
	ТипыЗначенийСвойств.Добавить(Тип("СправочникСсылка.Марки"));
	
КонецПроцедуры

// Возвращает пустую ссылку реквизита объекта для сопоставления.
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка - пустая ссылка для заполнения сопоставления,
//                         например ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.
//
Процедура ПустаяСсылкаРеквизитаОбъектаДляСопоставления(Ссылка) Экспорт
	
	Ссылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
	
КонецПроцедуры

// Получение реквизитов номенклатуры поставщика.
//
// Параметры:
//  НоменклатураПоставщиков	- Массив - список ссылок справочника номенклатура поставщика.
//  ТаблицаРеквизитов - ТаблицаЗначений - состав колонок:
//    * НоменклатураПоставщика       - СправочникСсылка - ссылка справочника номенклатура поставщика.
//    * Номенклатура                 - СправочникСсылка - ссылка справочника 
//    * ИспользованиеХарактеристик   - Булево - признак использования характеристик номенклатуры.
//    * Упаковка                     - СправочникСсылка - упаковка номенклатуры.
//    * ХарактеристикаНоменклатуры   - СправочникСсылка - характеристика номенклатуры.
//    * ЕдиницаИзмеренияНоменклатуры - СправочникСсылка - единица измерения номенклатуры.
//
Процедура ПолучитьРеквизитыНоменклатурыПоставщика(Знач НоменклатураПоставщиков, ТаблицаРеквизитов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураПоставщиков.Ссылка КАК НоменклатураПоставщика,
	|	НоменклатураПоставщиков.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НоменклатураПоставщиков.Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИспользованиеХарактеристик,
	|	НоменклатураПоставщиков.Упаковка КАК Упаковка,
	|	НоменклатураПоставщиков.Характеристика КАК ХарактеристикаНоменклатуры,
	|	НоменклатураПоставщиков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияНоменклатуры
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НоменклатураПоставщиков.Ссылка В(&НоменклатураПоставщиков)";
	
	Запрос.УстановитьПараметр("НоменклатураПоставщиков", НоменклатураПоставщиков);
	ТаблицаРеквизитов = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// Заполнение пакета торговых предложений.
//
// Параметры:
//  ТорговоеПредложение	 - СправочникСсылка - ссылка на элемент справочника определяющего торговые предложения,
//                                            например СправочникСсылка.Соглашения.
//  ПакетПредложений	 - Структура - свойства публикуемого торгового предложения.
//                         см. ТорговыеПредложения.ОписаниеПакетаПредложений().
//
Процедура ЗаполнитьПакетПредложений(Знач ТорговоеПредложение, ПакетПредложений) Экспорт
	
	// Заполнение общих реквизитов
	
	Реквизиты = "Организация, Валюта, ВидЦен, Статус, ДатаНачалаДействия, ДатаОкончанияДействия,
		|Менеджер, СегментПартнеров, ЦенаВключаетНДС";
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТорговоеПредложение, Реквизиты);
	ЗначенияРеквизитов.Вставить("Действует", ЗначенияРеквизитов.Статус = Перечисления.СтатусыСоглашенийСКлиентами.Действует);
	ЗаполнитьЗначенияСвойств(ПакетПредложений, ЗначенияРеквизитов);
	
	// Заполнение контактной информации.
	ИННКППОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитов.Организация, "ИНН, КПП");
	
	ПакетПредложений.КонтактыОрганизации.ИНН = ИННКППОрганизации.ИНН;
	ПакетПредложений.КонтактыОрганизации.КПП = ?(ПустаяСтрока(ИННКППОрганизации.КПП), "0", ИННКППОрганизации.КПП);
	ПакетПредложений.КонтактыОрганизации.Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЗначенияРеквизитов.Организация,
		Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации, ТекущаяДатаСеанса());
	ПакетПредложений.КонтактыОрганизации.ЭлектроннаяПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЗначенияРеквизитов.Организация,
		Справочники.ВидыКонтактнойИнформации.EmailОрганизации, ТекущаяДатаСеанса());
		
	ВидВебСайт = Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("Тип", Перечисления.ТипыКонтактнойИнформации.ВебСтраница, Справочники.ВидыКонтактнойИнформации.СправочникОрганизации);
	ПакетПредложений.КонтактыОрганизации.Сайт = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЗначенияРеквизитов.Организация,
		ВидВебСайт, ТекущаяДатаСеанса());
	
	ПакетПредложений.КонтактноеЛицо.ФИО = Строка(ЗначенияРеквизитов.Менеджер);
	ПакетПредложений.КонтактноеЛицо.Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЗначенияРеквизитов.Менеджер,
		Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, ТекущаяДатаСеанса());
	ПакетПредложений.КонтактноеЛицо.ЭлектроннаяПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЗначенияРеквизитов.Менеджер,
		Справочники.ВидыКонтактнойИнформации.EmailПользователя, ТекущаяДатаСеанса());
		
	// Заполнение сегмента контрагентов.
	ЗаполнитьКонтрагентовПакетаПредложений(ТорговоеПредложение, ПакетПредложений.СписокКонтрагентов);
	
	// Заполнение товаров.
	ЗаполнитьТоварыПакетаПредложений(ПакетПредложений, ТорговоеПредложение);
		
КонецПроцедуры

// Заполнение контактной информации по контактному лицу.
//
// Параметры:
//  КонтактноеЛицо    - СправочникСсылка - контактное лицо в информационной базе, например СправочникСсылка.ФизическиеЛица.
//  ЭлектроннаяПочта  - Строка - адрес электронной почты.
//  Телефон           - Строка - номер телефона.
//  УведомлятьПоПочте - Булево - признак необходимости уведомления по электронной почте.
//  Перезаполнять     - Булево - признак необходимости перезаполнения информации.
//
Процедура ЗаполнитьКонтактнуюИнформациюПоКонтактномуЛицу(Знач КонтактноеЛицо, ЭлектроннаяПочта, Телефон, УведомлятьПоПочте, Знач Перезаполнять = Ложь) Экспорт
	
	Если ТипЗнч(КонтактноеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") и Не КонтактноеЛицо.Пустая() Тогда
		Если ПустаяСтрока(ЭлектроннаяПочта) или Перезаполнять Тогда
			ЭлектроннаяПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтактноеЛицо,
				Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица, ТекущаяДатаСеанса());
		КонецЕсли;
		Если ПустаяСтрока(Телефон) или Перезаполнять Тогда
			Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтактноеЛицо,
				Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица, ТекущаяДатаСеанса());
		КонецЕсли;
	КонецЕсли;
	
	УведомлятьПоПочте = Не ПустаяСтрока(ЭлектроннаяПочта);
	
КонецПроцедуры

// Заполнение реквизитов номенклатуры в процедуре формирования заказа.
// См. Обработка.ТорговыеПредложения.Форма.ФормированиеЗаказов.
//
// Параметры:
//  Номенклатура - СправочникСсылка - ссылка на справочник номенклатура.
//  Результат	 - Структура - возвращаемые реквизиты ссылки справочника, 
//                             см. ТорговыеПредложения.ОписаниеРеквизитовНоменклатуры():
//    ИспользованиеХарактеристик - Булево - признак использования характеристик номенклатуры.
//    ЕдиницаИзмерения - СправочникСсылка - единица измерения номенклатуры.
//    Упаковка - СправочникСсылка - упаковка номенклатуры.
//    НоменклатураПоставщика - СправочникСсылка - пустая ссылка номенклатура поставщика.
//
Процедура ЗаполнитьРеквизитыНоменклатурыДляФормированияЗаказа(Знач Номенклатура, Результат) Экспорт
	
	Результат.ИспользованиеХарактеристик = Ложь;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Результат.ИспользованиеХарактеристик = Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ИспользованиеХарактеристик") = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
	КонецЕсли;
	
	Результат.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения");
	Результат.НоменклатураПоставщика = ПредопределенноеЗначение("Справочник.НоменклатураПоставщиков.ПустаяСсылка");
	Результат.Вставить("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	
КонецПроцедуры

// Инициализация динамического списка сопоставления номенклатуры в форме сопоставления номенклатуры.
// Заполняется переопределяемый текст запроса и свойства списка.
// См. форму обработки ТорговыеПредложения.СопоставлениеНоменклатуры.
//
// Параметры:
//  Список - ЭлементФормы - элемент динамического списка в форме.
//
Процедура ИнициализацияСпискаСопоставленияНоменклатуры(Список) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СправочникВидыНоменклатуры.Ссылка КАК Ссылка,
	|	СправочникВидыНоменклатуры.Наименование КАК Наименование,
	|	СоответствиеКатегорий.ПредставлениеКатегории КАК Категория,
	|	СоответствиеКатегорий.ИдентификаторКатегории КАК ИдентификаторКатегории
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК СправочникВидыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыБизнесСеть КАК СоответствиеКатегорий
	|		ПО СправочникВидыНоменклатуры.Ссылка = СоответствиеКатегорий.ОбъектСопоставления";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "Справочник.ВидыНоменклатуры";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Список, СвойстваСписка);
	
КонецПроцедуры

// Добавление служебных колонок в таблицу товары.
//
// Параметры:
//  Товары - ТаблицаЗначений - исходная таблица с товарами, колонки:
//    Обязательные поля:
//    * Номенклатура   - СправочникСсылка - номенклатурная позиция.
//    * Характеристика - СправочникСсылка - характеристика номенклатуры.
//    * Упаковка       - СправочникСсылка - упаковка номенклатуры.
//    * Количество     - Число - количество.
//    Заполняемые поля:
//    * УпаковкаКод         - Строка - код упаковки.
//    * ЕдиницаИзмеренияКод - Строка - код единицы измерения.
//    * УпаковкаЧислитель   - Число - числитель упаковки номенклатуры.
//    * УпаковкаЗнаменатель - Число - знаменатель упаковки номенклатуры.
//    * Артикул             - Строка - артикул номенклатуры.
//    * Наименование        - Строка - наименование номенклатуры.
//    * Штрихкоды            - Массив - штрихкоды номенклатуры.
//  ПолучатьШтрихКоды - Булево - признак необходимости заполнения штрихкодов номенклатуры.
//                               Для значения Ложь, штрихкоды не заполняются.
//
Процедура ДобавитьСлужебныеКолонкиТовары(Товары, Знач ПолучатьШтрихКоды = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Товары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(Товары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
	|	ВЫРАЗИТЬ(Товары.Количество КАК ЧИСЛО(15, 3)) КАК Количество
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура.Артикул КАК Артикул,
	|	Товары.Номенклатура.Наименование КАК Наименование,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	СоответствиеНоменклатурыБизнесСеть.ИдентификаторКатегории КАК ИдентификаторКатегории,
	|	Товары.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ Товары.Упаковка.Знаменатель
	|	КОНЕЦ КАК УпаковкаЗнаменатель,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ Товары.Упаковка.Числитель
	|	КОНЕЦ КАК УпаковкаЧислитель,
	|	Товары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка.Знаменатель = 0
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(Товары.Упаковка)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Товары.Упаковка.ЕдиницаИзмерения)
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка.Знаменатель = 0
	|			ТОГДА Товары.Упаковка.Код
	|		ИНАЧЕ Товары.Упаковка.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК УпаковкаКод,
	|	Товары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыБизнесСеть КАК СоответствиеНоменклатурыБизнесСеть
	|		ПО Товары.Номенклатура.ВидНоменклатуры = СоответствиеНоменклатурыБизнесСеть.ОбъектСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО Товары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И Товары.Характеристика = ШтрихкодыНоменклатуры.Характеристика
	|			И Товары.Упаковка = ШтрихкодыНоменклатуры.Упаковка";
	
	Запрос.УстановитьПараметр("Товары", Товары);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	Выборка = РезультатПакета[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТовары = Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Упаковка",
			Выборка.Номенклатура, Выборка.Характеристика, Выборка.Упаковка));
		Если СтрокаТовары.Количество() Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТовары[0], Выборка,, "Номенклатура, Характеристика, Упаковка");
		КонецЕсли;
	КонецЦикла;
	
	Если ПолучатьШтрихКоды Тогда
		ВыборкаШтрихКоды = РезультатПакета[2].Выбрать();
		Пока ВыборкаШтрихКоды.Следующий() Цикл
			СтрокаТовары = Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Упаковка",
				ВыборкаШтрихКоды.Номенклатура, ВыборкаШтрихКоды.Характеристика, ВыборкаШтрихКоды.Упаковка));
				
			Если СтрокаТовары <> Неопределено Тогда
				Если СтрокаТовары[0].ШтрихКоды = Неопределено Тогда
					МассивШтрихКодов = Новый Массив;
					МассивШтрихКодов.Добавить(ВыборкаШтрихКоды.ШтрихКод);
					СтрокаТовары[0].ШтрихКоды = МассивШтрихКодов;
				Иначе
					СтрокаТовары[0].ШтрихКоды.Добавить(ВыборкаШтрихКоды.ШтрихКод);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Получение текста запроса соответствия значений реквизитов вида номенклатуры.
// 
// В запросе необходимо вернуть таблицу содержащую количество значений
// реквизита в информационной базе и количество сопоставленных реквизитов.
// Параметры запроса: &РеквизитОбъекта, &ОбъектСопоставления.
// Поля запроса: КоличествоЗначенийРеквизита, КоличествоСопоставленныхРеквизитов.
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса.
//
Процедура ПолучитьТекстЗапросаСоответствияЗначенийРеквизитовВидаНоменклатуры(ТекстЗапроса) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Значение(Перечисление.РеквизитыСопоставленияНоменклатурыБизнесСеть.Производитель) КАК РеквизитОбъекта,
	|	Производители.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Справочник_Производители
	|ИЗ
	|	Справочник.Производители КАК Производители
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Значение(Перечисление.РеквизитыСопоставленияНоменклатурыБизнесСеть.Марка) КАК РеквизитОбъекта,
	|	Марки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Справочник_Марки
	|ИЗ
	|	Справочник.Марки КАК Марки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.РеквизитОбъекта КАК РеквизитОбъекта,
	|	ВложенныйЗапрос.КоличествоЗначенийРеквизита КАК КоличествоЗначенийРеквизита,
	|	ВложенныйЗапрос.КоличествоСопоставленныхРеквизитов КАК КоличествоСопоставленныхРеквизитов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаРеквизитов.Свойство КАК РеквизитОбъекта,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗначенияСвойствОбъектов.Ссылка) КАК КоличествоЗначенийРеквизита,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеЗначенийРеквизитовБизнесСеть.Значение) КАК КоличествоСопоставленныхРеквизитов
	|	ИЗ
	|		Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ТаблицаРеквизитов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|				ПО (ЗначенияСвойствОбъектов.Владелец В (СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта, СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта.ВладелецДополнительныхЗначений))
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗначенийРеквизитовБизнесСеть КАК СоответствиеЗначенийРеквизитовБизнесСеть
	|				ПО СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = СоответствиеЗначенийРеквизитовБизнесСеть.РеквизитОбъекта
	|			ПО ТаблицаРеквизитов.Свойство = СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта
	|				И (ТаблицаРеквизитов.Ссылка = &ОбъектСопоставления
	|					ИЛИ ТаблицаРеквизитов.Ссылка.Родитель В (ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура), ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ХарактеристикиНоменклатуры)))
	|	ГДЕ
	|		(ВЫРАЗИТЬ(ТаблицаРеквизитов.Свойство КАК ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения)) = &РеквизитОбъекта
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаРеквизитов.Свойство
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Справочник_Производители.Ссылка),
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеЗначенийРеквизитовБизнесСеть.Значение)
	|	ИЗ
	|		РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник_Производители КАК Справочник_Производители
	|			ПО СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = Справочник_Производители.РеквизитОбъекта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗначенийРеквизитовБизнесСеть КАК СоответствиеЗначенийРеквизитовБизнесСеть
	|			ПО СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = СоответствиеЗначенийРеквизитовБизнесСеть.РеквизитОбъекта
	|				И СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления = СоответствиеЗначенийРеквизитовБизнесСеть.ОбъектСопоставления
	|	ГДЕ
	|		СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления = &ОбъектСопоставления
	|		И СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = Значение(Перечисление.РеквизитыСопоставленияНоменклатурыБизнесСеть.Производитель)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Справочник_Марки.Ссылка),
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеЗначенийРеквизитовБизнесСеть.Значение)
	|	ИЗ
	|		РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник_Марки КАК Справочник_Марки
	|			ПО СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = Справочник_Марки.РеквизитОбъекта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗначенийРеквизитовБизнесСеть КАК СоответствиеЗначенийРеквизитовБизнесСеть
	|			ПО СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = СоответствиеЗначенийРеквизитовБизнесСеть.РеквизитОбъекта
	|				И СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления = СоответствиеЗначенийРеквизитовБизнесСеть.ОбъектСопоставления
	|	ГДЕ
	|		СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления = &ОбъектСопоставления
	|		И СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = Значение(Перечисление.РеквизитыСопоставленияНоменклатурыБизнесСеть.Марка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.РеквизитОбъекта = &РеквизитОбъекта";
	
КонецПроцедуры

// Получение сопоставленных значений реквизита вида номенклатуры.
//
// Параметры:
//  ОбъектСопоставления - СправочникСсылка - ссылка на справочник виды номенклатуры.
//  РеквизитОбъекта	    - Строка, СправочникСсылка - реквизит объекта.
//  ТипЗначения	        - ОписаниеТипов - тип значений реквизита.
//  ЗначенияРеквизита   - ТаблицаЗначений - список сопоставленных реквизитов, колонки:
//   * Значение                                - СправочникСсылка, Строка, Число, Булево - сопоставленное значение.
//   * ИдентификаторЗначенияРеквизитаКатегории - Строка - идентификатор сопоставленного значения.
//   * ПредставлениеЗначенияРеквизитаКатегории - Строка - представление сопоставленного значения.
//
Процедура ПолучитьСопоставленныеЗначенияРеквизитаВидаНоменклатуры(Знач ОбъектСопоставления, Знач РеквизитОбъекта, Знач ТипЗначения, ЗначенияРеквизита) Экспорт
	
	// Вывод в список всех реквизитов в ИБ.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка,
	|	ЗначенияСвойствОбъектов.Владелец КАК Владелец
	|ПОМЕСТИТЬ ЗначенияСвойствОбъектов
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Владелец В
	|			(ВЫБРАТЬ
	|				ВЫБОР
	|					КОГДА ДополнительныеРеквизитыИСведения.ВладелецДополнительныхЗначений = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка)
	|						ТОГДА &Владелец
	|					ИНАЧЕ ДополнительныеРеквизитыИСведения.ВладелецДополнительныхЗначений
	|				КОНЕЦ КАК Поле1
	|			ИЗ
	|				ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|			ГДЕ
	|				ДополнительныеРеквизитыИСведения.Ссылка = &Владелец)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектовИерархия.Ссылка,
	|	ЗначенияСвойствОбъектовИерархия.Владелец
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектовИерархия КАК ЗначенияСвойствОбъектовИерархия
	|ГДЕ
	|	ЗначенияСвойствОбъектовИерархия.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Ссылка КАК Значение,
	|	СоответствиеЗначенийРеквизитовБизнесСеть.ИдентификаторЗначенияРеквизитаКатегории КАК ИдентификаторЗначенияРеквизитаКатегории,
	|	СоответствиеЗначенийРеквизитовБизнесСеть.ПредставлениеЗначенияРеквизитаКатегории КАК ПредставлениеЗначенияРеквизитаКатегории
	|ИЗ
	|	ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗначенийРеквизитовБизнесСеть КАК СоответствиеЗначенийРеквизитовБизнесСеть
	|		ПО ЗначенияСвойствОбъектов.Ссылка = СоответствиеЗначенийРеквизитовБизнесСеть.Значение
	|			И (СоответствиеЗначенийРеквизитовБизнесСеть.ОбъектСопоставления = &ОбъектСопоставления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Значение
	|АВТОУПОРЯДОЧИВАНИЕ";	
	
	Если ТипЗнч(РеквизитОбъекта) = Тип("ПеречислениеСсылка.РеквизитыСопоставленияНоменклатурыБизнесСеть") Тогда
		
		// Модификация запроса для получения значений справочника.
		Тип = ТипЗначения.Типы()[0];
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		Если ОбъектМетаданных = Неопределено Тогда
			ЗначенияРеквизита = Неопределено;
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ЗначенияСвойствОбъектовИерархия", "." + ОбъектМетаданных.Имя);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияСвойствОбъектовИерархия.Владелец = &Владелец", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияСвойствОбъектовИерархия.Владелец", "NULL");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Владелец", РеквизитОбъекта);
	Запрос.УстановитьПараметр("ОбъектСопоставления", ОбъектСопоставления);
	
	ЗначенияРеквизита = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// Заполнение реквизитов заказов.
//
// Параметры:
//  ТаблицаЗаказов	 - ТаблицаЗначений - таблица с ссылками и реквизитами для заполнения.
//                     см. ТорговыеПредложения.ФормированиеЗаказов.Заказы.
//
Процедура ЗаполнитьРеквизитыЗаказов(ТаблицаЗаказов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка,
	|	ЗаказПоставщику.Контрагент,
	|	ЗаказПоставщику.Организация,
	|	ЗаказПоставщику.СуммаДокумента,
	|	ЗаказПоставщику.Валюта,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщику.Проведен
	|			ТОГДА 1
	|		КОГДА ЗаказПоставщику.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗначениеКартинки
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&СписокДокументов)
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("СписокДокументов", ТаблицаЗаказов.ВыгрузитьКолонку("Ссылка"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаЗаказов.Найти(Выборка.Ссылка, "Ссылка");
		Если СтрокаТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
	КонецЦикла;
	
КонецПроцедуры

// Получение публикуемых реквизитов номенклатуры.
// 
// Параметры:
//  ПубликуемыеРеквизиты - Соответствие - реквизиты справочника Номенклатура, публикуемые для торговых предложений.
//    * Ключ     - Произвольный - значение реквизита сопоставления, см. определяемый тип ДополнительныеРеквизитыБизнесСеть.
//    * Значение - Структура - свойства реквизита:
//      ** Представление    - Строка - наименование для отображения.
//      ** ПутьКДанным      - Строка - текст запроса для получения данных.
//      ** ТипЗначения      - ОписаниеТипов - описание типа данных.
//      ** ПустоеЗначение   - Произвольный - Значение реквизита, при котором, он считается не заполненным.
//
Процедура ПолучитьРеквизитыНоменклатурыДоступныеДляПубликации(ПубликуемыеРеквизиты) Экспорт
	
	// Номенклатура.Вес.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Вес'"));
	СвойстваРеквизита.Вставить("ПутьКДанным",
		"ВЫБОР КОГДА Номенклатура.ВесИспользовать И Номенклатура.ВесЗнаменатель <> 0 ТОГДА
		|		Номенклатура.ВесЧислитель/Номенклатура.ВесЗнаменатель ИНАЧЕ 0 КОНЕЦ");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("Число"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", 0);
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Вес, СвойстваРеквизита);
		
	// Номенклатура.Длина.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Длина'"));
	СвойстваРеквизита.Вставить("ПутьКДанным",
		"ВЫБОР КОГДА Номенклатура.ДлинаИспользовать И Номенклатура.ДлинаЗнаменатель <> 0 ТОГДА
		|		Номенклатура.ДлинаЧислитель/Номенклатура.ДлинаЗнаменатель ИНАЧЕ 0 КОНЕЦ");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("Число"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", 0);
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Длина, СвойстваРеквизита);
	
	// Номенклатура.Объем.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Объем'"));
	СвойстваРеквизита.Вставить("ПутьКДанным",
		"ВЫБОР КОГДА Номенклатура.ОбъемИспользовать И Номенклатура.ОбъемЗнаменатель <> 0 ТОГДА
		|		Номенклатура.ОбъемЧислитель/Номенклатура.ОбъемЗнаменатель ИНАЧЕ 0 КОНЕЦ");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("Число"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", 0);
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Объем, СвойстваРеквизита);
	
	// Номенклатура.Производитель.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Производитель'"));
	СвойстваРеквизита.Вставить("ПутьКДанным", "Номенклатура.Производитель");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("СправочникСсылка.Производители"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", Справочники.Производители.ПустаяСсылка());
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Производитель, СвойстваРеквизита);
	
	// Номенклатура.Марка.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Марка'"));
	СвойстваРеквизита.Вставить("ПутьКДанным", "Номенклатура.Марка");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("СправочникСсылка.Марки"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", Справочники.Марки.ПустаяСсылка());
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Марка, СвойстваРеквизита);
	
КонецПроцедуры

// Процедура, вызываемая из обработчика события формы ПриСозданииНаСервере.
//
// Параметры:
//  Форма - УправляемаяФорма - из обработчика события которой происходит вызов процедуры.
//
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	Если Найти(Форма.ИмяФормы, "ПоискПоТоварам") Тогда
		
		ГруппЭлементов = Форма.Элементы.Найти("ГруппаКоманднойПанелиПереопределяемая");
		Если ГруппЭлементов = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИмяКоманды = ГруппЭлементов.Имя + "ВставкаИзБуфера";
		
		Если Форма.Команды.Найти(ИмяКоманды) <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// Формирование команды вставки из буфера.
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Действие = "Подключаемый_ПереопределяемаяКоманда";
		КомандаФормы.Заголовок = "Вставка из буфера";
		КомандаФормы.ИзменяетСохраняемыеДанные = Истина;
		КомандаФормы.Отображение = ОтображениеКнопки.Картинка;
		КомандаФормы.Картинка = БиблиотекаКартинок.ВставитьИзБуфераОбмена;
		КомандаФормы.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.V, , Истина, Истина);
		КомандаФормы.Подсказка = "Вставка из буфера";
		КнопкаФормы = Форма.Элементы.Добавить("ТоварыВставитьСтроки", Тип("КнопкаФормы"), ГруппЭлементов);
		КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаФормы.ИмяКоманды = ИмяКоманды;
		
		// Формирование команды вставки из буфера.
		ИмяКоманды = ГруппЭлементов.Имя + "ПодобратьТовары";
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Действие = "Подключаемый_ПереопределяемаяКоманда";
		КомандаФормы.Заголовок = "Подобрать товары";
		КомандаФормы.ИзменяетСохраняемыеДанные = Истина;
		КомандаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КомандаФормы.Картинка = БиблиотекаКартинок.ПодобратьТовары;
		КомандаФормы.Подсказка = "Открыть подбор товаров";
		КнопкаФормы = Форма.Элементы.Добавить("ПодобратьТовары", Тип("КнопкаФормы"), ГруппЭлементов);
		КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаФормы.ИмяКоманды = ИмяКоманды;
		
		УстановитьДоступностьКомандБуфераОбмена(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка выбора формы (переопределяемое события).
// Вызов производится на сервере. См. описание метода ОбработкаВыбора.
//
// Параметры:
//  Форма				 - УправляемаяФорма - форма источник события.
//  ВыбранноеЗначение	 - Произвольный - выбранное событие.
//  ИсточникВыбора		 - Произвольный - форма, где осуществлен выбор.
//
Процедура ОбработатьВыбор(Форма, Знач ВыбранноеЗначение, Знач ИсточникВыбора) Экспорт
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровПоОтбору.Форма.Форма"
		И Форма.ИмяФормы = "Обработка.ТорговыеПредложения.Форма.ПоискПоТоварам" Тогда
		
		ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
		
		ЕдиницыИзмеренияНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
			ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура"),
			"ЕдиницаИзмерения");
		
		Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
			
			ТекущаяСтрока = Форма.Список.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара);
			
			ТекущаяСтрока.Упаковка = ЕдиницыИзмеренияНоменклатуры.Получить(СтрокаТовара.Номенклатура);
			ТекущаяСтрока.Количество = 1;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

// Обработка оповещения формы (переопределяемое событие).
// Вызывается на сервере. См. метод ОбработкаОповещения.
//
// Параметры:
//  ИмяСобытия - Строка - имя оповещения.
//  Параметр   - Произвольный - параметр сообщения.
//  Источник   - УправляемаяФорма - форма источник события.
//
Процедура ОбработатьОповещение(Знач ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "КопированиеСтрокВБуферОбмена"
		И Источник.ИмяФормы = "Обработка.ТорговыеПредложения.Форма.ПоискПоТоварам" Тогда
		
		УстановитьДоступностьКомандБуфераОбмена(Источник);
		
	КонецЕсли;
	
КонецПроцедуры

// Получение данных для сопоставления реквизитов и значений реквизитов информационной базы и сервиса.
//
// Параметры:
//  ОбъектСопоставления      - СправочникСсылка - ссылка на справочник виды номенклатуры.
//  СопоставленныеРеквизиты	 - ТаблицаЗначений - сопоставленные реквизиты в ИБ.
//    * РеквизитОбъекта                 - Произвольный - реквизит.
//    * ИдентификаторРеквизитаКатегории - Строка - идентификатор реквизита категории в сервисе.
//    * Представление                   - Строка - представление реквизита.
//  ДополнительныеРеквизиты  - ТаблицаЗначений - дополнительные реквизиты номенклатуры.
//    * РеквизитОбъекта - Произвольный - реквизит.
//    * ТипЗначения     - ОписаниеТипов - тип реквизита.
//  РасчетСоответствий       - ТаблицаЗначений - таблица количества соответствий значений реквизитов.
//    * РеквизитОбъекта                    - Произвольный - реквизит.
//    * КоличествоЗначенийРеквизита        - Число - количество значений реквизита в ИБ.
//    * КоличествоСопоставленныхРеквизитов - Число - количество сопоставленных значений реквизитов.
//
Процедура ПолучитьДанныеСопоставленияРеквизитов(ОбъектСопоставления, СопоставленныеРеквизиты, ДополнительныеРеквизиты, РасчетСоответствий) Экспорт
	
	// Заполнение списка набора реквизитов.
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеРеквизиты.РеквизитОбъекта КАК РеквизитОбъекта,
	|	ДополнительныеРеквизиты.Представление КАК Представление
	|ПОМЕСТИТЬ ДополнительныеРеквизиты
	|ИЗ
	|	&ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыНоменклатуры.Свойство КАК РеквизитОбъекта,
	|	РеквизитыНоменклатуры.Свойство.ТипЗначения КАК ТипЗначения,
	|	РеквизитыНоменклатуры.Свойство.Наименование КАК Представление
	|ПОМЕСТИТЬ ТаблицаРеквизитов
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК РеквизитыНоменклатуры
	|ГДЕ
	|	РеквизитыНоменклатуры.Ссылка В
	|			(ВЫБРАТЬ
	|				ВидыНоменклатуры.НаборСвойств
	|			ИЗ
	|				Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ГДЕ
	|				ВидыНоменклатуры.Ссылка = &ОбъектСопоставления
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				ВидыНоменклатуры.НаборСвойствХарактеристик
	|			ИЗ
	|				Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ГДЕ
	|				ВидыНоменклатуры.Ссылка = &ОбъектСопоставления
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				&ОбщийРеквизитНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРеквизитов.РеквизитОбъекта КАК РеквизитОбъекта,
	|	СоответствиеРеквизитовБизнесСеть.ИдентификаторРеквизитаКатегории КАК ИдентификаторРеквизитаКатегории,
	|	ТаблицаРеквизитов.Представление КАК Представление
	|ИЗ
	|	ТаблицаРеквизитов КАК ТаблицаРеквизитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|		ПО ТаблицаРеквизитов.РеквизитОбъекта = СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта
	|			И (СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления = &ОбъектСопоставления)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДополнительныеРеквизиты.РеквизитОбъекта,
	|	СоответствиеРеквизитовБизнесСеть.ИдентификаторРеквизитаКатегории,
	|	ВЫРАЗИТЬ(ДополнительныеРеквизиты.Представление КАК СТРОКА(50))
	|ИЗ
	|	ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|		ПО (ДополнительныеРеквизиты.РеквизитОбъекта = (ВЫРАЗИТЬ(СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта КАК Перечисление.РеквизитыСопоставленияНоменклатурыБизнесСеть)))
	|			И (СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления = &ОбъектСопоставления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДополнительныеРеквизиты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Значение(Перечисление.РеквизитыСопоставленияНоменклатурыБизнесСеть.Производитель) КАК РеквизитОбъекта,
	|	Производители.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Справочник_Производители
	|ИЗ
	|	Справочник.Производители КАК Производители
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Значение(Перечисление.РеквизитыСопоставленияНоменклатурыБизнесСеть.Марка) КАК РеквизитОбъекта,
	|	Марки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Справочник_Марки
	|ИЗ
	|	Справочник.Марки КАК Марки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРеквизитов.РеквизитОбъекта КАК РеквизитОбъекта,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗначенияСвойствОбъектов.Ссылка) КАК КоличествоЗначенийРеквизита,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеЗначенийРеквизитовБизнесСеть.Значение) КАК КоличествоСопоставленныхРеквизитов
	|ИЗ
	|	ТаблицаРеквизитов КАК ТаблицаРеквизитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|			ПО (ЗначенияСвойствОбъектов.Владелец В (СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта, СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта.ВладелецДополнительныхЗначений))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗначенийРеквизитовБизнесСеть КАК СоответствиеЗначенийРеквизитовБизнесСеть
	|			ПО СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = СоответствиеЗначенийРеквизитовБизнесСеть.РеквизитОбъекта
	|		ПО ТаблицаРеквизитов.РеквизитОбъекта = СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРеквизитов.РеквизитОбъекта
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Справочник_Производители.Ссылка),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеЗначенийРеквизитовБизнесСеть.Значение)
	|ИЗ
	|	РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник_Производители КАК Справочник_Производители
	|		ПО СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = Справочник_Производители.РеквизитОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗначенийРеквизитовБизнесСеть КАК СоответствиеЗначенийРеквизитовБизнесСеть
	|		ПО СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = СоответствиеЗначенийРеквизитовБизнесСеть.РеквизитОбъекта
	|			И СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления = СоответствиеЗначенийРеквизитовБизнесСеть.ОбъектСопоставления
	|ГДЕ
	|	СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления = &ОбъектСопоставления
	|	И СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = Значение(Перечисление.РеквизитыСопоставленияНоменклатурыБизнесСеть.Производитель)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Справочник_Марки.Ссылка),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеЗначенийРеквизитовБизнесСеть.Значение)
	|ИЗ
	|	РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник_Марки КАК Справочник_Марки
	|		ПО СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = Справочник_Марки.РеквизитОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗначенийРеквизитовБизнесСеть КАК СоответствиеЗначенийРеквизитовБизнесСеть
	|		ПО СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = СоответствиеЗначенийРеквизитовБизнесСеть.РеквизитОбъекта
	|			И СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления = СоответствиеЗначенийРеквизитовБизнесСеть.ОбъектСопоставления
	|ГДЕ
	|	СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления = &ОбъектСопоставления
	|	И СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = Значение(Перечисление.РеквизитыСопоставленияНоменклатурыБизнесСеть.Марка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта";
	
	СоответствиеРеквизитов = Новый Соответствие;
	ПолучитьРеквизитыНоменклатурыДоступныеДляПубликации(СоответствиеРеквизитов);
	Для Каждого Реквизит из СоответствиеРеквизитов Цикл
		НоваяСтрока = ДополнительныеРеквизиты.Добавить();
		НоваяСтрока.РеквизитОбъекта = Реквизит.Ключ;
		НоваяСтрока.ТипЗначения     = Реквизит.Значение.ТипЗначения;
		НоваяСтрока.Представление   = Реквизит.Значение.Представление;
	КонецЦикла;
	
	Если ТипЗнч(ОбъектСопоставления) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		ВидНоменклатуры = ОбъектСопоставления;
	ИначеЕсли ТипЗнч(ОбъектСопоставления) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСопоставления, "ВидНоменклатуры");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидНоменклатуры",           ВидНоменклатуры);
	Запрос.УстановитьПараметр("ОбъектСопоставления",       ОбъектСопоставления);
	Запрос.УстановитьПараметр("ДополнительныеРеквизиты",   ДополнительныеРеквизиты);
	Запрос.УстановитьПараметр("ОбщийРеквизитНоменклатура", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	Выборка = ПакетЗапросов[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СопоставленныеРеквизиты.Добавить(), Выборка);
	КонецЦикла;
	
	ВременныйМассив = Новый Массив;
	Выборка = ПакетЗапросов[6].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(РасчетСоответствий.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

// Получение свойств торгового предложения.
//
// Параметры:
//  Источник        - СправочникСсылка - источник торгового соглашения, например СправочникСсылка.Соглашения.
//  ЗначенияСвойств - Структура - возвращаемое значение заполнения.
//
Процедура ПолучитьСвойстваТорговогоПредложения(Знач Источник, ЗначенияСвойств) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЗначенияСвойств,
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Валюта"));
	
КонецПроцедуры

// Получение текста запроса публикуемых товаров.
// 
// В запросе необходимо вернуть данные для публикации товаров.
// См. ТорговыеПредложения.ОписаниеПакетаПредложений таблица Товары.
// Обязательный параметр &ТорговыеПредложения (определяемый тип ТорговыеПредложения).
//
// Параметры:
//   ТекстЗапроса - Строка - формируемый текст запроса.
//   ФормироватьСвойства - Булево - признак добавления подзапроса для получения свойств товаров, штрих-кодов.
//   ИспользоватьПараметры - Булево - признак использования параметров запроса &ТорговоеПредложение, &Период.
//
// Пример:
//   ТорговыеПредложенияПереопределяемый.ТекстЗапросаПубликуемыхТоваров(Ложь) =
//     "ВЫБРАТЬ
//     |  Товары.ВидНоменклатуры,
//     |  Товары.Номенклатура,
//     |  Товары.Характеристика,
//     |  Товары.КатегорияНаименование,
//     |  Товары.Упаковка,
//     |  Товары.СрокаПоставки,
//     |  Товары.Цена
//     |ИЗ Справочник.ПрайсЛист.Товары КАК Товары
//     |  ГДЕ Товары.Ссылка = &ТорговыеПредложения"
//
Процедура ПолучитьТекстЗапросаПубликуемыхТоваров(ТекстЗапроса, ФормироватьСвойства = Ложь, ИспользоватьПараметры = Ложь) Экспорт
	
	ТекстТовары =
	"ВЫБРАТЬ
	|	СоглашенияСКлиентами.Ссылка КАК ТорговоеПредложение,
	|	СоглашенияСКлиентами.Организация КАК Организация,
	|	СоглашенияСКлиентами.СегментНоменклатуры КАК СегментНоменклатуры,
	|	СоглашенияСКлиентами.ВидЦен КАК ВидЦены,
	|	СоглашенияСКлиентами.Валюта КАК Валюта,
	|	СоглашенияСКлиентами.Валюта.Код КАК ВалютаКод,
	|	СоглашенияСКлиентами.СрокПоставки КАК СрокПоставки,
	|	СоглашенияСКлиентами.Склад КАК Склад,
	|	СостоянияСинхронизации.ПубликоватьЦены КАК ПубликоватьЦены,
	|	СостоянияСинхронизации.ПубликоватьСрокиПоставки КАК ПубликоватьСрокиПоставки,
	|	СостоянияСинхронизации.ПубликоватьОстатки КАК ПубликоватьОстатки,
	|	ИспользоватьРубрикаторБизнесСеть.Значение КАК ИспользоватьРубрикаторБизнесСеть
	|ПОМЕСТИТЬ ТорговыеПредложения
	|ИЗ
	|	РегистрСведений.СостоянияСинхронизацииТорговыеПредложения КАК СостоянияСинхронизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ПО СостоянияСинхронизации.ТорговоеПредложение = СоглашенияСКлиентами.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ИспользоватьРубрикаторБизнесСеть КАК ИспользоватьРубрикаторБизнесСеть
	|		ПО (ИСТИНА)
	|ГДЕ
	|	(НЕ СоглашенияСКлиентами.ПометкаУдаления
	|				И СоглашенияСКлиентами.Ссылка = &ТорговоеПредложение
	|			ИЛИ &ТорговоеПредложение = ЗНАЧЕНИЕ(Справочник.СоглашенияСклиентами.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад,
	|	Группы.Ссылка КАК Родитель
	|ПОМЕСТИТЬ ВсеСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Группы
	|		ПО (НЕ Склады.ЭтоГруппа)
	|			И (Склады.Ссылка = Группы.Ссылка
	|				ИЛИ Склады.Родитель = Группы.Ссылка
	|				ИЛИ Склады.Родитель.Родитель = Группы.Ссылка
	|				ИЛИ Склады.Родитель.Родитель.Родитель = Группы.Ссылка
	|				ИЛИ Склады.Родитель.Родитель.Родитель.Родитель = Группы.Ссылка)
	|ГДЕ
	|	НЕ Группы.Ссылка ЕСТЬ NULL
	|	И Склады.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ТорговыеПредложения.Склад
	|			ИЗ
	|				ТорговыеПредложения
	|			ГДЕ
	|				ТорговыеПредложения.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Родитель,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТорговыеПредложения.ТорговоеПредложение КАК ТорговоеПредложение,
	|	ЕСТЬNULL(ВсеСклады.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	|	ЕСТЬNULL(ВсеСклады.Родитель, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Родитель
	|ПОМЕСТИТЬ Склады
	|ИЗ
	|	ТорговыеПредложения КАК ТорговыеПредложения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеСклады КАК ВсеСклады
	|		ПО ТорговыеПредложения.Склад = ВсеСклады.Родитель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТорговоеПредложение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВсеСклады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТорговыеПредложения.ТорговоеПредложение КАК ТорговоеПредложение,
	|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстаткиОстатки.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ОсновнаяВыборка
	|ИЗ
	|	ТорговыеПредложения КАК ТорговыеПредложения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Склады КАК Склады
	|		ПО ТорговыеПредложения.ТорговоеПредложение = Склады.ТорговоеПредложение
	|			И ТорговыеПредложения.Склад = Склады.Родитель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки({(&Период)}, ) КАК СвободныеОстаткиОстатки
	|		ПО (Склады.Склад = СвободныеОстаткиОстатки.Склад
	|				ИЛИ ТорговыеПредложения.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|ГДЕ
	|	ТорговыеПредложения.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТорговыеПредложения.ТорговоеПредложение,
	|	СвободныеОстаткиОстатки.Номенклатура,
	|	СвободныеОстаткиОстатки.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТорговыеПредложения.ТорговоеПредложение,
	|	НоменклатураСегмента.Номенклатура,
	|	НоменклатураСегмента.Характеристика
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТорговыеПредложения КАК ТорговыеПредложения
	|		ПО НоменклатураСегмента.Сегмент = ТорговыеПредложения.СегментНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТорговоеПредложение,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновнаяВыборка.ТорговоеПредложение КАК ТорговоеПредложение,
	|	ОсновнаяВыборка.Номенклатура КАК Номенклатура,
	|	ОсновнаяВыборка.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ЦеновыеГруппы.ВидЦен, ТорговыеПредложения.ВидЦены) КАК ВидЦены,
	|	ЕСТЬNULL(ЦеновыеГруппы.СрокПоставки, ТорговыеПредложения.СрокПоставки) КАК СрокПоставки
	|ПОМЕСТИТЬ ВыборкаСЦеновымиГруппами
	|ИЗ
	|	ОсновнаяВыборка КАК ОсновнаяВыборка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТорговыеПредложения КАК ТорговыеПредложения
	|		ПО ОсновнаяВыборка.ТорговоеПредложение = ТорговыеПредложения.ТорговоеПредложение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК ЦеновыеГруппы
	|		ПО ОсновнаяВыборка.ТорговоеПредложение = ЦеновыеГруппы.Ссылка
	|			И ОсновнаяВыборка.Номенклатура.ЦеноваяГруппа = ЦеновыеГруппы.ЦеноваяГруппа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТорговоеПредложение,
	|	Номенклатура,
	|	Характеристика,
	|	ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОсновнаяВыборка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Уточнение.Ссылка КАК ТорговоеПредложение,
	|	Уточнение.Номенклатура КАК Номенклатура,
	|	Уточнение.Характеристика КАК Характеристика,
	|	Уточнение.Упаковка КАК Упаковка,
	|	Уточнение.ВидЦены КАК ВидЦены,
	|	ТорговыеПредложения.ВидЦены КАК ТорговоеПредложениеВидЦены,
	|	Уточнение.СрокПоставки КАК СрокПоставки,
	|	Уточнение.Цена КАК Цена
	|ПОМЕСТИТЬ ВыборкаУточнения
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.Товары КАК Уточнение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТорговыеПредложения КАК ТорговыеПредложения
	|		ПО Уточнение.Ссылка = ТорговыеПредложения.ТорговоеПредложение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТорговоеПредложение,
	|	Номенклатура,
	|	Характеристика,
	|	Упаковка,
	|	ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВыборкаСЦеновымиГруппами.ТорговоеПредложение, Уточнение.ТорговоеПредложение) КАК ТорговоеПредложение,
	|	ЕСТЬNULL(ВыборкаСЦеновымиГруппами.Номенклатура, Уточнение.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВыборкаСЦеновымиГруппами.Характеристика, Уточнение.Характеристика) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА Уточнение.Упаковка ЕСТЬ NULL
	|			ТОГДА ВыборкаСЦеновымиГруппами.Номенклатура.ЕдиницаИзмерения
	|		КОГДА Уточнение.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА Уточнение.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ Уточнение.Упаковка
	|	КОНЕЦ КАК Упаковка,
	|	ВЫБОР
	|		КОГДА Уточнение.ВидЦены ЕСТЬ NULL
	|			ТОГДА ВыборкаСЦеновымиГруппами.ВидЦены
	|		КОГДА Уточнение.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА Уточнение.ТорговоеПредложениеВидЦены
	|		ИНАЧЕ Уточнение.ВидЦены
	|	КОНЕЦ КАК ВидЦены,
	|	ЕСТЬNULL(Уточнение.СрокПоставки, ВыборкаСЦеновымиГруппами.СрокПоставки) КАК СрокПоставки,
	|	ВЫБОР
	|		КОГДА Уточнение.Цена = 0
	|			ТОГДА NULL
	|		ИНАЧЕ Уточнение.Цена
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ВыборкаСУточнениями
	|ИЗ
	|	ВыборкаСЦеновымиГруппами КАК ВыборкаСЦеновымиГруппами
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВыборкаУточнения КАК Уточнение
	|		ПО (Уточнение.ТорговоеПредложение = ВыборкаСЦеновымиГруппами.ТорговоеПредложение)
	|			И (Уточнение.Номенклатура = ВыборкаСЦеновымиГруппами.Номенклатура)
	|			И (Уточнение.Характеристика = ВыборкаСЦеновымиГруппами.Характеристика)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТорговоеПредложение,
	|	Номенклатура,
	|	Характеристика,
	|	Упаковка,
	|	ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыборкаСЦеновымиГруппами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыборкаУточнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыборкаСУточнениями.ТорговоеПредложение КАК ТорговоеПредложение,
	|	ВыборкаСУточнениями.Номенклатура КАК Номенклатура,
	|	ВыборкаСУточнениями.Характеристика КАК Характеристика,
	|	ВыборкаСУточнениями.Упаковка КАК Упаковка,
	|	ВыборкаСУточнениями.ВидЦены КАК ВидЦены,
	|	ВыборкаСУточнениями.СрокПоставки КАК СрокПоставки,
	|	ЕСТЬNULL(ВыборкаСУточнениями.Цена, ЦеныНоменклатуры.Цена) КАК Цена,
	|	ВЫБОР
	|		КОГДА НЕ ЦеныНоменклатуры.Упаковка ЕСТЬ NULL
	|				И ЦеныНоменклатуры.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВыборкаСЦенами
	|ИЗ
	|	ВыборкаСУточнениями КАК ВыборкаСУточнениями
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних({(&Период)}, ) КАК ЦеныНоменклатуры
	|		ПО ВыборкаСУточнениями.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ВыборкаСУточнениями.Характеристика = ЦеныНоменклатуры.Характеристика
	|			И ВыборкаСУточнениями.ВидЦены = ЦеныНоменклатуры.ВидЦены
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТорговоеПредложение,
	|	Номенклатура,
	|	Характеристика,
	|	Упаковка,
	|	ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыборкаСУточнениями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыборкаСЦенами.ТорговоеПредложение КАК ТорговоеПредложение,
	|	ВыборкаСЦенами.Номенклатура КАК Номенклатура,
	|	ВыборкаСЦенами.Характеристика КАК Характеристика,
	|	ВыборкаСЦенами.Упаковка КАК Упаковка,
	|	ВыборкаСЦенами.ВидЦены КАК ВидЦены,
	|	МАКСИМУМ(ВыборкаСЦенами.Цена) КАК Цена,
	|	МАКСИМУМ(ВыборкаСЦенами.СрокПоставки) КАК СрокПоставки,
	|	СУММА(СвободныеОстатки.ВНаличииОстаток) КАК Количество
	|ПОМЕСТИТЬ ВыборкаСОстатками
	|ИЗ
	|	ВыборкаСЦенами КАК ВыборкаСЦенами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТорговыеПредложения КАК ТорговыеПредложения
	|		ПО ВыборкаСЦенами.ТорговоеПредложение = ТорговыеПредложения.ТорговоеПредложение
	|			И (ВыборкаСЦенами.Цена <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Склады КАК Склады
	|		ПО (ТорговыеПредложения.Склад = Склады.Родитель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(
	|				{(&Период)},
	|				(Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВыборкаСЦенами.Номенклатура,
	|						ВыборкаСЦенами.Характеристика
	|					ИЗ
	|						ВыборкаСЦенами КАК ВыборкаСЦенами)) КАК СвободныеОстатки
	|		ПО ВыборкаСЦенами.Номенклатура = СвободныеОстатки.Номенклатура
	|			И ВыборкаСЦенами.Характеристика = СвободныеОстатки.Характеристика
	|			И (СвободныеОстатки.ВНаличииОстаток > 0)
	|			И (СвободныеОстатки.Склад = Склады.Склад
	|				ИЛИ Склады.Склад = ЗНАЧЕНИЕ(Справочник.Склады.пустаяСсылка))
	|ГДЕ
	|	ВыборкаСЦенами.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяССылка)
	|	И НЕ ВыборкаСЦенами.Упаковка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыборкаСЦенами.ТорговоеПредложение,
	|	ВыборкаСЦенами.Номенклатура,
	|	ВыборкаСЦенами.Характеристика,
	|	ВыборкаСЦенами.Упаковка,
	|	ВыборкаСЦенами.ВидЦены,
	|	ТорговыеПредложения.ПубликоватьОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТорговоеПредложение,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыборкаСЦенами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Склады.ТорговоеПредложение КАК ТорговоеПредложение,
	|	ТоварныеОграничения.Номенклатура КАК Номенклатура,
	|	ТоварныеОграничения.Характеристика КАК Характеристика,
	|	СУММА(ТоварныеОграничения.МаксимальноеКоличествоЗапаса) КАК МаксимальноеКоличествоЗапаса,
	|	СУММА(ТоварныеОграничения.МинимальноеКоличествоЗапаса) КАК МинимальноеКоличествоЗапаса
	|ПОМЕСТИТЬ ТоварныеОграничения
	|ИЗ
	|	РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыборкаСОстатками КАК ВыборкаСОстатками
	|		ПО (ВыборкаСОстатками.Номенклатура = ТоварныеОграничения.Номенклатура)
	|			И (ВыборкаСОстатками.Характеристика = ТоварныеОграничения.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Склады КАК Склады
	|		ПО (ТоварныеОграничения.Склад = Склады.Склад
	|				ИЛИ Склады.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварныеОграничения.Номенклатура,
	|	ТоварныеОграничения.Характеристика,
	|	Склады.ТорговоеПредложение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Склады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыборкаСОстатками.ТорговоеПредложение КАК ТорговоеПредложение,
	|	ТорговыеПредложения.Организация КАК Организация,
	|	ВыборкаСОстатками.Номенклатура КАК Номенклатура,
	|	ВыборкаСОстатками.Номенклатура.Наименование КАК Наименование,
	|	ВыборкаСОстатками.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ВыборкаСОстатками.Характеристика.Наименование, """") КАК ХарактеристикаНаименование,
	|	ВЫБОР
	|		КОГДА НЕ ВыборкаСОстатками.Упаковка.Владелец В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения), ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры))
	|			ТОГДА ВыборкаСОстатками.Упаковка.Владелец.ЕдиницаИзмерения
	|		ИНАЧЕ ВыборкаСОстатками.Упаковка
	|	КОНЕЦ КАК БазоваяЕдиницаИзмерения,
	|	ВыборкаСОстатками.Номенклатура.Артикул КАК Артикул,
	|	ВыборкаСОстатками.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ВыборкаСОстатками.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА НЕ ВыборкаСОстатками.Упаковка.Владелец В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения), ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры))
	|			ТОГДА ВыборкаСОстатками.Упаковка.Владелец.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ВыборкаСОстатками.Упаковка.Код
	|	КОНЕЦ КАК УпаковкаКод,
	|	ВыборкаСОстатками.Упаковка.Наименование КАК УпаковкаНаименование,
	|	ВЫБОР
	|		КОГДА ВыборкаСОстатками.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВыборкаСОстатками.Упаковка.Числитель
	|	КОНЕЦ КАК УпаковкаЧислитель,
	|	ВЫБОР
	|		КОГДА ВыборкаСОстатками.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВыборкаСОстатками.Упаковка.Знаменатель
	|	КОНЕЦ КАК УпаковкаЗнаменатель,
	|	ВыборкаСОстатками.ВидЦены КАК ВидЦены,
	|	ТорговыеПредложения.Валюта КАК Валюта,
	|	ТорговыеПредложения.ВалютаКод КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА ТорговыеПредложения.ПубликоватьЦены
	|			ТОГДА ЕСТЬNULL(ВыборкаСОстатками.Цена, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТорговыеПредложения.ПубликоватьСрокиПоставки
	|			ТОГДА ЕСТЬNULL(ВыборкаСОстатками.СрокПоставки, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СрокПоставки,
	|	ВЫБОР
	|		КОГДА ТорговыеПредложения.ПубликоватьОстатки
	|			ТОГДА ВЫБОР
	|					КОГДА ВыборкаСОстатками.Количество <= 0
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВыборкаСОстатками.Количество <= ТоварныеОграничения.МинимальноеКоличествоЗапаса
	|								ТОГДА 1
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВыборкаСОстатками.Количество < ТоварныеОграничения.МаксимальноеКоличествоЗапаса
	|										ТОГДА 2
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВыборкаСОстатками.Количество >= ТоварныеОграничения.МаксимальноеКоличествоЗапаса
	|												ТОГДА 3
	|											ИНАЧЕ НЕОПРЕДЕЛЕНО
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Остаток,
	|	ВЫБОР
	|		КОГДА ТорговыеПредложения.ПубликоватьОстатки
	|			ТОГДА ЕСТЬNULL(ВыборкаСОстатками.Количество, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТорговыеПредложения.ИспользоватьРубрикаторБизнесСеть
	|			ТОГДА ЕСТЬNULL(СоответствиеПоНоменклатуре.ОбъектСопоставления, ЕСТЬNULL(СоответствиеПоВидам.ОбъектСопоставления, ЕСТЬNULL(СоответствиеПоИерархии.ОбъектСопоставления, ВыборкаСОстатками.Номенклатура.ВидНоменклатуры)))
	|	КОНЕЦ КАК ОбъектСопоставления,
	|	ВЫБОР
	|		КОГДА ТорговыеПредложения.ИспользоватьРубрикаторБизнесСеть
	|			ТОГДА ЕСТЬNULL(СоответствиеПоНоменклатуре.ИдентификаторКатегории, ЕСТЬNULL(СоответствиеПоВидам.ИдентификаторКатегории, СоответствиеПоИерархии.ИдентификаторКатегории))
	|	КОНЕЦ КАК ИдентификаторКатегории,
	|	ВЫБОР
	|		КОГДА ТорговыеПредложения.ИспользоватьРубрикаторБизнесСеть
	|			ТОГДА ЕСТЬNULL(СоответствиеПоНоменклатуре.ПредставлениеКатегории, ЕСТЬNULL(СоответствиеПоВидам.ПредставлениеКатегории, СоответствиеПоИерархии.ПредставлениеКатегории))
	|	КОНЕЦ КАК КатегорияНаименование
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	ВыборкаСОстатками КАК ВыборкаСОстатками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТорговыеПредложения КАК ТорговыеПредложения
	|		ПО ВыборкаСОстатками.ТорговоеПредложение = ТорговыеПредложения.ТорговоеПредложение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыБизнесСеть КАК СоответствиеПоНоменклатуре
	|		ПО (ТорговыеПредложения.ИспользоватьРубрикаторБизнесСеть)
	|			И ВыборкаСОстатками.Номенклатура = СоответствиеПоНоменклатуре.ОбъектСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыБизнесСеть КАК СоответствиеПоВидам
	|		ПО (ТорговыеПредложения.ИспользоватьРубрикаторБизнесСеть)
	|			И ВыборкаСОстатками.Номенклатура.ВидНоменклатуры = СоответствиеПоВидам.ОбъектСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыБизнесСеть КАК СоответствиеПоИерархии
	|		ПО (ТорговыеПредложения.ИспользоватьРубрикаторБизнесСеть)
	|			И ВыборкаСОстатками.Номенклатура.Родитель = СоответствиеПоИерархии.ОбъектСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварныеОграничения КАК ТоварныеОграничения
	|		ПО ВыборкаСОстатками.Номенклатура = ТоварныеОграничения.Номенклатура
	|			И ВыборкаСОстатками.Характеристика = ТоварныеОграничения.Характеристика
	|			И ВыборкаСОстатками.ТорговоеПредложение = ТоварныеОграничения.ТорговоеПредложение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	БазоваяЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыборкаСОстатками
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТорговыеПредложения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.ТорговоеПредложение КАК ТорговоеПредложение,
	|	Товары.Организация КАК Организация,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Наименование КАК Наименование,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
	|	Товары.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
	|	Товары.Артикул КАК Артикул,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.УпаковкаКод КАК УпаковкаКод,
	|	Товары.УпаковкаНаименование КАК УпаковкаНаименование,
	|	Товары.УпаковкаЧислитель КАК УпаковкаЧислитель,
	|	Товары.УпаковкаЗнаменатель КАК УпаковкаЗнаменатель,
	|	Товары.ВидЦены КАК ВидЦены,
	|	Товары.Валюта КАК Валюта,
	|	Товары.ВалютаКод КАК ВалютаКод,
	|	Товары.Цена КАК Цена,
	|	Товары.СрокПоставки КАК СрокПоставки,
	|	Товары.Остаток КАК Остаток,
	|	Товары.Количество КАК Количество,
	|	Товары.ОбъектСопоставления КАК ОбъектСопоставления,
	|	Товары.ИдентификаторКатегории КАК ИдентификаторКатегории,
	|	Товары.КатегорияНаименование КАК КатегорияНаименование
	|ИЗ
	|	Товары КАК Товары";
	
	// Удаление параметров в запросе, замена на условие ИСТИНА.
	Если Не ИспользоватьПараметры Тогда
		ТекстЗамены = "
		|				И СоглашенияСКлиентами.Ссылка = &ТорговоеПредложение
		|			ИЛИ &ТорговоеПредложение = ЗНАЧЕНИЕ(Справочник.СоглашенияСклиентами.ПустаяСсылка)";
		ТекстТовары = СтрЗаменить(ТекстТовары, ТекстЗамены, "");
	КонецЕсли;
	
	ТекстСвойства =
	"ВЫБРАТЬ
	|	Товары.ОбъектСопоставления КАК ОбъектСопоставления,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	СоответствиеРеквизитовБизнесСеть.ПредставлениеРеквизитаКатегории КАК Наименование,
	|	СоответствиеРеквизитовБизнесСеть.ИдентификаторРеквизитаКатегории КАК ИдентификаторРеквизитаКатегории,
	|	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ Свойства
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Товары КАК Товары
	|		ПО (Товары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|		ПО (Товары.ОбъектСопоставления = СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления)
	|			И НоменклатураДополнительныеРеквизиты.Свойство = СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.ОбъектСопоставления,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	СоответствиеРеквизитовБизнесСеть.ПредставлениеРеквизитаКатегории,
	|	СоответствиеРеквизитовБизнесСеть.ИдентификаторРеквизитаКатегории,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ПО Товары.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|		ПО Товары.ОбъектСопоставления = СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления
	|			И (ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.ОбъектСопоставления,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	СоответствиеРеквизитовБизнесСеть.ПредставлениеРеквизитаКатегории,
	|	СоответствиеРеквизитовБизнесСеть.ИдентификаторРеквизитаКатегории,
	|	""&Свойство"",
	|	&Значение
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|		ПО Товары.ОбъектСопоставления = СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления
	|			И (СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = ""&Свойство"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свойства.Номенклатура КАК Номенклатура,
	|	Свойства.Характеристика КАК Характеристика,
	|	Свойства.Наименование КАК Наименование,
	|	Свойства.ИдентификаторРеквизитаКатегории КАК ИдентификаторРеквизитаКатегории,
	|	Свойства.Значение КАК Значение,
	|	СоответствиеЗначенийРеквизитовБизнесСеть.ИдентификаторЗначенияРеквизитаКатегории КАК ИдентификаторЗначения
	|ИЗ
	|	Свойства КАК Свойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗначенийРеквизитовБизнесСеть КАК СоответствиеЗначенийРеквизитовБизнесСеть
	|		ПО Свойства.ОбъектСопоставления = СоответствиеЗначенийРеквизитовБизнесСеть.ОбъектСопоставления
	|			И Свойства.Свойство = СоответствиеЗначенийРеквизитовБизнесСеть.РеквизитОбъекта
	|			И Свойства.Значение = СоответствиеЗначенийРеквизитовБизнесСеть.Значение";
	
	
	ТекстШтрихКоды =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
	|	ЕСТЬNULL(Штрихкоды.Штрихкод, """") КАК Значение
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО Товары.Номенклатура = Штрихкоды.Номенклатура
	|			И Товары.Характеристика = Штрихкоды.Характеристика
	|			И (Товары.БазоваяЕдиницаИзмерения = ВЫБОР
	|				КОГДА НЕ Штрихкоды.Упаковка.Владелец В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения), ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры))
	|					ТОГДА Штрихкоды.Упаковка.Владелец.ЕдиницаИзмерения
	|				КОГДА Штрихкоды.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					ТОГДА ВЫБОР
	|							КОГДА НЕ Штрихкоды.Номенклатура.ЕдиницаИзмерения.Владелец В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения), ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры))
	|								ТОГДА Штрихкоды.Номенклатура.ЕдиницаИзмерения.Владелец.ЕдиницаИзмерения
	|							ИНАЧЕ Товары.БазоваяЕдиницаИзмерения
	|						КОНЕЦ
	|				ИНАЧЕ Штрихкоды.Упаковка
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.БазоваяЕдиницаИзмерения,
	|	ЕСТЬNULL(Штрихкоды.Штрихкод, """")";
		
	
	ТекстЗапроса = ТекстТовары;
	Если ФормироватьСвойства Тогда
		Разделитель = "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

		ТекстЗапроса = ТекстЗапроса + Разделитель
			+ ТекстСвойства + Разделитель + ТекстШтрихКоды;
	Иначе
		
		МассивЗапросов = СтрРазделить(ТекстЗапроса, ";");
		
		// Удаление последних трех запросов в пакете.
		МассивЗапросов.Удалить(МассивЗапросов.Количество() - 1);
		МассивЗапросов.Удалить(МассивЗапросов.Количество() - 1);
		МассивЗапросов.Удалить(МассивЗапросов.Количество() - 1);
		
		// Удаление использования временной таблицы ВыборкаНоменклатуры.
		ТекстЗапроса = СтрСоединить(МассивЗапросов, ";");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ Товары", "");
		
		// Удаление индекса.
		ТекстИндекса = 
		"ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	БазоваяЕдиницаИзмерения";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстИндекса, "");
		СтрНайти(ТекстЗапроса, ТекстИндекса);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполнение адресов абонента по зарегистрированным организациям и складам.
//
// Параметры:
//  АдресаАбонента - ТаблицаЗначения - таблица для заполнения, см. ТорговыеПредложения.ОписаниеАдресовАбонента().
//
Процедура ЗаполнитьАдресаАбонента(АдресаАбонента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	ОрганизацииКонтактнаяИнформация.Вид КАК Вид,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО (ОрганизацииКонтактнаяИнформация.Ссылка = ОрганизацииБизнесСеть.Организация)
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СкладыКонтактнаяИнформация.Представление,
	|	СкладыКонтактнаяИнформация.ЗначенияПолей,
	|	СкладыКонтактнаяИнформация.Вид,
	|	СкладыКонтактнаяИнформация.Ссылка
	|ИЗ
	|	Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
	|ГДЕ
	|	СкладыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.Представление) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаАдреса = АдресаАбонента.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаАдреса, Выборка);
		СтрокаАдреса.Описание = СтрШаблон("%1 (%2)", Выборка.Вид, Выборка.Ссылка);
	КонецЦикла;
	
	АдресаАбонента.Сортировать("Представление");	
	
КонецПроцедуры

// Получение способов доставки для заполнения по умолчанию значений при формировании заказов.
//
// Параметры:
//  СпособыДоставки - СписокЗначений - возможные значения способа доставки.
//                                     Первое значение является значением по умолчанию.
//  ВидДоставки	- Строка - значение вида доставки, варианты "Самовывоз", "Доставка".
//
Процедура ПолучитьСпособыДоставки(СпособыДоставки, ВидДоставки = Неопределено) Экспорт
	
	Если ВРег(ВидДоставки) = "САМОВЫВОЗ" Тогда
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
	ИначеЕсли ВРег(ВидДоставки) = "ДОСТАВКА" Тогда
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада);
	Иначе
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада);
	КонецЕсли;
	
КонецПроцедуры

// Получение имени ставки НДС.
//
// Параметры:
//  Ссылка		 - СправочникСсылка, ПеречислениеСсылка - ссылка на значение ставки НДС прикладного решения.
//  ИмяСтавкиНДС - Строка - идентификатор ставки НДС.
//
Процедура ПолучитьИмяСтавкиНДС(Знач Ссылка, ИмяСтавкиНДС) Экспорт
	
	ОбъектМетаданных = Ссылка.Метаданные();
	ИндексЗначения = Перечисления.СтавкиНДС.Индекс(Ссылка);
	Если ИндексЗначения <> -1 Тогда
		ИмяСтавкиНДС = ОбъектМетаданных.ЗначенияПеречисления[ИндексЗначения].Имя;
	Иначе
		ИмяСтавкиНДС = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Получение значения ставки НДС по идентификатору.
//
// Параметры:
//  ИмяСтавкиНДС - Строка - идентификатор ставки НДС.
//  Ссылка		 - СправочникСсылка, ПеречислениеСсылка - ссылка на значение ставки НДС прикладного решения.
//
Процедура ПолучитьЗначениеСтавкиНДС(Знач ИмяСтавкиНДС, Ссылка) Экспорт
	
	Если Не ПустаяСтрока(ИмяСтавкиНДС)
		И Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления.Найти(ИмяСтавкиНДС) <> Неопределено Тогда
		Ссылка = Перечисления.СтавкиНДС[ИмяСтавкиНДС];
	Иначе
		Ссылка = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
	
КонецПроцедуры

// Инициализация динамического списка сопоставления номенклатуры в форме сопоставления номенклатуры.
// Заполняется переопределяемый текст запроса и свойства списка.
// См. форму обработки ТорговыеПредложения.СопоставлениеНоменклатуры.
//
// Параметры:
//  Список - ЭлементФормы - элемент динамического списка в форме.
//
Процедура ИнициализацияСпискаСопоставленияПоИерархии(Список) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Наименование КАК Наименование,
	|	СоответствиеКатегорий.ПредставлениеКатегории КАК Категория,
	|	СоответствиеКатегорий.ИдентификаторКатегории КАК ИдентификаторКатегории
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыБизнесСеть КАК СоответствиеКатегорий
	|		ПО Номенклатура.Ссылка = СоответствиеКатегорий.ОбъектСопоставления
	|ГДЕ
	|	Номенклатура.ЭтоГруппа";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "Справочник.Номенклатура";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Список, СвойстваСписка);
	
КонецПроцедуры

// Инициализация динамического списка сопоставления номенклатуры в форме сопоставления номенклатуры.
// Заполняется переопределяемый текст запроса и свойства списка.
// См. форму обработки ТорговыеПредложения.СопоставлениеНоменклатуры.
//
// Параметры:
//  Список - ЭлементФормы - элемент динамического списка в форме.
//
Процедура ИнициализацияСпискаСопоставленияПоНоменклатуре(Список) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СоответствиеПоНоменклатуре.ПредставлениеКатегории, ЕСТЬNULL(СоответствиеПоВидам.ПредставлениеКатегории, СоответствиеПоИерархии.ПредставлениеКатегории)) КАК Категория,
	|	ЕСТЬNULL(СоответствиеПоНоменклатуре.ИдентификаторКатегории, ЕСТЬNULL(СоответствиеПоВидам.ИдентификаторКатегории, СоответствиеПоИерархии.ИдентификаторКатегории)) КАК ИдентификаторКатегории,
	|	СоответствиеПоНоменклатуре.ПредставлениеКатегории КАК КатегорияПоНоменклатуре,
	|	СоответствиеПоНоменклатуре.ИдентификаторКатегории КАК ИдентификаторКатегорииПоНоменклатуре,
	|	СоответствиеПоВидам.ПредставлениеКатегории КАК КатегорияПоВидам,
	|	СоответствиеПоВидам.ИдентификаторКатегории КАК ИдентификаторКатегорииПоВидам,
	|	СоответствиеПоИерархии.ПредставлениеКатегории КАК КатегорияПоИерархии,
	|	СоответствиеПоИерархии.ИдентификаторКатегории КАК ИдентификаторКатегорииПоИерархии,
	|	Номенклатура.Родитель КАК Родитель,
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыБизнесСеть КАК СоответствиеПоНоменклатуре
	|		ПО Номенклатура.Ссылка = СоответствиеПоНоменклатуре.ОбъектСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыБизнесСеть КАК СоответствиеПоИерархии
	|		ПО Номенклатура.Родитель = СоответствиеПоИерархии.ОбъектСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыБизнесСеть КАК СоответствиеПоВидам
	|		ПО Номенклатура.ВидНоменклатуры = СоответствиеПоВидам.ОбъектСопоставления";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица              = "Справочник.Номенклатура";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса                 = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Список, СвойстваСписка);	
	
КонецПроцедуры

// Получение доступности функционала запроса цен в прикладном решении.
//
// Параметры:
//  Результат - Булево - признак доступности функционала запроса цен.
//
Процедура ПолучитьДоступностьФункционалаЗапросаЦен(Результат) Экспорт
	
	// Запрос цен не используется.
	Результат = Ложь;
	
КонецПроцедуры

// Заполнение штрихкодов для выгрузки.
//
// Параметры:
//  Организации	 - Массив - список организация, для которых производится выгрузка.
//  РежимПоставщика - Булево - выгружать только данные по продажам.
//  РежимПокупателя - Булево - выгружать только данные по покупкам.
//  Штрихкоды	 - ТаблицаЗначений - данные по штрихкодам, 
//                 см. ТорговыеПредложения.ОбновитьПодсказкиТорговыеПредложения:
//    * Организация - СправочникСсылка - ссылка на организацию.
//    * Штрихкод - Строка - штрихкод товара.
//    * Наименование - Строка - наименование товара.
//    * РежимПоставщика - Булево - признак использования штрихкода в продажах.
//    * РежимПокупателя - Булево - признак использования штрихкода в закупках.
//
Процедура ЗаполнитьШтрихкодыДляВыгрузки(Знач Организации, Знач РежимПоставщика, Знач РежимПокупателя, Штрихкоды) Экспорт
	
	ВзаиморасчетыСервер.ЗаполнитьШтрихкодыДляВыгрузки(Организации, РежимПоставщика, РежимПокупателя, Штрихкоды)
	
КонецПроцедуры

// Добавление служебных колонок в таблицу товары.
//
// Параметры:
//  Ссылка - ДокументСсылка - ссылка на документ с товарами.
//  ПолучатьШтрихКоды - Булево - признак необходимости заполнения штрихкодов номенклатуры.
//                               Для значения Ложь, штрихкоды не заполняются.
//  Товары - ТаблицаЗначений - таблица с товарами, см. ТорговыеПредложения.ОписаниеТаблицыТоваровДляПоиска().
//
Процедура ПолучитьТоварыДляПодсказокПоСсылке(Знач Ссылка, Знач ПолучатьШтрихКоды, Товары) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
		|	ЗаказПоставщикуТовары.Количество КАК Количество
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Товары.Добавить(), Выборка);
		КонецЦикла;
		ДобавитьСлужебныеКолонкиТовары(Товары, ПолучатьШтрихКоды);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика, 
		|	Номенклатура.ЕдиницаИзмерения КАК Упаковка,
		|	1 КАК Количество
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Товары.Добавить(), Выборка);
		КонецЦикла;
		ДобавитьСлужебныеКолонкиТовары(Товары, ПолучатьШтрихКоды);
		
	КонецЕсли;
	
КонецПроцедуры

// Выгружать относительные остатки товаров.
// Определяет возможность выгрузки в конфигурации торговых предложений
// с указанием остатков номенклатуры в значениях "мало-много".
//
// Параметры:
//  Результат - Булево - признак наличия функционала.
//
Процедура ВыгружатьОтносительныеОстаткиТоваров(Результат) Экспорт
	
	Результат = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Обработка переопределяемого метода с возвратом результата.
// Необходимо перенести логику клиент-серверного взаимодействия в модули прикладного решения.
//
// Параметры:
//  ИмяМетода				 - Строка - имя переопределяемого метода.
//  ДополнительныеПараметры	 - Структура - передаваемые параметры.
//  Результат				 - Произвольный - возвращаемое значение исполняемого метода.
// 
Процедура УдалитьОбработатьПереопределяемыйМетод(ИмяМетода, ДополнительныеПараметры, Результат) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейсУП

// Добавление команды поиска торговых предложений в формах.
//
// Параметры:
//  КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании.
//
Процедура ДобавитьКомандуПоискаТорговыхПредложений(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Обработки.ТорговыеПредложения) Тогда
		КомандаСоздатьНаОсновании =  КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "ТорговыеПредложенияКлиентПереопределяемый.ОткрытьПоискТоваровПоСписку";
		КомандаСоздатьНаОсновании.Идентификатор = "ПоискТоваровПоСписку";
		КомандаСоздатьНаОсновании.Представление = НСтр("ru = 'Заказы поставщикам в 1С:Бизнес-сеть'");
		КомандаСоздатьНаОсновании.РежимЗаписи = "";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьОбменБизнесСеть";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получение признака записи ведомого регистра сведений.
//
// Параметры:
//  Ссылка	 - Произвольный - ссылка на объект информационной базы.
//  Регистры - Массив - список регистров сведений.
// 
// Возвращаемое значение:
//  Булево - признак записи ведомого регистра.
//
Функция ЭтоЗаписьВедомогоРегистраСведений(Ссылка, Регистры)
	
	Для Каждого Элемент Из Регистры Цикл
		Если ТипЗнч(Ссылка) = Тип("РегистрСведенийКлючЗаписи." + Элемент.Имя) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Получение дополнительных ссылок назначения заказов.
//
// Параметры:
//  УдалямыеСсылки	 - Массив - ссылки документов Заказ поставщику для удаления.
// 
// Возвращаемое значение:
//  СписокЗначений - дополнительные ссылки для удаления, тип СправочникСсылка.Назначения.
//
Функция НазначенияЗаказов(УдалямыеСсылки)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Назначения КАК Таблица
	|ГДЕ
	|	Таблица.Заказ В(&УдалямыеСсылки)";
	Запрос.УстановитьПараметр("УдалямыеСсылки", УдалямыеСсылки);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Получение примитивного значения по параметру.
//
// Параметры:
//  Значение - Произвольный - значение для преобразование.
// 
// Возвращаемое значение:
//  Произвольный - значение примитивного типа (Число, Строка, Булево).
//
Функция ПримитивноеЗначение(Знач Значение)
	
	Если ТипЗнч(Значение) <> Тип("Число")
		И ТипЗнч(Значение) <> Тип("Строка")
		И ТипЗнч(Значение) <> Тип("Булево") Тогда
		Значение = Строка(Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Получение соответствия для определения функциональных опция по имени объектов.
// 
// Возвращаемое значение:
//  Соответствие - значение зависимостей, где Ключ - имя формы, Значение - функциональная опция.
//
Функция ЗависимостьФункционалаОтФункциональныхОпций()
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("Обработка.ТорговыеПредложения.Форма.СопоставлениеНоменклатуры",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ИспользоватьНесколькоВидовНоменклатуры"));
	Зависимость.Вставить("Обработка.ТорговыеПредложения.Форма.ФормаСписка",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ИспользоватьСоглашенияСКлиентами"));
		
	Возврат Зависимость;
	
КонецФункции

// Заполнение сегмента контрагентов торгового предложения
//
// Параметры:
//  Соглашение			 - СправочникСсылка - ссылка справочника соглашения с контрагентами.
//  СегментКонтрагентов	 - Массив - контрагенты для органичения доступа к торговым предложениям.
//
Процедура ЗаполнитьКонтрагентовПакетаПредложений(ТорговоеПредложение, СписокКонтрагентов)

	Реквизиты = "СегментПартнеров, Контрагент, Партнер, Типовое";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТорговоеПредложение, Реквизиты);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Типовое",          ЗначенияРеквизитов.Типовое);
	Запрос.УстановитьПараметр("Контрагент",       ЗначенияРеквизитов.Контрагент);
	Запрос.УстановитьПараметр("Партнер",          ЗначенияРеквизитов.Партнер);
	Запрос.УстановитьПараметр("СегментПартнеров", ЗначенияРеквизитов.СегментПартнеров);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.ИНН    КАК ИНН,
	|	Контрагенты.КПП    КАК КПП,
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ПартнерыСегмента.Партнер = Контрагенты.Партнер
	|ГДЕ
	|	ПартнерыСегмента.Сегмент = &СегментПартнеров
	|	И НЕ Контрагенты.ИНН = """"
	|	И &Типовое = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ИНН = """"
	|	И &Типовое = ЛОЖЬ
	|	И Контрагенты.Партнер = &Партнер
	|	И &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ИНН = """"
	|	И &Типовое = ЛОЖЬ
	|	И Контрагенты.Ссылка = &Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.Ссылка";
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаКонтрагентов = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТаблицаКонтрагентов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВидыКонтактнойИнформации = Новый Массив;
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
	
	Для Каждого СтрокаКонтрагентов из ТаблицаКонтрагентов Цикл
		
		НоваяСтрока = СписокКонтрагентов.Добавить();
		НоваяСтрока.ИНН = СтрокаКонтрагентов.ИНН;
		НоваяСтрока.КПП = СтрокаКонтрагентов.КПП;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполнение таблицы товары пакета предложений.
//
// Параметры:
//  ПакетПредложений	 - Структура - формируемый для публикации пакет торговых предложений.
//  ТорговоеПредложение	 - СправочникСсылка.СоглашенияСКлиентами - ссылка на справочник определяющий торговые предложения.
//
Процедура ЗаполнитьТоварыПакетаПредложений(ПакетПредложений, ТорговоеПредложение)
	
	Запрос = Новый Запрос;
	
	ПолучитьТекстЗапросаПубликуемыхТоваров(Запрос.Текст, Истина, Истина);
	Запрос.УстановитьПараметр("ТорговоеПредложение", ТорговоеПредложение);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	// Дополнение в запрос источников по дополнительным реквизитам номенклатуры.
	ДополнитьЗапросПолучениемРеквизитовНоменклатуры(Запрос);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатаЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатаЗапроса[РезультатаЗапроса.Количество() - 4].Выбрать();
	ШтрихКоды = РезультатаЗапроса[РезультатаЗапроса.Количество() - 1].Выбрать();
	
	АтрибутыТоваров = РезультатаЗапроса[РезультатаЗапроса.Количество() - 2].Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТовары = ПакетПредложений.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, Выборка);
		
		// Формирование атрибутов.
		СтрокиАтрибутов = АтрибутыТоваров.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", 
			Выборка.Номенклатура, Выборка.Характеристика));
		ТаблицаАтрибутов = ПакетПредложений.Атрибуты.Скопировать();
		ТаблицаАтрибутов.Очистить();
		Для Каждого СтрокаАтрибутов Из СтрокиАтрибутов Цикл
			НоваяСтрокаАтрибутов = ТаблицаАтрибутов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаАтрибутов, СтрокаАтрибутов);
			НоваяСтрокаАтрибутов.Значение = Строка(НоваяСтрокаАтрибутов.Значение);
		КонецЦикла;
		СтрокаТовары.Атрибуты = ТаблицаАтрибутов;
		// Конец Формирование атрибутов.
		
		// Формирование штрихкодов.
		ТаблицаШтрихкодов = ПакетПредложений.Штрихкоды.Скопировать();
		ТаблицаШтрихкодов.Очистить();
		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, БазоваяЕдиницаИзмерения",
			Выборка.Номенклатура, Выборка.Характеристика, Выборка.БазоваяЕдиницаИзмерения);
		Пока ШтрихКоды.НайтиСледующий(СтруктураПоиска) Цикл
			НоваяСтрокаШтрихкодов = ТаблицаШтрихкодов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаШтрихкодов, ШтрихКоды);
			НоваяСтрокаШтрихкодов.ЕдиницаИзмерения = ШтрихКоды.БазоваяЕдиницаИзмерения;
		КонецЦикла;
		СтрокаТовары.Штрихкоды = ТаблицаШтрихкодов;
		// Конец Формирование штрихкодов.
		
	КонецЦикла;
	
КонецПроцедуры

// Дополнение в запрос источников по дополнительным реквизитам номенклатуры.
//
// Параметры:
//   Запрос - Запрос - основной запрос сбора данных.
//
Процедура ДополнитьЗапросПолучениемРеквизитовНоменклатуры(Запрос)
	
	БлокРеквизитовШаблон = "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.ОбъектСопоставления,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	СоответствиеРеквизитовБизнесСеть.ПредставлениеРеквизитаКатегории,
	|	СоответствиеРеквизитовБизнесСеть.ИдентификаторРеквизитаКатегории,
	|	""&Свойство"",
	|	&Значение
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеРеквизитовБизнесСеть КАК СоответствиеРеквизитовБизнесСеть
	|		ПО Товары.ОбъектСопоставления = СоответствиеРеквизитовБизнесСеть.ОбъектСопоставления
	|			И (СоответствиеРеквизитовБизнесСеть.РеквизитОбъекта = ""&Свойство"")
	|";
	
	ДоступныеДляПубликацииРеквизиты = Новый Соответствие;
	ПолучитьРеквизитыНоменклатурыДоступныеДляПубликации(ДоступныеДляПубликацииРеквизиты);
	
	МассивПодзапросов = Новый Массив;
	СчетчикРеквизитов = 0;
	Для Каждого СвойстваРеквизита из ДоступныеДляПубликацииРеквизиты Цикл
		
		СчетчикРеквизитов = СчетчикРеквизитов + 1;
		ТекстПодзапроса = БлокРеквизитовШаблон;
		
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, """&Свойство""",
			"Значение(Перечисление.РеквизитыСопоставленияНоменклатурыБизнесСеть." + СвойстваРеквизита.Ключ + ")");
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "&Значение", СвойстваРеквизита.Значение.ПутьКДанным);
		
		Если СвойстваРеквизита.Значение.Свойство("ПустоеЗначение") Тогда
			ТекстПодзапроса = ТекстПодзапроса + Символы.ПС
				+ "ГДЕ НЕ "+ СвойстваРеквизита.Значение.ПутьКДанным + " = &ПустоеЗначение" + XMLСтрока(СчетчикРеквизитов);
			Запрос.УстановитьПараметр("ПустоеЗначение" + XMLСтрока(СчетчикРеквизитов),
				СвойстваРеквизита.Значение.ПустоеЗначение);
		КонецЕсли;
		
		МассивПодзапросов.Добавить(ТекстПодзапроса);
		
	КонецЦикла;
	
	БлокРеквизитовПодстановка = СтрСоединить(МассивПодзапросов, Символы.ПС);
	
	// Если реквизиты не найдены, то возврат.
	Если ПустаяСтрока(БлокРеквизитовПодстановка) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрЧислоВхождений(Запрос.Текст, БлокРеквизитовШаблон) = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка компоновки запроса получения данных номенклатуры.'");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, БлокРеквизитовШаблон, БлокРеквизитовПодстановка);
	
КонецПроцедуры

// Установка доступность команд буфера обмена в форме.
//
// Параметры:
//  Форма	 - УправляемаяФорма - форма установки доступности команд.
//
Процедура УстановитьДоступностьКомандБуфераОбмена(Форма)
	
	// Наименование элементов формы.
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ТоварыВставитьСтроки");
	МассивЭлементов.Добавить("ТоварыКонтекстноеМенюВставитьСтроки");
	
	ПустойБуферОбмена = ОбщегоНазначения.ПустойБуферОбмена("Строки");
	
	УстановитьСвойствоЭлементовФормы(Форма.Элементы, МассивЭлементов, "Доступность",
		НЕ ПустойБуферОбмена);
		
КонецПроцедуры

#КонецОбласти
