
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Основание = Новый Структура("МассивВедомостей", ПараметрКоманды);
	
	// УПК
	Если Тип("УправляемаяФорма") = ТипЗнч(ПараметрыВыполненияКоманды.Источник) Тогда
		Если СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы, "ВедомостьНаПеречислениеВзносовОтчислений") = 0 Тогда
			Основание.Вставить("ЭтоВедомостьНаПеречислениеВзносовОтчислений", Ложь);
		Иначе
			Основание.Вставить("ЭтоВедомостьНаПеречислениеВзносовОтчислений", Истина);
		КонецЕсли;
	Иначе
		Основание.Вставить("ЭтоВедомостьНаПеречислениеВзносовОтчислений", Ложь);
	КонецЕсли;
	// УПК
	
	ПараметрыФормы = Новый Структура("Основание", Основание);
	ОткрытьФорму("Документ.ЗаявкаНаРасходованиеДенежныхСредств.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

