
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьДанныеРасшифровкиОтчета(
		АдресДанных,
		Идентификатор,
		СтандартнаяОбработка) Экспорт
	
	ДанныеРасшифровки   = ПолучитьИзВременногоХранилища(АдресДанных);
	
	ЗначениеРасшифровки = ДанныеРасшифровки.Элементы[Идентификатор];
	ПоляРасшифровки     = ЗначениеРасшифровки.ПолучитьПоля();
	
	Для Каждого ПолеРасшифровки Из ПоляРасшифровки Цикл
		Если ПолеРасшифровки.Поле = "ПараметрыДанных.НадписьНаПортале" Тогда
			СтандартнаяОбработка = Ложь;
			Возврат ПолеРасшифровки.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли