Перем SessionId;


Перем НТТР_клиент;
Перем ИмяФайлаВходящее;
Перем ИмяФайлаИсходящее;
Перем МаксКолНомеровЗаРаз Экспорт;
//Перем КоличествоСообщений;


Функция ОтправитьСМССообщениеПоНомеру(Телефон, Сообщение,Дост = Неопределено) Экспорт
	//1.Сервер
	//2.Логин
	//3.Пароль
	//4.НомерТелефона	
	//5.Отправитель
	//6.Смс Флеш - НЕТ и не будет.	
	//7.Текст-Сообщение
	//**************************************************************************************************
	//************СЛЕДУЮЩУЮ СТРОКУ НУЖНО РАСКОМЕНТИРОВАТЬ, А ПОСЛЕ НЕЁ - ВСЁ ЗАКОМЕНТИРОВАТЬ.***********
	//**************************************************************************************************
	
	Возврат SMS_Отправка("integrationapi.net/rest", "Mirceramiki", "Aa123456", Телефон, "MIRCERAMIKI", 0, Сообщение)	
	
//+СТАРОЕ ===коментируем===
	//Логин = Константы.мчт_ИмяПользователяСМСАвторизации.Получить();
	//Пароль = Константы.мчт_ПарольПользователяСМСАвторизации.Получить();
	//Возврат ОтправитьСМССообщение("mechta", "343585taha", Телефон, Сообщение, "Mechta" , "5", Дост);
//-
КонецФункции


Функция SMS_Отправка(SMS_Server, SMS_User, SMS_Pass, SMS_To, SMS_From, SMS_Flash, SMS_Text) Экспорт
	//ОтправитьВТелеграмм();
	ТекстОтвет = "";
	Ответ = "";                         
	Вернуть = "-1"; // SMS_ID - не удалось получить
	Отказ = Ложь;	
	SMS_Text_ToGo = ОбработатьТекстСМСПередОтправкой(SMS_Text);
	Попытка
		HTTPСоединение = Новый HTTPСоединение(SMS_Server,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		ПараметрыЗапроса="";
		ПараметрыЗапроса = ПараметрыЗапроса + "&Login=" 		+ SMS_User;
		ПараметрыЗапроса = ПараметрыЗапроса + "&Password=" 		+ SMS_Pass;
		ПараметрыЗапроса = ПараметрыЗапроса + "&SourceAddress=" + SMS_From;		
		ПараметрыЗапроса = ПараметрыЗапроса + "&DestinationAddress=" 	+ SMS_To;		
		ПараметрыЗапроса = ПараметрыЗапроса + "&Data=" + SMS_Text_ToGo;
		//ПараметрыЗапроса = ПараметрыЗапроса + "&Validity=" + 0;
		HTTPЗапрос = Новый HTTPЗапрос("/v2/Sms/Send?"+ПараметрыЗапроса); 
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/x-www-form-urlencoded");
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТекстОтвет = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	Исключение
		Сообщить("Неудачная попытка");
		Сообщить(ОписаниеОшибки());
		//ОтправитьВТелеграмм("При отправки СМС на номер "+SMS_To+" с текстом : 
		//					|"+SMS_Text+". 
		//					|Вышла ошибка отправки запроса к поставщику коммуникационных услуг: 
		//					|"+ОписаниеОшибки());
		Возврат Вернуть;		
	КонецПопытки;
	
	Если Найти(ТекстОтвет, "{""Code"":") Тогда
		//ОтправитьВТелеграмм("При отправки СМС на номер "+SMS_To+" с текстом : 
		//					|"+SMS_Text+". 
		//					|Введены не верные данные: 
		//					|"+ТекстОтвет);
		Возврат Вернуть;
	КонецЕсли;
	
	ТекстОтвет = СтрЗаменить(СтрЗаменить(ТекстОтвет, "[""",""),"""]","");
	Вернуть = ТекстОтвет; // Выделение SMS_ID
	Возврат Вернуть;
	
	
КонецФункции

Функция ОбработатьТекстСМСПередОтправкой(Text) Экспорт
	Text1 = Text;
	CrLf = Символ(13) + Символ(10);
	
	// Подготовка текста SMS к отправке - преобразование к HTML форме
	Text1=СтрЗаменить(Text1,"&"     ,"%26" ); // Обработка  &
	Text1=СтрЗаменить(Text1,"<"     ,"%3C"  ); // Обработка  <
	Text1=СтрЗаменить(Text1,">"     ,"%3E"  ); // Обработка  >
	Text1=СтрЗаменить(Text1,Символы.ПС    ,"%0A"  ); // Обработка символов переноса
	Возврат  Text1;            
КонецФункции	
