
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	НастройкиПоискаПоТоварам = ТорговыеПредложения.СохраненныеНастройкиПоискаПоТоварам();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиПоискаПоТоварам);
	Элементы.ПоискПоХарактеристике.Доступность = ПоискПоНаименованию;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИзменениеРежимаПоиска(Элемент)
	
	Имя = Элемент.Имя;
	Если Не ПоискПоНаименованию И Не ПоискПоАртикулу И Не ПоискПоШтрихКоду Тогда
		ЭтотОбъект[Имя] = Не ЭтотОбъект[Имя];
		Возврат;
	КонецЕсли;
	
	Элементы.ПоискПоХарактеристике.Доступность = ПоискПоНаименованию;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПрименить(Команда)
	
	НастройкиПоиска = Новый Структура;
	НастройкиПоиска.Вставить("ОграничениеТорговыхПредложений", ОграничениеТорговыхПредложений);
	НастройкиПоиска.Вставить("ПревышениеМинимальнойЦены",      ПревышениеМинимальнойЦены);
	НастройкиПоиска.Вставить("МаксимальныйСрокПоставки",       МаксимальныйСрокПоставки);
	НастройкиПоиска.Вставить("ПоискПоНаименованию",            ПоискПоНаименованию);
	НастройкиПоиска.Вставить("ПоискПоАртикулу",                ПоискПоАртикулу);
	НастройкиПоиска.Вставить("ПоискПоШтрихКоду",               ПоискПоШтрихКоду);
	НастройкиПоиска.Вставить("ПоискПоХарактеристике",          ПоискПоХарактеристике);
	СохранитьНастройкиПоискаПоТоварам(НастройкиПоиска);
	Закрыть(НастройкиПоиска);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиПоискаПоТоварам(НастройкиПоиска)
	
	ТорговыеПредложения.СохранитьНастройкиПоискаПоТоварам(НастройкиПоиска);
	
КонецПроцедуры

#КонецОбласти