
#Область ПрограммныйИнтерфейс


Процедура ДобавитьНастройку(НастройкиОтраженияНДС, ВидНДС, Налогообложение, СчетУчета) Экспорт
	
	ШаблонНастройки = "
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК АналитикаУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыНДС.Товары)                	   КАК МестоУчета,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНачисленныйПриПокупке)    КАК СчетУчета
	|
	|";
	ШаблонНастройки = СтрЗаменить(ШаблонНастройки, "ПустаяСсылка",          Налогообложение);
	ШаблонНастройки = СтрЗаменить(ШаблонНастройки, "Товары",                ВидНДС);
	ШаблонНастройки = СтрЗаменить(ШаблонНастройки, "НДСНачисленныйПриПокупке", СчетУчета);
	
	НастройкиОтраженияНДС.Добавить(ШаблонНастройки);
	
КонецПроцедуры

#КонецОбласти

