
&НаСервере
Процедура РассчитатьНаСервере()
	
	Объект.Расчеты.Очистить();
	//порядок расчета бонусов по мотивационной программе:
	//1. личные
	//2. групповые
	//3. котел руководителя
	//4. котел пропорциональный
	//5. проектные
	//6. партнерские
	//7. партнерские групповые
	
	
	//сперва рассчитываем личные бонусы, затем групповые
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШкалаБонусныхПроцентовОтПродаж.Период КАК Период,
	|	ШкалаБонусныхПроцентовОтПродаж.Подразделение КАК Подразделение,
	|	ШкалаБонусныхПроцентовОтПродаж.Должность КАК Должность,
	|	ШкалаБонусныхПроцентовОтПродаж.НижнийПорогОбъемаПродаж КАК НижнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВерхнийПорогОбъемаПродаж КАК ВерхнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВидБонуса КАК ВидБонуса,
	|	ШкалаБонусныхПроцентовОтПродаж.ПроцентОтОбщихБонусов КАК ПроцентОтОбщихБонусов,
	|	ШкалаБонусныхПроцентовОтПродаж.СегментНоменклатуры КАК СегментНоменклатуры,
	|	ШкалаБонусныхПроцентовОтПродаж.БонусныйПроцент КАК БонусныйПроцент,
	|	ШкалаБонусныхПроцентовОтПродаж.ПропорциональноОтОбщихПродаж КАК ПропорциональноОтОбщихПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ОсновнойДляРасчетаКотлаПодразделения КАК ОсновнойДляРасчетаКотлаПодразделения,
	|	НоменклатураСегмента.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втШкалаСНоменклатурой
	|ИЗ
	|	РегистрСведений.ШкалаБонусныхПроцентовОтПродаж КАК ШкалаБонусныхПроцентовОтПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|		ПО ШкалаБонусныхПроцентовОтПродаж.СегментНоменклатуры = НоменклатураСегмента.Сегмент
	|ГДЕ
	|	ШкалаБонусныхПроцентовОтПродаж.Период = &ВыбМесяц
	|	И ШкалаБонусныхПроцентовОтПродаж.ВидБонуса = &ВидБонусаЛичные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкалаСНоменклатурой.СегментНоменклатуры КАК СегментНоменклатуры,
	|	втШкалаСНоменклатурой.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втСоставСегмента
	|ИЗ
	|	втШкалаСНоменклатурой КАК втШкалаСНоменклатурой
	|
	|СГРУППИРОВАТЬ ПО
	|	втШкалаСНоменклатурой.СегментНоменклатуры,
	|	втШкалаСНоменклатурой.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.ЗаказКлиента КАК ДокументЗаказа,
	|	Данные.Регистратор КАК ДокументПродажи,
	|	СУММА(Данные.СуммаВыручкиОборот) КАК Выручка,
	|	СУММА(Данные.КоличествоОборот) КАК КоличествоРеализовано,
	|	Данные.Менеджер КАК Менеджер,
	|	Данные.Подразделение КАК Подразделение,
	|	Данные.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Данные.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА втСоставСегмента.СегментНоменклатуры ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяССылка)
	|		ИНАЧЕ втСоставСегмента.СегментНоменклатуры
	|	КОНЕЦ КАК СегментНоменклатуры
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачПериода, МЕСЯЦ, -1), ДЕНЬ), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), Регистратор, НЕ Договор.Контрагент.ИсключитьИзОтчетов {(НЕ Договор.Контрагент.ИсключитьИзОтчетов) КАК Поле2}) КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСоставСегмента КАК втСоставСегмента
	|		ПО (втСоставСегмента.Номенклатура = Данные.АналитикаУчетаНоменклатуры.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.ЗаказКлиента,
	|	Данные.Регистратор,
	|	Данные.Менеджер,
	|	Данные.Подразделение,
	|	Данные.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Данные.Склад,
	|	ВЫБОР
	|		КОГДА втСоставСегмента.СегментНоменклатуры ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяССылка)
	|		ИНАЧЕ втСоставСегмента.СегментНоменклатуры
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка) КАК СуммаВыручки,
	|	втПродажи.Менеджер КАК Менеджер,
	|	втПродажи.Подразделение КАК Подразделение,
	|	втПродажи.СегментНоменклатуры КАК СегментНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКОтгрузкеОбороты.КОтгрузкеРасход
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ) КАК КоличествоОтгружено,
	|	СУММА(втПродажи.КоличествоРеализовано) КАК КоличествоРеализовано
	|ПОМЕСТИТЬ втОтгрузки
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(&НачПериода, КОНЕЦПЕРИОДА(&КонПериода, ДЕНЬ), Регистратор, ) КАК ТоварыКОтгрузкеОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКОтгрузкеОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКОтгрузкеОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКОтгрузкеОбороты.ДокументОтгрузки)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.РеализацияТоваровУслуг)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втПродажи.СегментНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка),
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втПродажи.СегментНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКПоступлениюОбороты.КОформлениюОрдеровРасход * -1
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ),
	|	СУММА(втПродажи.КоличествоРеализовано)
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Обороты(&НачПериода, КОНЕЦПЕРИОДА(&КонПериода, ДЕНЬ), Регистратор, ХозяйственнаяОперация = &ХозяйственнаяОперацияВозвратТоваровОтКлиента) КАК ТоварыКПоступлениюОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКПоступлениюОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКПоступлениюОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКПоступлениюОбороты.ДокументПоступления.ДокументРеализации.ЗаказКлиента)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.ВозвратТоваровОтКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Подразделение,
	|	втПродажи.Менеджер,
	|	втПродажи.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втОтгрузки.СуммаВыручки / втОтгрузки.КоличествоРеализовано * втОтгрузки.КоличествоОтгружено) КАК СуммаВыручки,
	|	втОтгрузки.Менеджер КАК Менеджер,
	|	втОтгрузки.Подразделение КАК Подразделение,
	|	втОтгрузки.СегментНоменклатуры КАК СегментНоменклатуры
	|ПОМЕСТИТЬ втПродажиРез
	|ИЗ
	|	втОтгрузки КАК втОтгрузки
	|ГДЕ
	|	НЕ втОтгрузки.Менеджер ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	втОтгрузки.Менеджер,
	|	втОтгрузки.Подразделение,
	|	втОтгрузки.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкалаСНоменклатурой.БонусныйПроцент КАК БонусныйПроцент,
	|	втШкалаСНоменклатурой.ВидБонуса КАК ВидБонуса,
	|	втШкалаСНоменклатурой.Подразделение КАК Подразделение,
	|	втШкалаСНоменклатурой.СегментНоменклатуры КАК СегментНоменклатуры,
	|	втШкалаСНоменклатурой.Должность КАК Должность,
	|	втШкалаСНоменклатурой.НижнийПорогОбъемаПродаж КАК НижнийПорогОбъемаПродаж,
	|	втШкалаСНоменклатурой.ВерхнийПорогОбъемаПродаж КАК ВерхнийПорогОбъемаПродаж
	|ПОМЕСТИТЬ втШкала
	|ИЗ
	|	втШкалаСНоменклатурой КАК втШкалаСНоменклатурой
	|
	|СГРУППИРОВАТЬ ПО
	|	втШкалаСНоменклатурой.БонусныйПроцент,
	|	втШкалаСНоменклатурой.ВидБонуса,
	|	втШкалаСНоменклатурой.Подразделение,
	|	втШкалаСНоменклатурой.СегментНоменклатуры,
	|	втШкалаСНоменклатурой.Должность,
	|	втШкалаСНоменклатурой.НижнийПорогОбъемаПродаж,
	|	втШкалаСНоменклатурой.ВерхнийПорогОбъемаПродаж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СРЕДНЕЕ(втШкала.БонусныйПроцент) КАК БонусныйПроцент,
	|	втШкала.ВидБонуса КАК ВидБонуса,
	|	втШкала.Подразделение КАК Подразделение,
	|	втПродажиРез.Менеджер КАК Сотрудник,
	|	СУММА(втПродажиРез.СуммаВыручки) КАК СуммаВыручки,
	|	СУММА(втПродажиРез.СуммаВыручки * (втШкала.БонусныйПроцент / 100)) КАК СуммаБонусов
	|ИЗ
	|	втШкала КАК втШкала
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажиРез КАК втПродажиРез
	|		ПО втШкала.Подразделение = втПродажиРез.Подразделение
	|			И (втПродажиРез.Менеджер.Должность = втШкала.Должность)
	|			И (втПродажиРез.СегментНоменклатуры = втШкала.СегментНоменклатуры)
	|			И (втПродажиРез.СуммаВыручки >= втШкала.НижнийПорогОбъемаПродаж)
	|			И (втПродажиРез.СуммаВыручки <= втШкала.ВерхнийПорогОбъемаПродаж)
	|			И (НЕ втПродажиРез.Менеджер ЕСТЬ NULL)
	|
	|СГРУППИРОВАТЬ ПО
	|	втШкала.Подразделение,
	|	втШкала.ВидБонуса,
	|	втПродажиРез.Менеджер";
	Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.МесяцРасчета));
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.МесяцРасчета));
	Запрос.УстановитьПараметр("ВыбМесяц", НачалоМесяца(Объект.МесяцРасчета));
	Запрос.УстановитьПараметр("ВидБонусаЛичные", Перечисления.ВидыБонусов.Личные);   
	Запрос.УстановитьПараметр("ХозяйственнаяОперацияВозвратТоваровОтКлиента", Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", Перечисления.ТипыНоменклатуры.Услуга);
 
    тзБонусы = Запрос.Выполнить().Выгрузить();
	
	Объект.Расчеты.Загрузить(тзБонусы);
	
	//теперь рассчитываем групповые бонусы
	ЗапросГрупп = Новый Запрос;
	ЗапросГрупп.Текст =
	"ВЫБРАТЬ
	|	ШкалаБонусныхПроцентовОтПродаж.Период КАК Период,
	|	ШкалаБонусныхПроцентовОтПродаж.Подразделение КАК Подразделение,
	|	ШкалаБонусныхПроцентовОтПродаж.Должность КАК Должность,
	|	ШкалаБонусныхПроцентовОтПродаж.НижнийПорогОбъемаПродаж КАК НижнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВерхнийПорогОбъемаПродаж КАК ВерхнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВидБонуса КАК ВидБонуса,
	|	ШкалаБонусныхПроцентовОтПродаж.ПроцентОтОбщихБонусов КАК ПроцентОтОбщихБонусов,
	|	ШкалаБонусныхПроцентовОтПродаж.СегментНоменклатуры КАК СегментНоменклатуры,
	|	ШкалаБонусныхПроцентовОтПродаж.БонусныйПроцент КАК БонусныйПроцент,
	|	ШкалаБонусныхПроцентовОтПродаж.ПропорциональноОтОбщихПродаж КАК ПропорциональноОтОбщихПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ОсновнойДляРасчетаКотлаПодразделения КАК ОсновнойДляРасчетаКотлаПодразделения,
	|	НоменклатураСегмента.Номенклатура КАК Номенклатура,
	|	Пользователи.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ втШкалаСНоменклатурой
	|ИЗ
	|	РегистрСведений.ШкалаБонусныхПроцентовОтПродаж КАК ШкалаБонусныхПроцентовОтПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|		ПО ШкалаБонусныхПроцентовОтПродаж.СегментНоменклатуры = НоменклатураСегмента.Сегмент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ШкалаБонусныхПроцентовОтПродаж.Должность = Пользователи.Должность
	|ГДЕ
	|	ШкалаБонусныхПроцентовОтПродаж.Период = &ВыбМесяц
	|	И ШкалаБонусныхПроцентовОтПродаж.ВидБонуса = &ВидБонусаГрупповые
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкалаСНоменклатурой.СегментНоменклатуры КАК СегментНоменклатуры,
	|	втШкалаСНоменклатурой.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втСоставСегмента
	|ИЗ
	|	втШкалаСНоменклатурой КАК втШкалаСНоменклатурой
	|
	|СГРУППИРОВАТЬ ПО
	|	втШкалаСНоменклатурой.СегментНоменклатуры,
	|	втШкалаСНоменклатурой.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.ЗаказКлиента КАК ДокументЗаказа,
	|	Данные.Регистратор КАК ДокументПродажи,
	|	СУММА(Данные.СуммаВыручкиОборот) КАК Выручка,
	|	СУММА(Данные.КоличествоОборот) КАК КоличествоРеализовано,
	|	Данные.Менеджер КАК Менеджер,
	|	Данные.Подразделение КАК Подразделение,
	|	Данные.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Данные.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА втСоставСегмента.СегментНоменклатуры ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяССылка)
	|		ИНАЧЕ втСоставСегмента.СегментНоменклатуры
	|	КОНЕЦ КАК СегментНоменклатуры
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачПериода, МЕСЯЦ, -1), ДЕНЬ), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), Регистратор, НЕ Договор.Контрагент.ИсключитьИзОтчетов {(НЕ Договор.Контрагент.ИсключитьИзОтчетов) КАК Поле2}) КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСоставСегмента КАК втСоставСегмента
	|		ПО Данные.АналитикаУчетаНоменклатуры.Номенклатура = втСоставСегмента.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.ЗаказКлиента,
	|	Данные.Регистратор,
	|	Данные.Менеджер,
	|	Данные.Подразделение,
	|	Данные.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Данные.Склад,
	|	ВЫБОР
	|		КОГДА втСоставСегмента.СегментНоменклатуры ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяССылка)
	|		ИНАЧЕ втСоставСегмента.СегментНоменклатуры
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка) КАК СуммаВыручки,
	|	втПродажи.Менеджер КАК Менеджер,
	|	втПродажи.Подразделение КАК Подразделение,
	|	втПродажи.СегментНоменклатуры КАК СегментНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКОтгрузкеОбороты.КОтгрузкеРасход
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ) КАК КоличествоОтгружено,
	|	СУММА(втПродажи.КоличествоРеализовано) КАК КоличествоРеализовано
	|ПОМЕСТИТЬ втОтгрузки
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(&НачПериода, КОНЕЦПЕРИОДА(&КонПериода, ДЕНЬ), Регистратор, ) КАК ТоварыКОтгрузкеОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКОтгрузкеОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКОтгрузкеОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКОтгрузкеОбороты.ДокументОтгрузки)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.РеализацияТоваровУслуг)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втПродажи.СегментНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка),
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втПродажи.СегментНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКПоступлениюОбороты.КОформлениюОрдеровРасход * -1
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ),
	|	СУММА(втПродажи.КоличествоРеализовано)
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Обороты(&НачПериода, КОНЕЦПЕРИОДА(&КонПериода, ДЕНЬ), Регистратор, ХозяйственнаяОперация = &ХозяйственнаяОперацияВозвратТоваровОтКлиента) КАК ТоварыКПоступлениюОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКПоступлениюОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКПоступлениюОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКПоступлениюОбороты.ДокументПоступления.ДокументРеализации.ЗаказКлиента)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.ВозвратТоваровОтКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Подразделение,
	|	втПродажи.Менеджер,
	|	втПродажи.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втОтгрузки.СуммаВыручки / втОтгрузки.КоличествоРеализовано * втОтгрузки.КоличествоОтгружено) КАК СуммаВыручки,
	|	втОтгрузки.Подразделение КАК Подразделение,
	|	втОтгрузки.СегментНоменклатуры КАК СегментНоменклатуры
	|ПОМЕСТИТЬ втПродажиРез
	|ИЗ
	|	втОтгрузки КАК втОтгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	втОтгрузки.Подразделение,
	|	втОтгрузки.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажиРез.Подразделение КАК Подразделение,
	|	СУММА(втПродажиРез.СуммаВыручки) КАК СуммаВыручки,
	|	втШкалаСНоменклатурой.БонусныйПроцент КАК БонусныйПроцент,
	|	СУММА(втПродажиРез.СуммаВыручки * (втШкалаСНоменклатурой.БонусныйПроцент / 100)) КАК СуммаБонусов,
	|	втШкалаСНоменклатурой.ВидБонуса КАК ВидБонуса,
	|	втШкалаСНоменклатурой.Сотрудник КАК Сотрудник
	|ИЗ
	|	втШкалаСНоменклатурой КАК втШкалаСНоменклатурой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПродажиРез КАК втПродажиРез
	|		ПО (втПродажиРез.Подразделение = втШкалаСНоменклатурой.Подразделение)
	|			И (втПродажиРез.СегментНоменклатуры = втШкалаСНоменклатурой.СегментНоменклатуры)
	|			И (втПродажиРез.СуммаВыручки >= втШкалаСНоменклатурой.НижнийПорогОбъемаПродаж)
	|			И (втПродажиРез.СуммаВыручки <= втШкалаСНоменклатурой.ВерхнийПорогОбъемаПродаж)
	|ГДЕ
	|	НЕ втШкалаСНоменклатурой.Сотрудник ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажиРез.Подразделение,
	|	втШкалаСНоменклатурой.БонусныйПроцент,
	|	втШкалаСНоменклатурой.ВидБонуса,
	|	втШкалаСНоменклатурой.Сотрудник";
	ЗапросГрупп.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросГрупп.УстановитьПараметр("КонПериода", КонецМесяца(Объект.МесяцРасчета));
	ЗапросГрупп.УстановитьПараметр("ВыбМесяц", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросГрупп.УстановитьПараметр("ВидБонусаГрупповые", Перечисления.ВидыБонусов.Групповые);
	ЗапросГрупп.УстановитьПараметр("ХозяйственнаяОперацияВозвратТоваровОтКлиента", Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
	ЗапросГрупп.УстановитьПараметр("ТипНоменклатурыУслуга", Перечисления.ТипыНоменклатуры.Услуга);
	
	тзБонусыГрупп = ЗапросГрупп.Выполнить().Выгрузить();
	
	Для каждого стр из тзБонусыГрупп цикл
		Если стр.Подразделение.ПринадлежитЭлементу(стр.Сотрудник.Подразделение) или стр.Подразделение = стр.Сотрудник.Подразделение тогда
			НоваяСтрока = Объект.Расчеты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
		КонецЕсли;
	КонецЦикла;
	
	//теперь рассчитываем бонусы от котла руководителя	
	ЗапросКотелРуководителя = Новый Запрос;
	ЗапросКотелРуководителя.Текст=
	"ВЫБРАТЬ
	|	ШкалаБонусныхПроцентовОтПродаж.Период КАК Период,
	|	ШкалаБонусныхПроцентовОтПродаж.Подразделение КАК Подразделение,
	|	ШкалаБонусныхПроцентовОтПродаж.Должность КАК Должность,
	|	ШкалаБонусныхПроцентовОтПродаж.НижнийПорогОбъемаПродаж КАК НижнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВерхнийПорогОбъемаПродаж КАК ВерхнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВидБонуса КАК ВидБонуса,
	|	ШкалаБонусныхПроцентовОтПродаж.ПроцентОтОбщихБонусов КАК ПроцентОтОбщихБонусов,
	|	ШкалаБонусныхПроцентовОтПродаж.СегментНоменклатуры КАК СегментНоменклатуры,
	|	ШкалаБонусныхПроцентовОтПродаж.БонусныйПроцент КАК БонусныйПроцент,
	|	ШкалаБонусныхПроцентовОтПродаж.ПропорциональноОтОбщихПродаж КАК ПропорциональноОтОбщихПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ОсновнойДляРасчетаКотлаПодразделения КАК ОсновнойДляРасчетаКотлаПодразделения,
	|	НоменклатураСегмента.Номенклатура КАК Номенклатура,
	|	Пользователи.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ втШкалаСНоменклатурой
	|ИЗ
	|	РегистрСведений.ШкалаБонусныхПроцентовОтПродаж КАК ШкалаБонусныхПроцентовОтПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|		ПО ШкалаБонусныхПроцентовОтПродаж.СегментНоменклатуры = НоменклатураСегмента.Сегмент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО (ШкалаБонусныхПроцентовОтПродаж.Подразделение = Пользователи.Подразделение
	|					И ШкалаБонусныхПроцентовОтПродаж.Должность = Пользователи.Должность
	|				ИЛИ ШкалаБонусныхПроцентовОтПродаж.Подразделение.Родитель = Пользователи.Подразделение
	|					И ШкалаБонусныхПроцентовОтПродаж.Должность = Пользователи.Должность)
	|ГДЕ
	|	ШкалаБонусныхПроцентовОтПродаж.Период = &ВыбМесяц
	|	И ШкалаБонусныхПроцентовОтПродаж.ВидБонуса = &ВидБонусаКотелРуководителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкалаСНоменклатурой.СегментНоменклатуры КАК СегментНоменклатуры,
	|	втШкалаСНоменклатурой.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втСоставСегмента
	|ИЗ
	|	втШкалаСНоменклатурой КАК втШкалаСНоменклатурой
	|
	|СГРУППИРОВАТЬ ПО
	|	втШкалаСНоменклатурой.СегментНоменклатуры,
	|	втШкалаСНоменклатурой.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.ЗаказКлиента КАК ДокументЗаказа,
	|	Данные.Регистратор КАК ДокументПродажи,
	|	СУММА(Данные.СуммаВыручкиОборот) КАК Выручка,
	|	СУММА(Данные.КоличествоОборот) КАК КоличествоРеализовано,
	|	Данные.Менеджер КАК Менеджер,
	|	Данные.Подразделение КАК Подразделение,
	|	Данные.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Данные.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА втСоставСегмента.СегментНоменклатуры ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяССылка)
	|		ИНАЧЕ втСоставСегмента.СегментНоменклатуры
	|	КОНЕЦ КАК СегментНоменклатуры
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачПериода, МЕСЯЦ, -1), ДЕНЬ), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), Регистратор, НЕ Договор.Контрагент.ИсключитьИзОтчетов {(НЕ Договор.Контрагент.ИсключитьИзОтчетов) КАК Поле2}) КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСоставСегмента КАК втСоставСегмента
	|		ПО Данные.АналитикаУчетаНоменклатуры.Номенклатура = втСоставСегмента.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.ЗаказКлиента,
	|	Данные.Регистратор,
	|	Данные.Менеджер,
	|	Данные.Подразделение,
	|	Данные.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Данные.Склад,
	|	ВЫБОР
	|		КОГДА втСоставСегмента.СегментНоменклатуры ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяССылка)
	|		ИНАЧЕ втСоставСегмента.СегментНоменклатуры
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка) КАК СуммаВыручки,
	|	втПродажи.Менеджер КАК Менеджер,
	|	втПродажи.Подразделение КАК Подразделение,
	|	втПродажи.СегментНоменклатуры КАК СегментНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКОтгрузкеОбороты.КОтгрузкеРасход
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ) КАК Поле1,
	|	СУММА(втПродажи.КоличествоРеализовано) КАК КоличествоРеализовано,
	|	NULL КАК Поле2
	|ПОМЕСТИТЬ втПред
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(&НачПериода, КОНЕЦПЕРИОДА(&КонПериода, ДЕНЬ), Регистратор, ) КАК ТоварыКОтгрузкеОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКОтгрузкеОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКОтгрузкеОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКОтгрузкеОбороты.ДокументОтгрузки)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.РеализацияТоваровУслуг)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втПродажи.СегментНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка),
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втПродажи.СегментНоменклатуры,
	|	NULL,
	|	СУММА(втПродажи.КоличествоРеализовано),
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКПоступлениюОбороты.КОформлениюОрдеровРасход * -1
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Обороты(&НачПериода, КОНЕЦПЕРИОДА(&КонПериода, ДЕНЬ), Регистратор, ХозяйственнаяОперация = &ХозяйственнаяОперацияВозвратТоваровОтКлиента) КАК ТоварыКПоступлениюОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКПоступлениюОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКПоступлениюОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКПоступлениюОбороты.ДокументПоступления.ДокументРеализации.ЗаказКлиента)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.ВозвратТоваровОтКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Подразделение,
	|	втПродажи.Менеджер,
	|	втПродажи.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка) КАК СуммаВыручки,
	|	втПродажи.Менеджер КАК Менеджер,
	|	втПродажи.Подразделение КАК Подразделение,
	|	втПродажи.СегментНоменклатуры КАК СегментНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКОтгрузкеОбороты.КОтгрузкеРасход
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ) КАК КоличествоОтгружено,
	|	СУММА(втПродажи.КоличествоРеализовано) КАК КоличествоРеализовано
	|ПОМЕСТИТЬ втОтгрузки
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(&НачПериода, КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонПериода, ДЕНЬ, 2), ДЕНЬ), Регистратор, ) КАК ТоварыКОтгрузкеОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКОтгрузкеОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКОтгрузкеОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКОтгрузкеОбороты.ДокументОтгрузки)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.РеализацияТоваровУслуг)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втПродажи.СегментНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка),
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втПродажи.СегментНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКПоступлениюОбороты.КОформлениюОрдеровРасход * -1
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ),
	|	СУММА(втПродажи.КоличествоРеализовано)
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Обороты(&НачПериода, КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонПериода, ДЕНЬ, 2), ДЕНЬ), Регистратор, ХозяйственнаяОперация = &ХозяйственнаяОперацияВозвратТоваровОтКлиента) КАК ТоварыКПоступлениюОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКПоступлениюОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКПоступлениюОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКПоступлениюОбороты.ДокументПоступления.ДокументРеализации.ЗаказКлиента)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.ВозвратТоваровОтКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Подразделение,
	|	втПродажи.Менеджер,
	|	втПродажи.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втОтгрузки.СуммаВыручки / втОтгрузки.КоличествоРеализовано * втОтгрузки.КоличествоОтгружено) КАК СуммаВыручки,
	|	втОтгрузки.Подразделение КАК Подразделение,
	|	втОтгрузки.СегментНоменклатуры КАК СегментНоменклатуры
	|ПОМЕСТИТЬ втПродажиРез
	|ИЗ
	|	втОтгрузки КАК втОтгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	втОтгрузки.Подразделение,
	|	втОтгрузки.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажиРез.Подразделение КАК Подразделение,
	|	СУММА(втПродажиРез.СуммаВыручки) КАК СуммаВыручки,
	|	втШкалаСНоменклатурой.БонусныйПроцент КАК БонусныйПроцент,
	|	СУММА(втПродажиРез.СуммаВыручки * (втШкалаСНоменклатурой.БонусныйПроцент / 100)) КАК СуммаОбщихБонусов,
	|	втШкалаСНоменклатурой.ВидБонуса КАК ВидБонуса,
	|	СУММА(втПродажиРез.СуммаВыручки * (втШкалаСНоменклатурой.БонусныйПроцент / 100) * (втШкалаСНоменклатурой.ПроцентОтОбщихБонусов / 100)) КАК СуммаБонусов,
	|	втШкалаСНоменклатурой.Сотрудник КАК Сотрудник
	|ИЗ
	|	втШкалаСНоменклатурой КАК втШкалаСНоменклатурой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПродажиРез КАК втПродажиРез
	|		ПО (втПродажиРез.Подразделение = втШкалаСНоменклатурой.Подразделение)
	|			И (втПродажиРез.СегментНоменклатуры = втШкалаСНоменклатурой.СегментНоменклатуры)
	|			И (втПродажиРез.СуммаВыручки >= втШкалаСНоменклатурой.НижнийПорогОбъемаПродаж)
	|			И (втПродажиРез.СуммаВыручки <= втШкалаСНоменклатурой.ВерхнийПорогОбъемаПродаж)
	|ГДЕ
	|	НЕ втШкалаСНоменклатурой.Сотрудник ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажиРез.Подразделение,
	|	втШкалаСНоменклатурой.БонусныйПроцент,
	|	втШкалаСНоменклатурой.ВидБонуса,
	|	втШкалаСНоменклатурой.Сотрудник";
	ЗапросКотелРуководителя.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросКотелРуководителя.УстановитьПараметр("КонПериода", КонецМесяца(Объект.МесяцРасчета));
	ЗапросКотелРуководителя.УстановитьПараметр("ВыбМесяц", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросКотелРуководителя.УстановитьПараметр("ВидБонусаКотелРуководителя", Перечисления.ВидыБонусов.КотелРуководителя);
	ЗапросКотелРуководителя.УстановитьПараметр("ХозяйственнаяОперацияВозвратТоваровОтКлиента", Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
	ЗапросКотелРуководителя.УстановитьПараметр("ТипНоменклатурыУслуга", Перечисления.ТипыНоменклатуры.Услуга);


    тзБонусыКотелРуководителя = ЗапросКотелРуководителя.Выполнить().Выгрузить();
	
	Для каждого стр из тзБонусыКотелРуководителя цикл
		НоваяСтрока = Объект.Расчеты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
	КонецЦикла;
	
	
	//теперь рассчитываем бонусы от котла пропорционального	
	ЗапросКотелПропорцональный = Новый Запрос;
	ЗапросКотелПропорцональный.Текст=
	"ВЫБРАТЬ
	|	ШкалаБонусныхПроцентовОтПродаж.Период КАК Период,
	|	ШкалаБонусныхПроцентовОтПродаж.Подразделение КАК Подразделение,
	|	ШкалаБонусныхПроцентовОтПродаж.Должность КАК Должность,
	|	ШкалаБонусныхПроцентовОтПродаж.НижнийПорогОбъемаПродаж КАК НижнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВерхнийПорогОбъемаПродаж КАК ВерхнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВидБонуса КАК ВидБонуса,
	|	ШкалаБонусныхПроцентовОтПродаж.ПроцентОтОбщихБонусов КАК ПроцентОтОбщихБонусов,
	|	ШкалаБонусныхПроцентовОтПродаж.СегментНоменклатуры КАК СегментНоменклатуры,
	|	ШкалаБонусныхПроцентовОтПродаж.БонусныйПроцент КАК БонусныйПроцент,
	|	ШкалаБонусныхПроцентовОтПродаж.ПропорциональноОтОбщихПродаж КАК ПропорциональноОтОбщихПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ОсновнойДляРасчетаКотлаПодразделения КАК ОсновнойДляРасчетаКотлаПодразделения,
	|	НоменклатураСегмента.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втШкалаСНоменклатурой
	|ИЗ
	|	РегистрСведений.ШкалаБонусныхПроцентовОтПродаж КАК ШкалаБонусныхПроцентовОтПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|		ПО ШкалаБонусныхПроцентовОтПродаж.СегментНоменклатуры = НоменклатураСегмента.Сегмент
	|ГДЕ
	|	ШкалаБонусныхПроцентовОтПродаж.Период = &ВыбМесяц
	|	И ШкалаБонусныхПроцентовОтПродаж.ВидБонуса = &ВидБонусаКотелРуководителя
	|	И ШкалаБонусныхПроцентовОтПродаж.ОсновнойДляРасчетаКотлаПодразделения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкалаСНоменклатурой.СегментНоменклатуры КАК СегментНоменклатуры,
	|	втШкалаСНоменклатурой.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втСоставСегмента
	|ИЗ
	|	втШкалаСНоменклатурой КАК втШкалаСНоменклатурой
	|
	|СГРУППИРОВАТЬ ПО
	|	втШкалаСНоменклатурой.СегментНоменклатуры,
	|	втШкалаСНоменклатурой.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.ЗаказКлиента КАК ДокументЗаказа,
	|	Данные.Регистратор КАК ДокументПродажи,
	|	СУММА(Данные.СуммаВыручкиОборот) КАК Выручка,
	|	СУММА(Данные.КоличествоОборот) КАК КоличествоРеализовано,
	|	Данные.Менеджер КАК Менеджер,
	|	Данные.Подразделение КАК Подразделение,
	|	Данные.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Данные.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА втСоставСегмента.СегментНоменклатуры ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяССылка)
	|		ИНАЧЕ втСоставСегмента.СегментНоменклатуры
	|	КОНЕЦ КАК СегментНоменклатуры
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачПериода, МЕСЯЦ, -1), ДЕНЬ), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), Регистратор, НЕ Договор.Контрагент.ИсключитьИзОтчетов {(НЕ Договор.Контрагент.ИсключитьИзОтчетов) КАК Поле2}) КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСоставСегмента КАК втСоставСегмента
	|		ПО (втСоставСегмента.Номенклатура = Данные.АналитикаУчетаНоменклатуры.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.ЗаказКлиента,
	|	Данные.Регистратор,
	|	Данные.Менеджер,
	|	Данные.Подразделение,
	|	Данные.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Данные.Склад,
	|	ВЫБОР
	|		КОГДА втСоставСегмента.СегментНоменклатуры ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяССылка)
	|		ИНАЧЕ втСоставСегмента.СегментНоменклатуры
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка) КАК СуммаВыручки,
	|	втПродажи.Менеджер КАК Менеджер,
	|	втПродажи.Подразделение КАК Подразделение,
	|	втПродажи.СегментНоменклатуры КАК СегментНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКОтгрузкеОбороты.КОтгрузкеРасход
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ) КАК КоличествоОтгружено,
	|	СУММА(втПродажи.КоличествоРеализовано) КАК КоличествоРеализовано
	|ПОМЕСТИТЬ втОтгрузки
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(&НачПериода, КОНЕЦПЕРИОДА(&КонПериода, ДЕНЬ), Регистратор, ) КАК ТоварыКОтгрузкеОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКОтгрузкеОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКОтгрузкеОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКОтгрузкеОбороты.ДокументОтгрузки)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.РеализацияТоваровУслуг)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втПродажи.СегментНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка),
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втПродажи.СегментНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКПоступлениюОбороты.КОформлениюОрдеровРасход * -1
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ),
	|	СУММА(втПродажи.КоличествоРеализовано)
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Обороты(&НачПериода, КОНЕЦПЕРИОДА(&КонПериода, ДЕНЬ), Регистратор, ХозяйственнаяОперация = &ХозяйственнаяОперацияВозвратТоваровОтКлиента) КАК ТоварыКПоступлениюОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКПоступлениюОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКПоступлениюОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКПоступлениюОбороты.ДокументПоступления.ДокументРеализации.ЗаказКлиента)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.ВозвратТоваровОтКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Подразделение,
	|	втПродажи.Менеджер,
	|	втПродажи.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА втОтгрузки.КоличествоРеализовано <> 0
	|					И втОтгрузки.КоличествоОтгружено <> 0
	|				ТОГДА втОтгрузки.СуммаВыручки / втОтгрузки.КоличествоРеализовано * втОтгрузки.КоличествоОтгружено
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВыручки,
	|	втОтгрузки.Менеджер КАК Менеджер,
	|	втОтгрузки.Подразделение КАК Подразделение,
	|	втОтгрузки.СегментНоменклатуры КАК СегментНоменклатуры
	|ПОМЕСТИТЬ втПродажиПоМенеджерам
	|ИЗ
	|	втОтгрузки КАК втОтгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	втОтгрузки.Менеджер,
	|	втОтгрузки.Подразделение,
	|	втОтгрузки.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА втОтгрузки.КоличествоРеализовано <> 0
	|					И втОтгрузки.КоличествоОтгружено <> 0
	|				ТОГДА втОтгрузки.СуммаВыручки / втОтгрузки.КоличествоРеализовано * втОтгрузки.КоличествоОтгружено
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВыручки,
	|	втОтгрузки.Подразделение КАК Подразделение,
	|	втОтгрузки.СегментНоменклатуры КАК СегментНоменклатуры
	|ПОМЕСТИТЬ втПродажиПоПодразделениям
	|ИЗ
	|	втОтгрузки КАК втОтгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	втОтгрузки.Подразделение,
	|	втОтгрузки.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажиПоМенеджерам.СуммаВыручки КАК СуммаВыручки,
	|	втПродажиПоМенеджерам.Менеджер КАК Менеджер,
	|	втПродажиПоМенеджерам.Подразделение КАК Подразделение,
	|	втПродажиПоМенеджерам.СегментНоменклатуры КАК СегментНоменклатуры,
	|	ВЫБОР
	|		КОГДА втПродажиПоПодразделениям.СуммаВыручки > 0
	|			ТОГДА втПродажиПоМенеджерам.СуммаВыручки / втПродажиПоПодразделениям.СуммаВыручки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Доля
	|ПОМЕСТИТЬ втПродажиДоли
	|ИЗ
	|	втПродажиПоМенеджерам КАК втПродажиПоМенеджерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажиПоПодразделениям КАК втПродажиПоПодразделениям
	|		ПО втПродажиПоМенеджерам.Подразделение = втПродажиПоПодразделениям.Подразделение
	|			И втПродажиПоМенеджерам.СегментНоменклатуры = втПродажиПоПодразделениям.СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкалаСНоменклатурой.ВидБонуса КАК ВидБонуса,
	|	СУММА(втПродажиПоПодразделениям.СуммаВыручки * (втШкалаСНоменклатурой.БонусныйПроцент / 100)) КАК СуммаОбщихБонусов,
	|	втПродажиПоПодразделениям.Подразделение КАК Подразделение,
	|	втШкалаСНоменклатурой.Должность КАК Должность,
	|	втШкалаСНоменклатурой.СегментНоменклатуры КАК СегментНоменклатуры,
	|	втШкалаСНоменклатурой.ПроцентОтОбщихБонусов КАК ПроцентОтОбщихБонусов
	|ПОМЕСТИТЬ втОбщаяСуммаБонусов
	|ИЗ
	|	втШкалаСНоменклатурой КАК втШкалаСНоменклатурой
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажиПоПодразделениям КАК втПродажиПоПодразделениям
	|		ПО (втПродажиПоПодразделениям.Подразделение = втШкалаСНоменклатурой.Подразделение)
	|			И втШкалаСНоменклатурой.СегментНоменклатуры = втПродажиПоПодразделениям.СегментНоменклатуры
	|			И втШкалаСНоменклатурой.НижнийПорогОбъемаПродаж <= втПродажиПоПодразделениям.СуммаВыручки
	|			И втШкалаСНоменклатурой.ВерхнийПорогОбъемаПродаж >= втПродажиПоПодразделениям.СуммаВыручки
	|
	|СГРУППИРОВАТЬ ПО
	|	втШкалаСНоменклатурой.ВидБонуса,
	|	втПродажиПоПодразделениям.Подразделение,
	|	втШкалаСНоменклатурой.Должность,
	|	втШкалаСНоменклатурой.СегментНоменклатуры,
	|	втШкалаСНоменклатурой.ПроцентОтОбщихБонусов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СРЕДНЕЕ(втОбщаяСуммаБонусов.ПроцентОтОбщихБонусов) КАК БонусныйПроцент,
	|	втОбщаяСуммаБонусов.ВидБонуса КАК ВидБонуса,
	|	СУММА(втОбщаяСуммаБонусов.СуммаОбщихБонусов) КАК СуммаОбщихБонусов,
	|	втОбщаяСуммаБонусов.Подразделение КАК Подразделение,
	|	втПродажиДоли.Менеджер КАК Менеджер,
	|	СУММА(втОбщаяСуммаБонусов.СуммаОбщихБонусов * втПродажиДоли.Доля) КАК СуммаБонусов,
	|	СУММА(втПродажиДоли.СуммаВыручки) КАК СуммаВыручки,
	|	втПродажиДоли.Доля КАК Доля
	|ПОМЕСТИТЬ втПродажиСДолями
	|ИЗ
	|	втПродажиДоли КАК втПродажиДоли
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОбщаяСуммаБонусов КАК втОбщаяСуммаБонусов
	|		ПО (втОбщаяСуммаБонусов.Подразделение = втПродажиДоли.Подразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбщаяСуммаБонусов.ВидБонуса,
	|	втОбщаяСуммаБонусов.Подразделение,
	|	втПродажиДоли.Менеджер,
	|	втПродажиДоли.Доля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШкалаБонусныхПроцентовОтПродаж.ВидБонуса КАК ВидБонуса,
	|	ШкалаБонусныхПроцентовОтПродаж.Подразделение КАК Подразделение,
	|	втПродажиСДолями.Менеджер КАК Сотрудник,
	|	СУММА(втПродажиСДолями.СуммаБонусов) КАК СуммаБонусов,
	|	СУММА(втПродажиСДолями.СуммаВыручки) КАК СуммаВыручки,
	|	втПродажиСДолями.Доля * 100 КАК БонусныйПроцент
	|ИЗ
	|	РегистрСведений.ШкалаБонусныхПроцентовОтПродаж КАК ШкалаБонусныхПроцентовОтПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажиСДолями КАК втПродажиСДолями
	|		ПО (втПродажиСДолями.Подразделение = ШкалаБонусныхПроцентовОтПродаж.Подразделение)
	|			И (втПродажиСДолями.Менеджер.Должность = ШкалаБонусныхПроцентовОтПродаж.Должность)
	|			И ШкалаБонусныхПроцентовОтПродаж.НижнийПорогОбъемаПродаж <= втПродажиСДолями.СуммаВыручки
	|ГДЕ
	|	ШкалаБонусныхПроцентовОтПродаж.ВидБонуса = &ВидБонусаКотелПропорциональный
	|	И ШкалаБонусныхПроцентовОтПродаж.Период = &ВыбМесяц
	|	И НЕ втПродажиСДолями.Подразделение ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ШкалаБонусныхПроцентовОтПродаж.ВидБонуса,
	|	ШкалаБонусныхПроцентовОтПродаж.Подразделение,
	|	втПродажиСДолями.Менеджер,
	|	втПродажиСДолями.Доля * 100";
	ЗапросКотелПропорцональный.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросКотелПропорцональный.УстановитьПараметр("КонПериода", КонецМесяца(Объект.МесяцРасчета));
	ЗапросКотелПропорцональный.УстановитьПараметр("ВыбМесяц", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросКотелПропорцональный.УстановитьПараметр("ВидБонусаКотелПропорциональный", Перечисления.ВидыБонусов.КотелПропорциональный);
	ЗапросКотелПропорцональный.УстановитьПараметр("ВидБонусаКотелРуководителя", Перечисления.ВидыБонусов.КотелРуководителя);
	ЗапросКотелПропорцональный.УстановитьПараметр("ХозяйственнаяОперацияВозвратТоваровОтКлиента", Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
	ЗапросКотелПропорцональный.УстановитьПараметр("ТипНоменклатурыУслуга", Перечисления.ТипыНоменклатуры.Услуга); 

    тзБонусыКотелПропорциональный = ЗапросКотелПропорцональный.Выполнить().Выгрузить();
	Для каждого стр из тзБонусыКотелПропорциональный цикл
		НоваяСтрока = Объект.Расчеты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
	КонецЦикла;

	
	//теперь рассчитываем проектные бонусы
	ЗапросПроект = Новый Запрос;
	ЗапросПроект.Текст =
	"ВЫБРАТЬ
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.Период КАК Период,
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.Подразделение КАК Подразделение,
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.Должность КАК Должность,
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.НижнийПорогОбъемаПродаж КАК НижнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.ВерхнийПорогОбъемаПродаж КАК ВерхнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.ВидБонуса КАК ВидБонуса,
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.ТипПроектнойПродажи КАК ТипПроектнойПродажи,
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.КонтрольныйВидЦен КАК КонтрольныйВидЦен,
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.СегментНоменклатуры КАК СегментНоменклатуры,
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.БонусныйПроцент КАК БонусныйПроцент
	|ПОМЕСТИТЬ втШкалаСНоменклатурой
	|ИЗ
	|	РегистрСведений.ШкалаБонусныхПроцентовОтПроектныхПродаж КАК ШкалаБонусныхПроцентовОтПроектныхПродаж
	|ГДЕ
	|	ШкалаБонусныхПроцентовОтПроектныхПродаж.Период = &ВыбМесяц
	|	И ШкалаБонусныхПроцентовОтПроектныхПродаж.ВидБонуса = &ВидБонусаПроектные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкалаСНоменклатурой.КонтрольныйВидЦен КАК КонтрольныйВидЦен
	|ПОМЕСТИТЬ втКонтрольныеВидыЦен
	|ИЗ
	|	втШкалаСНоменклатурой КАК втШкалаСНоменклатурой
	|
	|СГРУППИРОВАТЬ ПО
	|	втШкалаСНоменклатурой.КонтрольныйВидЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.ЗаказКлиента КАК ДокументЗаказа,
	|	Данные.Регистратор КАК ДокументПродажи,
	|	СУММА(Данные.СуммаВыручкиОборот) КАК Выручка,
	|	СУММА(Данные.КоличествоОборот) КАК КоличествоРеализовано,
	|	Данные.Менеджер КАК Менеджер,
	|	Данные.Подразделение КАК Подразделение,
	|	Данные.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Данные.Склад КАК Склад
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачПериода, МЕСЯЦ, -1), ДЕНЬ), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), Регистратор, НЕ Договор.Контрагент.ИсключитьИзОтчетов {(НЕ Договор.Контрагент.ИсключитьИзОтчетов) КАК Поле2}) КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.ЗаказКлиента,
	|	Данные.Регистратор,
	|	Данные.Менеджер,
	|	Данные.Подразделение,
	|	Данные.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Данные.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка) КАК СуммаВыручки,
	|	втПродажи.Менеджер КАК Менеджер,
	|	втПродажи.Подразделение КАК Подразделение,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКОтгрузкеОбороты.КОтгрузкеРасход
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ) КАК КоличествоОтгружено,
	|	СУММА(втПродажи.КоличествоРеализовано) КАК КоличествоРеализовано,
	|	втКонтрольныеВидыЦен.КонтрольныйВидЦен КАК КонтрольныйВидЦен,
	|	ТоварыКОтгрузкеОбороты.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втОтгрузки
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(&НачПериода, КОНЕЦПЕРИОДА(&КонПериода, ДЕНЬ), Регистратор, ) КАК ТоварыКОтгрузкеОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКОтгрузкеОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКОтгрузкеОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКОтгрузкеОбороты.ДокументОтгрузки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонтрольныеВидыЦен КАК втКонтрольныеВидыЦен
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.РеализацияТоваровУслуг)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	втКонтрольныеВидыЦен.КонтрольныйВидЦен,
	|	ТоварыКОтгрузкеОбороты.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(втПродажи.Выручка),
	|	втПродажи.Менеджер,
	|	втПродажи.Подразделение,
	|	СУММА(ВЫБОР
	|			КОГДА втПродажи.Номенклатура.ТипНоменклатуры <> &ТипНоменклатурыУслуга
	|				ТОГДА ТоварыКПоступлениюОбороты.КОформлениюОрдеровРасход * -1
	|			ИНАЧЕ втПродажи.КоличествоРеализовано
	|		КОНЕЦ),
	|	СУММА(втПродажи.КоличествоРеализовано),
	|	втКонтрольныеВидыЦен.КонтрольныйВидЦен,
	|	ТоварыКПоступлениюОбороты.Номенклатура
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Обороты(&НачПериода, КОНЕЦПЕРИОДА(&КонПериода, ДЕНЬ), Регистратор, ХозяйственнаяОперация = &ХозяйственнаяОперацияВозвратТоваровОтКлиента) КАК ТоварыКПоступлениюОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажи КАК втПродажи
	|		ПО (втПродажи.Номенклатура = ТоварыКПоступлениюОбороты.Номенклатура)
	|			И (втПродажи.Склад = ТоварыКПоступлениюОбороты.Склад)
	|			И (втПродажи.ДокументЗаказа = ТоварыКПоступлениюОбороты.ДокументПоступления.ДокументРеализации.ЗаказКлиента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонтрольныеВидыЦен КАК втКонтрольныеВидыЦен
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(втПродажи.ДокументПродажи) = ТИП(Документ.ВозвратТоваровОтКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Подразделение,
	|	втПродажи.Менеджер,
	|	втКонтрольныеВидыЦен.КонтрольныйВидЦен,
	|	ТоварыКПоступлениюОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОтгрузки.Подразделение КАК Подразделение,
	|	СУММА(втОтгрузки.СуммаВыручки) КАК СуммаВыручки,
	|	втОтгрузки.КонтрольныйВидЦен КАК КонтрольныйВидЦен,
	|	СУММА(втОтгрузки.КоличествоОтгружено * ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) КАК СуммаВыручкиПоВидуЦены,
	|	втОтгрузки.Номенклатура КАК Номенклатура,
	|	втОтгрузки.Менеджер КАК Менеджер
	|ПОМЕСТИТЬ втОтгрузкиПоЦенам
	|ИЗ
	|	втОтгрузки КАК втОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|		ПО втОтгрузки.КонтрольныйВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|			И втОтгрузки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	втОтгрузки.Менеджер,
	|	втОтгрузки.Подразделение,
	|	втОтгрузки.КонтрольныйВидЦен,
	|	втОтгрузки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОтгрузкиПоЦенам.Подразделение КАК Подразделение,
	|	СУММА(втОтгрузкиПоЦенам.СуммаВыручки) КАК СуммаВыручки,
	|	втОтгрузкиПоЦенам.КонтрольныйВидЦен КАК КонтрольныйВидЦен,
	|	СУММА(втОтгрузкиПоЦенам.СуммаВыручкиПоВидуЦены) КАК СуммаВыручкиПоВидуЦены,
	|	втОтгрузкиПоЦенам.Номенклатура КАК Номенклатура,
	|	втОтгрузкиПоЦенам.Менеджер КАК Менеджер,
	|	ВЫБОР
	|		КОГДА втОтгрузкиПоЦенам.СуммаВыручки > втОтгрузкиПоЦенам.СуммаВыручкиПоВидуЦены
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроектнойПродажи.ПродажаВышеКонтрольногоВидаЦены)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПроектнойПродажи.ПродажаНижеКонтрольногоВидаЦены)
	|	КОНЕЦ КАК ТипПроектнойПродажи
	|ПОМЕСТИТЬ втПродажиПоТипамПроектнойПродажи
	|ИЗ
	|	втОтгрузкиПоЦенам КАК втОтгрузкиПоЦенам
	|
	|СГРУППИРОВАТЬ ПО
	|	втОтгрузкиПоЦенам.Подразделение,
	|	втОтгрузкиПоЦенам.КонтрольныйВидЦен,
	|	втОтгрузкиПоЦенам.Номенклатура,
	|	втОтгрузкиПоЦенам.Менеджер,
	|	ВЫБОР
	|		КОГДА втОтгрузкиПоЦенам.СуммаВыручки > втОтгрузкиПоЦенам.СуммаВыручкиПоВидуЦены
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроектнойПродажи.ПродажаВышеКонтрольногоВидаЦены)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПроектнойПродажи.ПродажаНижеКонтрольногоВидаЦены)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажиПоТипамПроектнойПродажи.Подразделение КАК Подразделение,
	|	СУММА(втПродажиПоТипамПроектнойПродажи.СуммаВыручки) КАК СуммаВыручки,
	|	втПродажиПоТипамПроектнойПродажи.КонтрольныйВидЦен КАК КонтрольныйВидЦен,
	|	СУММА(втПродажиПоТипамПроектнойПродажи.СуммаВыручкиПоВидуЦены) КАК СуммаВыручкиПоВидуЦены,
	|	втПродажиПоТипамПроектнойПродажи.Менеджер КАК Менеджер,
	|	втПродажиПоТипамПроектнойПродажи.ТипПроектнойПродажи КАК ТипПроектнойПродажи
	|ПОМЕСТИТЬ втПродажиПоМенеджерам
	|ИЗ
	|	втПродажиПоТипамПроектнойПродажи КАК втПродажиПоТипамПроектнойПродажи
	|ГДЕ
	|	НЕ втПродажиПоТипамПроектнойПродажи.Подразделение ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажиПоТипамПроектнойПродажи.Подразделение,
	|	втПродажиПоТипамПроектнойПродажи.КонтрольныйВидЦен,
	|	втПродажиПоТипамПроектнойПродажи.Менеджер,
	|	втПродажиПоТипамПроектнойПродажи.ТипПроектнойПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажиПоТипамПроектнойПродажи.Подразделение КАК Подразделение,
	|	СУММА(втПродажиПоТипамПроектнойПродажи.СуммаВыручки) КАК СуммаВыручки,
	|	втПродажиПоТипамПроектнойПродажи.КонтрольныйВидЦен КАК КонтрольныйВидЦен,
	|	СУММА(втПродажиПоТипамПроектнойПродажи.СуммаВыручкиПоВидуЦены) КАК СуммаВыручкиПоВидуЦены,
	|	втПродажиПоТипамПроектнойПродажи.Менеджер КАК Менеджер
	|ПОМЕСТИТЬ втПродажиПоМенеджерамОбщ
	|ИЗ
	|	втПродажиПоТипамПроектнойПродажи КАК втПродажиПоТипамПроектнойПродажи
	|ГДЕ
	|	НЕ втПродажиПоТипамПроектнойПродажи.Подразделение ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажиПоТипамПроектнойПродажи.Подразделение,
	|	втПродажиПоТипамПроектнойПродажи.КонтрольныйВидЦен,
	|	втПродажиПоТипамПроектнойПродажи.Менеджер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажиПоТипамПроектнойПродажи.Подразделение КАК Подразделение,
	|	СУММА(втПродажиПоТипамПроектнойПродажи.СуммаВыручки) КАК СуммаВыручки,
	|	втПродажиПоТипамПроектнойПродажи.КонтрольныйВидЦен КАК КонтрольныйВидЦен,
	|	СУММА(втПродажиПоТипамПроектнойПродажи.СуммаВыручкиПоВидуЦены) КАК СуммаВыручкиПоВидуЦены,
	|	втПродажиПоТипамПроектнойПродажи.ТипПроектнойПродажи КАК ТипПроектнойПродажи
	|ПОМЕСТИТЬ втПродажиПоПодразделениям
	|ИЗ
	|	втПродажиПоТипамПроектнойПродажи КАК втПродажиПоТипамПроектнойПродажи
	|ГДЕ
	|	НЕ втПродажиПоТипамПроектнойПродажи.Подразделение ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажиПоТипамПроектнойПродажи.Подразделение,
	|	втПродажиПоТипамПроектнойПродажи.КонтрольныйВидЦен,
	|	втПродажиПоТипамПроектнойПродажи.ТипПроектнойПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажиПоМенеджерам.Подразделение КАК Подразделение,
	|	втПродажиПоМенеджерам.СуммаВыручки КАК СуммаВыручки,
	|	втПродажиПоМенеджерам.КонтрольныйВидЦен КАК КонтрольныйВидЦен,
	|	втПродажиПоМенеджерам.СуммаВыручкиПоВидуЦены КАК СуммаВыручкиПоВидуЦены,
	|	втПродажиПоМенеджерам.ТипПроектнойПродажи КАК ТипПроектнойПродажи,
	|	втПродажиПоМенеджерам.Менеджер КАК Менеджер,
	|	ВЫБОР
	|		КОГДА втПродажиПоПодразделениям.СуммаВыручки > 0
	|			ТОГДА втПродажиПоМенеджерам.СуммаВыручки / втПродажиПоПодразделениям.СуммаВыручки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоляСуммаВыручкиОборот,
	|	втПродажиПоПодразделениям.СуммаВыручки КАК ОбщСуммаВыручкиОборот
	|ПОМЕСТИТЬ втПродажиДоли
	|ИЗ
	|	втПродажиПоМенеджерам КАК втПродажиПоМенеджерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажиПоПодразделениям КАК втПродажиПоПодразделениям
	|		ПО втПродажиПоМенеджерам.Подразделение = втПродажиПоПодразделениям.Подразделение
	|			И втПродажиПоМенеджерам.КонтрольныйВидЦен = втПродажиПоПодразделениям.КонтрольныйВидЦен
	|			И втПродажиПоМенеджерам.ТипПроектнойПродажи = втПродажиПоПодразделениям.ТипПроектнойПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкалаСНоменклатурой.Период КАК Период,
	|	втШкалаСНоменклатурой.Подразделение КАК Подразделение,
	|	втШкалаСНоменклатурой.Должность КАК Должность,
	|	втШкалаСНоменклатурой.НижнийПорогОбъемаПродаж КАК НижнийПорогОбъемаПродаж,
	|	втШкалаСНоменклатурой.ВерхнийПорогОбъемаПродаж КАК ВерхнийПорогОбъемаПродаж,
	|	втШкалаСНоменклатурой.ВидБонуса КАК ВидБонуса,
	|	втШкалаСНоменклатурой.ТипПроектнойПродажи КАК ТипПроектнойПродажи,
	|	втШкалаСНоменклатурой.КонтрольныйВидЦен КАК КонтрольныйВидЦен,
	|	втШкалаСНоменклатурой.СегментНоменклатуры КАК СегментНоменклатуры,
	|	втШкалаСНоменклатурой.БонусныйПроцент КАК БонусныйПроцент,
	|	Пользователи.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ втШкалаБезНоменклатуры
	|ИЗ
	|	втШкалаСНоменклатурой КАК втШкалаСНоменклатурой
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО втШкалаСНоменклатурой.Подразделение = Пользователи.Подразделение
	|			И втШкалаСНоменклатурой.Должность = Пользователи.Должность
	|
	|СГРУППИРОВАТЬ ПО
	|	втШкалаСНоменклатурой.Период,
	|	втШкалаСНоменклатурой.Подразделение,
	|	втШкалаСНоменклатурой.Должность,
	|	втШкалаСНоменклатурой.НижнийПорогОбъемаПродаж,
	|	втШкалаСНоменклатурой.ВерхнийПорогОбъемаПродаж,
	|	втШкалаСНоменклатурой.ВидБонуса,
	|	втШкалаСНоменклатурой.ТипПроектнойПродажи,
	|	втШкалаСНоменклатурой.КонтрольныйВидЦен,
	|	втШкалаСНоменклатурой.СегментНоменклатуры,
	|	втШкалаСНоменклатурой.БонусныйПроцент,
	|	Пользователи.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкалаБезНоменклатуры.Подразделение КАК Подразделение,
	|	втШкалаБезНоменклатуры.БонусныйПроцент КАК БонусныйПроцент,
	|	втШкалаБезНоменклатуры.ВидБонуса КАК ВидБонуса,
	|	втПродажиПоМенеджерамОбщ.СуммаВыручки КАК СуммаВыручки,
	|	втШкалаБезНоменклатуры.ТипПроектнойПродажи КАК ТипПроектнойПродажи,
	|	втШкалаБезНоменклатуры.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ втШкала
	|ИЗ
	|	втШкалаБезНоменклатуры КАК втШкалаБезНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажиПоМенеджерамОбщ КАК втПродажиПоМенеджерамОбщ
	|		ПО втШкалаБезНоменклатуры.Подразделение = втПродажиПоМенеджерамОбщ.Подразделение
	|			И (втПродажиПоМенеджерамОбщ.СуммаВыручки >= втШкалаБезНоменклатуры.НижнийПорогОбъемаПродаж)
	|			И (втПродажиПоМенеджерамОбщ.СуммаВыручки <= втШкалаБезНоменклатуры.ВерхнийПорогОбъемаПродаж)
	|			И втШкалаБезНоменклатуры.Сотрудник = втПродажиПоМенеджерамОбщ.Менеджер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкала.Подразделение КАК Подразделение,
	|	СРЕДНЕЕ(втШкала.БонусныйПроцент) КАК БонусныйПроцент,
	|	втШкала.ВидБонуса КАК ВидБонуса,
	|	СУММА(втПродажиДоли.СуммаВыручки * (втШкала.БонусныйПроцент / 100)) КАК СуммаБонусов,
	|	втШкала.Сотрудник КАК Сотрудник,
	|	СУММА(втПродажиДоли.СуммаВыручки) КАК СуммаВыручки
	|ИЗ
	|	втШкала КАК втШкала
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажиДоли КАК втПродажиДоли
	|		ПО втШкала.Подразделение = втПродажиДоли.Подразделение
	|			И (втПродажиДоли.ТипПроектнойПродажи = втШкала.ТипПроектнойПродажи)
	|			И (втПродажиДоли.Менеджер = втШкала.Сотрудник)
	|ГДЕ
	|	НЕ втШкала.СуммаВыручки ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	втШкала.Подразделение,
	|	втШкала.ВидБонуса,
	|	втШкала.Сотрудник";
	ЗапросПроект.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросПроект.УстановитьПараметр("КонПериода", КонецМесяца(Объект.МесяцРасчета));
	ЗапросПроект.УстановитьПараметр("ВыбМесяц", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросПроект.УстановитьПараметр("ВидБонусаПроектные", Перечисления.ВидыБонусов.Проектные);
	ЗапросПроект.УстановитьПараметр("ХозяйственнаяОперацияВозвратТоваровОтКлиента", Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
	ЗапросПроект.УстановитьПараметр("ТипНоменклатурыУслуга", Перечисления.ТипыНоменклатуры.Услуга); 

    тзБонусыПроект = ЗапросПроект.Выполнить().Выгрузить();
	
	Для каждого стр из тзБонусыПроект цикл
		НоваяСтрока = Объект.Расчеты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
	КонецЦикла;
	
	
	//рассчитываем партнерские
	ЗапросПартнерские = Новый Запрос;
	ЗапросПартнерские.Текст=
	"ВЫБРАТЬ
	|	РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	СУММА(РасчетыСКлиентамиОбороты.СуммаРасход) КАК СуммаРасход
	|ПОМЕСТИТЬ втПоступленияДС
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(&НачПериода, &КонПериода, , ) КАК РасчетыСКлиентамиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам.Партнер,
	|	РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоступленияДС.Партнер КАК Партнер,
	|	втПоступленияДС.Договор КАК Договор,
	|	СУММА(втПоступленияДС.СуммаРасход) КАК СуммаРасход,
	|	СоответствиеПартнеровИПодразделений.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ втПоступлениеСПодразделениями
	|ИЗ
	|	втПоступленияДС КАК втПоступленияДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПартнеровИПодразделений КАК СоответствиеПартнеровИПодразделений
	|		ПО втПоступленияДС.Партнер = СоответствиеПартнеровИПодразделений.Партнер
	|			И втПоступленияДС.Договор = СоответствиеПартнеровИПодразделений.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	втПоступленияДС.Партнер,
	|	втПоступленияДС.Договор,
	|	СоответствиеПартнеровИПодразделений.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШкалаБонусныхПроцентовОтПродаж.Период КАК Период,
	|	ШкалаБонусныхПроцентовОтПродаж.Подразделение КАК Подразделение,
	|	ШкалаБонусныхПроцентовОтПродаж.Должность КАК Должность,
	|	ШкалаБонусныхПроцентовОтПродаж.НижнийПорогОбъемаПродаж КАК НижнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВерхнийПорогОбъемаПродаж КАК ВерхнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВидБонуса КАК ВидБонуса,
	|	ШкалаБонусныхПроцентовОтПродаж.ПроцентОтОбщихБонусов КАК ПроцентОтОбщихБонусов,
	|	ШкалаБонусныхПроцентовОтПродаж.БонусныйПроцент КАК БонусныйПроцент,
	|	Пользователи.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ втШкала
	|ИЗ
	|	РегистрСведений.ШкалаБонусныхПроцентовОтПродаж КАК ШкалаБонусныхПроцентовОтПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ШкалаБонусныхПроцентовОтПродаж.Подразделение = Пользователи.Подразделение
	|			И ШкалаБонусныхПроцентовОтПродаж.Должность = Пользователи.Должность
	|ГДЕ
	|	ШкалаБонусныхПроцентовОтПродаж.Период = &ВыбМесяц
	|	И ШкалаБонусныхПроцентовОтПродаж.ВидБонуса = &ВидБонусаПартнерские
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШкала.Период КАК Период,
	|	втШкала.Подразделение КАК Подразделение,
	|	втШкала.Должность КАК Должность,
	|	втШкала.ВидБонуса КАК ВидБонуса,
	|	втШкала.БонусныйПроцент КАК БонусныйПроцент,
	|	втШкала.Сотрудник КАК Сотрудник,
	|	втПоступлениеСПодразделениями.СуммаРасход * (втШкала.БонусныйПроцент / 100) КАК СуммаБонусов,
	|	втПоступлениеСПодразделениями.СуммаРасход КАК СуммаВыручки
	|ИЗ
	|	втШкала КАК втШкала
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПоступлениеСПодразделениями КАК втПоступлениеСПодразделениями
	|		ПО втШкала.Подразделение = втПоступлениеСПодразделениями.Подразделение
	|			И (втПоступлениеСПодразделениями.СуммаРасход >= втШкала.НижнийПорогОбъемаПродаж)
	|			И (втПоступлениеСПодразделениями.СуммаРасход <= втШкала.ВерхнийПорогОбъемаПродаж)";
	ЗапросПартнерские.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросПартнерские.УстановитьПараметр("КонПериода", КонецМесяца(Объект.МесяцРасчета));
	ЗапросПартнерские.УстановитьПараметр("ВыбМесяц", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросПартнерские.УстановитьПараметр("ВидБонусаПартнерские", Перечисления.ВидыБонусов.Партнерские);

    тзБонусыПартнерские = ЗапросПартнерские.Выполнить().Выгрузить();
	
	Для каждого стр из тзБонусыПартнерские цикл
		НоваяСтрока = Объект.Расчеты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
	КонецЦикла; 	
	
	//рассчитываем партнерские групповые
    ЗапросПартнерскиеГрупповые = Новый Запрос;
	ЗапросПартнерскиеГрупповые.Текст =
	"ВЫБРАТЬ
	|	РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	СУММА(РасчетыСКлиентамиОбороты.СуммаРасход) КАК СуммаРасход,
	|	РасчетыСКлиентамиОбороты.Период КАК Период
	|ПОМЕСТИТЬ втПоступленияДС
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(&НачПериода, &КонПериода, Месяц, ) КАК РасчетыСКлиентамиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам.Партнер,
	|	РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам.Договор,
	|	РасчетыСКлиентамиОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоступленияДС.Партнер КАК Партнер,
	|	втПоступленияДС.Договор КАК Договор,
	|	СУММА(втПоступленияДС.СуммаРасход) КАК СуммаРасход,
	|	СоответствиеПартнеровИПодразделений.Подразделение КАК Подразделение,
	|	втПоступленияДС.Период КАК Период
	|ПОМЕСТИТЬ втПоступлениеСПодразделениями
	|ИЗ
	|	втПоступленияДС КАК втПоступленияДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПартнеровИПодразделений КАК СоответствиеПартнеровИПодразделений
	|		ПО втПоступленияДС.Партнер = СоответствиеПартнеровИПодразделений.Партнер
	|			И втПоступленияДС.Договор = СоответствиеПартнеровИПодразделений.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	втПоступленияДС.Партнер,
	|	втПоступленияДС.Договор,
	|	СоответствиеПартнеровИПодразделений.Подразделение,
	|	втПоступленияДС.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШкалаБонусныхПроцентовОтПродаж.Период КАК Период,
	|	ШкалаБонусныхПроцентовОтПродаж.БонусныйПроцент КАК БонусныйПроцент,
	|	Пользователи.Ссылка КАК Сотрудник,
	|	ШкалаБонусныхПроцентовОтПродаж.Подразделение КАК Подразделение,
	|	ШкалаБонусныхПроцентовОтПродаж.НижнийПорогОбъемаПродаж КАК НижнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВерхнийПорогОбъемаПродаж КАК ВерхнийПорогОбъемаПродаж,
	|	ШкалаБонусныхПроцентовОтПродаж.ВидБонуса КАК ВидБонуса,
	|	ШкалаБонусныхПроцентовОтПродаж.Должность КАК Должность
	|ПОМЕСТИТЬ втПред
	|ИЗ
	|	РегистрСведений.ШкалаБонусныхПроцентовОтПродаж КАК ШкалаБонусныхПроцентовОтПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ШкалаБонусныхПроцентовОтПродаж.Должность = Пользователи.Должность
	|ГДЕ
	|	ШкалаБонусныхПроцентовОтПродаж.Период = &ВыбМесяц
	|	И ШкалаБонусныхПроцентовОтПродаж.ВидБонуса = &ВидБонусаПартнерскиеГрупповые
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПред.Период КАК Период,
	|	втПред.БонусныйПроцент КАК БонусныйПроцент,
	|	втПред.Сотрудник КАК Сотрудник,
	|	втПред.Подразделение КАК Подразделение,
	|	втПред.ВидБонуса КАК ВидБонуса,
	|	СУММА(втПоступлениеСПодразделениями.СуммаРасход) КАК СуммаВыручки,
	|	СУММА(втПоступлениеСПодразделениями.СуммаРасход * (втПред.БонусныйПроцент / 100)) КАК СуммаБонусов
	|ИЗ
	|	втПред КАК втПред
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПоступлениеСПодразделениями КАК втПоступлениеСПодразделениями
	|		ПО втПред.Подразделение = втПоступлениеСПодразделениями.Подразделение
	|			И втПред.НижнийПорогОбъемаПродаж <= втПоступлениеСПодразделениями.СуммаРасход
	|			И втПред.ВерхнийПорогОбъемаПродаж >= втПоступлениеСПодразделениями.СуммаРасход
	|			И втПред.Период = втПоступлениеСПодразделениями.Период
	|ГДЕ
	|	НЕ втПред.Сотрудник ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	втПред.Период,
	|	втПред.Подразделение,
	|	втПред.Сотрудник,
	|	втПред.БонусныйПроцент,
	|	втПред.ВидБонуса";
	ЗапросПартнерскиеГрупповые.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросПартнерскиеГрупповые.УстановитьПараметр("КонПериода", КонецМесяца(Объект.МесяцРасчета));
	ЗапросПартнерскиеГрупповые.УстановитьПараметр("ВыбМесяц", НачалоМесяца(Объект.МесяцРасчета));
	ЗапросПартнерскиеГрупповые.УстановитьПараметр("ВидБонусаПартнерскиеГрупповые", Перечисления.ВидыБонусов.ПартнерскиеГрупповые);
	
	тзБонусыПартнерскиеГрупповые = ЗапросПартнерскиеГрупповые.Выполнить().Выгрузить();
	
	Для каждого стр из тзБонусыПартнерскиеГрупповые цикл
		Если стр.Подразделение.ПринадлежитЭлементу(стр.Сотрудник.Подразделение) или стр.Подразделение = стр.Сотрудник.Подразделение тогда
			НоваяСтрока = Объект.Расчеты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
		КонецЕсли;
	КонецЦикла; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать()
	
	Если Объект.Расчеты.Количество()>0 тогда
		ДиалогСВопросом();
	Иначе
		РассчитатьНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогСВопросом()
 
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Табличная часть расчетов будет очищена. Продолжить?",
        РежимДиалогаВопрос.ДаНетОтмена,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        "Хороший вопрос" // (необ.) заголовок
    );    
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        РассчитатьНаСервере();
    КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура МесяцРасчетаПриИзменении(Элемент)
	
	Объект.Расчеты.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() и Объект.Выплачено тогда
		
		Этаформа.Доступность = Ложь;
			
	КонецЕсли; 	
	
КонецПроцедуры
