
#Область СлужебныйПрограммныйИнтерфейс

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст        - УправляемаяФорма, ДокументСсылка - Контекст для определения типа документа
//  ЭтоПриобретение - Булево - исходящий признак соответствия документа типу «Приобретение товаров и услуг».
Процедура ЭтоДокументПриобретения(Контекст, ЭтоПриобретение) Экспорт
	
	//++ НЕ ГОСИС
	ЭтоПриобретение = ИСМПТВыбытиеКодовМаркировкиКлиентСервер.ИнтеграцияИСУТКлиентСервер_ЭтоДокументПоНаименованию(Контекст, "ПриобретениеТоваровУслуг")
		Или ИСМПТВыбытиеКодовМаркировкиКлиентСервер.ИнтеграцияИСУТКлиентСервер_ЭтоДокументПоНаименованию(Контекст, "ВозвратТоваровОтКлиента");
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст - УправляемаяФорма, ДокументСсылка - Контекст для определения типа документа
//  ЭтоЧек   - Булево - исходящий признак соответствия документа типу «Чек ККМ».
Процедура ЭтоЧекККМ(Контекст, ЭтоЧек) Экспорт
	
	//++ НЕ ГОСИС
	ЭтоЧек = ИСМПТВыбытиеКодовМаркировкиКлиентСервер.ИнтеграцияИСУТКлиентСервер_ЭтоДокументПоНаименованию(Контекст, "ЧекККМ");
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст      - УправляемаяФорма, ДокументСсылка - Контекст для определения типа документа
//  ЭтоЧекВозврат - Булево - исходящий признак соответствия документа типу «Чек ККМ возврат».
Процедура ЭтоЧекККМВозврат(Контекст, ЭтоЧекВозврат) Экспорт
	
	//++ НЕ ГОСИС
	ЭтоЧекВозврат = ИСМПТВыбытиеКодовМаркировкиКлиентСервер.ИнтеграцияИСУТКлиентСервер_ЭтоДокументПоНаименованию(Контекст, "ЧекККМВозврат");
	//-- НЕ ГОСИС
	
КонецПроцедуры

#Область СерииНоменклатуры

// Возвращает через параметр коды статусов указания серий, соответствующих не заполненным сериям.
//
// Параметры:
//  СтатусыСерияНеУказана - Массив - Исходящий, значения статусов, соответствующих не заполненным сериям.
Процедура СтатусыСерийСерияНеУказана(СтатусыСерияНеУказана) Экспорт
	
	//++ НЕ ГОСИС
	СтатусыСерияНеУказана = НоменклатураКлиентСервер.СтатусыСерийСерияНеУказана();
	//-- НЕ ГОСИС
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти