
#Область ПрограммныйИнтерфейс

Процедура ОтключенныйФункционалПередЗаписьюКонстантыПередЗаписью(Источник, Отказ) Экспорт
	
	Если Метаданные.ФункциональныеОпции.ОтключенныйФункционал.Состав.Содержит(Источник.Метаданные()) Тогда
		Источник.Значение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтключенныйФункционалПередЗаписьюРегистраСведенийПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	МетаданныеРегистра = Источник.Метаданные();
	СоставФункциональнойОпции = Метаданные.ФункциональныеОпции.ОтключенныйФункционал.Состав;
	
	Если СоставФункциональнойОпции.Содержит(МетаданныеРегистра) Тогда
		
		Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
			Если ТипЗнч(Ресурс.Тип)<> Тип("ОписаниеТипов")
				И Тип(Ресурс.Тип) = Тип("Булево") Тогда
				Для Каждого ЗаписьНабора Из Источник Цикл
					ЗаписьНабора[Ресурс.Имя] = Ложь;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
			Если ТипЗнч(Ресурс.Тип)<> Тип("ОписаниеТипов")
				И Тип(Ресурс.Тип) = Тип("Булево")
				И СоставФункциональнойОпции.Содержит(Ресурс) Тогда
				Для Каждого ЗаписьНабора Из Источник Цикл
					ЗаписьНабора[Ресурс.Имя] = Ложь;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
