#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//{{MRG[ <-> ]
// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//// Возвращает реквизиты объекта, которые разрешается редактировать
//// с помощью обработки группового изменения реквизитов.
//}}MRG[ <-> ]
//
//{{MRG[ <-> ]
//// Возвращаемое значение:
////  Массив - список имен реквизитов объекта.
//}}MRG[ <-> ]
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Возврат ПрисоединенныеФайлы.РеквизитыРедактируемыеВГрупповойОбработке();
	
КонецФункции

#КонецОбласти

#КонецЕсли
