
&НаСервере
Функция СоздатьНаСервере()
	
	НомерСчета = СокрЛП(Объект.НомерКарты);
	ВидНО = Справочники.bon_ВидыНоминальныхОбъектов.БонусныеСчета;
	
	///Проверка чтобы были только "Цифры"
	Цифры = "0123456789";
	СтрКоличество = СтрДлина(НомерСчета);
	Для Счетчик = 1 По СтрКоличество Цикл
		Если Найти(Цифры,Сред(НомерСчета,Счетчик,1)) = 0 Тогда
			Сообщить("Некорректный номер!");
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	///Проверка на первую цыфору чтобы бала "7"
	Если Число(Сред(НомерСчета,1,1)) <> 7 Тогда
		Сообщить("Некорректный номер!");
		Возврат Ложь;	
	КонецЕсли;
	
	Если СтрДлина(НомерСчета) <> 10 Тогда
		Сообщить("Некорректный номер!");
		Возврат Ложь;
	КонецЕсли;
	
	Если ВРег(НомерСчета) <> НомерСчета Тогда
		Сообщить("Некорректный номер!");
		Возврат Ложь;
	КонецЕсли;
	
	////////////////////////////Проверяем есть ли бонусный на номере
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	bon_ТелефоныНомОбъектов.bon_НоминальныеОбъекты КАК bon_НоминальныеОбъекты
	 |ИЗ
	 |	РегистрСведений.bon_ТелефоныНомОбъектов КАК bon_ТелефоныНомОбъектов
	 |ГДЕ
	 |	bon_ТелефоныНомОбъектов.Сотовый = &Сотовый
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	bon_ТелефоныНомОбъектов.bon_НоминальныеОбъекты";
	Запрос.УстановитьПараметр("Сотовый", НомерСчета);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество() > 0 Тогда
		Сообщить("Счет с данным номером уже существует!");
		Возврат Ложь;	
	КонецЕсли;
	
	докВводВОборот = Документы.bon_ВводВОборотНоминальныхОбъектов.СоздатьДокумент();
	докВводВОборот.Дата = НачалоДня(ТекущаяДата()); 
	докВводВОборот.УстановитьНовыйНомер();
	
	докВводВОборот.ВидНоминальныхОбъектов = ВидНО;
	докВводВОборот.Комментарий = "Создание бонусного счета в магазине";
	//докВводВОборот.Подразделение = ЭтотОбъект.мчт_Подразделение; 
	
	//Если докВводВОборот.Подразделение.Пустая() Тогда 
	//	докВводВОборот.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации"); //Лисевцев 15/05/2018	
	//КонецЕсли;
	
	стрТЧ = докВводВОборот.НоминальныеОбъекты.Добавить();
	стрТЧ.Номер = НомерСчета;
	
	Попытка
		докВводВОборот.Записать(РежимЗаписиДокумента.Проведение);		
	Исключение
		Сообщить("Не удалось создать ввод в оборот !
		| Сообщите Администратору ! Попробуйте еще раз !");
		Возврат Ложь;
	КонецПопытки;
	//НО = Справочники.ма_НоминальныеОбъекты.НайтиПоКоду(НомерСчета);						
	//ОбработкаВводаНоминальногоОбъекта(НО, ВидНО);
	РежимТолькоНакопления = Истина;
	ВладелецНакопительнойКарты = Справочники.Контрагенты.ПустаяСсылка();
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура Создать(Команда)
	Если СоздатьНаСервере() Тогда
		Закрыть();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаВводаНоминальногоОбъекта(НоминальныйОбъект, ВидНоминальногоОбъекта, РезультатОбработки = "", ВидБон = Неопределено)
	
	bon_БонуснаяПрограммаСервер.ОбработкаВводаНоминальногоОбъекта(ЭтотОбъект, НоминальныйОбъект, ВидНоминальногоОбъекта, РезультатОбработки);
		
	//ОбновлениеОтображения();
	
КонецПроцедуры // ОбработкаВводаНоминальногоОбъекта()

