#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	ПереченьИнструкций = ПолучитьМакет("ПереченьИнструкций").ПолучитьТекст();
	ТаблицаИнструкций = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ПереченьИнструкций).Данные;
	
	Для каждого СтрокаТаблицы Из ТаблицаИнструкций Цикл
		ЭлементСправочника = НайтиПоКоду(СтрокаТаблицы.Код);
		Если Не ЗначениеЗаполнено(ЭлементСправочника) Тогда
			НовыйЭлемент = СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтрокаТаблицы);
			НовыйЭлемент.Описание = СтрокаТаблицы.Наименование;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Справочник.ИнструкцииБанку";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	Справочник.ИнструкцииБанку
	|";
	
	Если Запрос.Выполнить().Пустой() Тогда
	
		НачатьТранзакцию();
		
		Попытка
			
			ЗаполнитьПредопределенныеЭлементы();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать %ИмяОбъекта%: по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяОбъекта%", ПолноеИмяОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеОбъекта,,
				ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли