
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Счета.Параметры.УстановитьЗначениеПараметра("bon_НоминальныеОбъектыСыл",  Объект.Ссылка);
	
	ОборотыПоПартиям.Параметры.УстановитьЗначениеПараметра("Ссылка",  Объект.Ссылка);
	ОборотыПоПартиям.Параметры.УстановитьЗначениеПараметра("ППериодОборК",  КонецДня(ТекущаяДата())); 
	ОборотыПоПартиям.Параметры.УстановитьЗначениеПараметра("ППериодОборН",  '00010101');
	
	ОстаткиПоПартиям.Параметры.УстановитьЗначениеПараметра("Ссылка",  Объект.Ссылка);
	ОстаткиПоПартиям.Параметры.УстановитьЗначениеПараметра("ППериод",  Дата(ТекущаяДата())); 
	
	ОбновитьИтогиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиНаСервере()
	
	ПолучИтог = Новый Запрос;
	ПолучИтог.Текст = 
	"ВЫБРАТЬ
	|	bon_ПартииБонусовНаСчетахОстаткиИОбороты.БуферПриход - bon_ПартииБонусовНаСчетахОстаткиИОбороты.БуферРасход КАК Буфер,
	|	bon_ПартииБонусовНаСчетахОстаткиИОбороты.ОстатокПриход - bon_ПартииБонусовНаСчетахОстаткиИОбороты.ОстатокРасход КАК Остаток
	|ИЗ
	|	РегистрНакопления.bon_ПартииБонусовНаСчетах.ОстаткиИОбороты(, &ТекДат, , , НоминальныйОбъект = &НоминальныйОбъект) КАК bon_ПартииБонусовНаСчетахОстаткиИОбороты";
	ПолучИтог.УстановитьПараметр("НоминальныйОбъект"	, Объект.Ссылка);
	ПолучИтог.УстановитьПараметр("ТекДат"				, Дата(ТекущаяДата()));
	УстанЗнач = ПолучИтог.Выполнить().Выгрузить();
	Если УстанЗнач.Количество()>0 Тогда
		Объект.ОстатокБуф = УстанЗнач[0].Буфер;	
		Объект.ОстатокОст =	УстанЗнач[0].Остаток;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги(Команда)
	ОбновитьИтогиНаСервере();
КонецПроцедуры
