
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если Объект.Ссылка.Пустая() Тогда	
	//	// получим список доступных видов номинальных объектов по пользователю или его группе
	//	СписокВыбора = ма_ОбщегоНазначения.ПолучитьДоступныеВидыНоминальныхОбъектов(глТекущийПользователь);
	//	РезультатВыбора = СписокВыбора.ВыбратьЭлемент("Выберите вид номинальных объектов");
	//	
	//	Если РезультатВыбора = Неопределено Тогда	
	//		Отказ = Истина;
	//		Возврат;	
	//	Иначе		
	//		Объект.ВидНоминальныхОбъектов = РезультатВыбора.Значение;	
	//	КонецЕсли; 
	//КонецЕсли;
	
	текВидНомера = ПолучитьТекущийВидНомера();
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
//// ФУНКЦИИ ВЗАИМОДЕЙСТВИЯ С ТОРГОВЫМ ОБОРУДОВАНИЕМ (ОБЩИЕ ФУНКЦИИ API)

&НаСервере
Функция ПоддерживаетсяВидТО(Вид) Экспорт

	Результат = Ложь;

	Если Вид = Перечисления.ВидыТорговогоОборудования.СканерШтрихКода
	 Или Вид = Перечисления.ВидыТорговогоОборудования.СчитывательМагнитныхКарт Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;

КонецФункции // ПоддерживаетсяВидТО()

///////////////////////////////////////////////////////////////////////////////
//// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

&НаСервере
Функция ПолучитьТекущийВидНомера()
	
	//Возврат Объект.ВидНоминальныхОбъектов.ВидНомера;
	
КонецФункции
 
&НаСервере
Функция ОбработкаВводаНомера(НовыйНомер, НомерСтроки = Неопределено)
	
	РезультатОбработки = "";
	
	// проверим на совпадение с уже введенными номерами
	Для каждого стрТЧ Из Объект.НоминальныеОбъекты Цикл
		Если стрТЧ.Номер = НовыйНомер Тогда	
			РезультатОбработки = "Номер <" + НовыйНомер + "> уже введен в документ!";
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Если РезультатОбработки <> "" Тогда
		Возврат РезультатОбработки;	
	КонецЕсли;
	
	СведенияОбОбъекте = bon_БонуснаяПрограммаСервер.ПолучитьСведенияОНоминальномОбъекте(НовыйНомер, ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Дата));
	
	Если ЗначениеЗаполнено(СведенияОбОбъекте.НоминальныйОбъект) Тогда	
		Если НомерСтроки <> Неопределено Тогда
			нстрТЧ = Объект.НоминальныеОбъекты[НомерСтроки];
		Иначе
			нстрТЧ = Объект.НоминальныеОбъекты.Добавить();
		КонецЕсли; 
		нстрТЧ.Номер = НовыйНомер;
		нстрТЧ.НоминальныйОбъект = СведенияОбОбъекте.НоминальныйОбъект;
	Иначе
		РезультатОбработки = "Номинальный объект с номером <" + НовыйНомер + "> не найден!";	
	КонецЕсли;
			
	Возврат РезультатОбработки;
	
КонецФункции


&НаКлиенте
Процедура НоминальныеОбъектыНомерПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура НоминальныеОбъектыНомерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ОбработкаВводаНомера(Текст, Элементы.НоминальныеОбъекты.ТекущаяСтрока);
КонецПроцедуры
 