
&НаСервере
Функция СтартНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	
    НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Подразделение КАК Подразделение,
		|	ЗаказКлиента.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ЗаказКлиента.Дата КАК Дата,
		|	ЗаказКлиента.Партнер КАК Партнер,
		|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Заказ
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Дата МЕЖДУ &ДатанНачало И &ДатаКонец
		|	И ЗаказКлиента.ПодарочныйСертификат <> &ПодарочныйСертификат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияПодарочныхСертификатовСрезПоследних.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ИсторияПодарочныхСертификатовСрезПоследних.Статус КАК Статус
		|ПОМЕСТИТЬ ВТ_Статус
		|ИЗ
		|	РегистрСведений.ИсторияПодарочныхСертификатов.СрезПоследних(&ДатаКонец, ) КАК ИсторияПодарочныхСертификатовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Вид КАК Вид,
		|	ПартнерыКонтактнаяИнформация.Тип КАК Тип,
		|	ПартнерыКонтактнаяИнформация.Представление КАК Представление,
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Контакты
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Тип = &Тип
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказ.Подразделение КАК Подразделение,
		|	ВТ_Заказ.Дата КАК Дата,
		|	ВТ_Заказ.Партнер КАК Партнер,
		|	ВТ_Заказ.СуммаДокумента КАК СуммаДокумента,
		|	ВТ_Заказ.Ссылка КАК Ссылка,
		|	ВТ_Контакты.Представление КАК Представление,
		|	ВТ_Статус.Статус КАК Статус,
		|	ВТ_Заказ.ПодарочныйСертификат КАК ПодарочныйСертификат
		|ИЗ
		|	ВТ_Заказ КАК ВТ_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Статус КАК ВТ_Статус
		|		ПО ВТ_Заказ.Ссылка = ВТ_Статус.ПодарочныйСертификат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Контакты КАК ВТ_Контакты
		|		ПО ВТ_Заказ.Партнер = ВТ_Контакты.Ссылка";
	
	Запрос.УстановитьПараметр("ДатаКонец", ДатаКонец);
	Запрос.УстановитьПараметр("ДатанНачало", ДатаНачала);
	Запрос.УстановитьПараметр("ПодарочныйСертификат", Справочники.ПодарочныеСертификаты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	                                                
	Обработка 	= РеквизитФормыВЗначение("Отчет");
	Макет  		= Обработка.ПолучитьМакет("Макет"); 
	Шапка  		= Макет.ПолучитьОбласть("Шапка");
	Строка 		= Макет.ПолучитьОбласть("Строка");
	Подвал 		= Макет.ПолучитьОбласть("Подвал");
	
	Шапка.Параметры.ДатаНачала = Формат(ДатаНачала, "ДФ=dd.MM.yyyy");
	Шапка.Параметры.ДатаКонец  = Формат(ДатаКонец, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(Шапка);
	
	н = 1;
	Итого = 0;
	Пока Выборка.Следующий() Цикл
		Строка.Параметры.н = н;
		Строка.Параметры.Подразделение 	= Выборка.Подразделение;
		Строка.Параметры.Сертификат 	= Выборка.ПодарочныйСертификат;
		Строка.Параметры.Дата 			= Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		Строка.Параметры.Статус 		= ?(Выборка.СуммаДокумента > 0, "Полностью погашен", "Аннулировано");
		Строка.Параметры.ФИО 			= Выборка.Партнер;
		Строка.Параметры.Телефон 		= Выборка.Представление;
		Строка.Параметры.Сумма 			= Выборка.СуммаДокумента; 
		ТабДок.Вывести(Строка);
		Итого = Итого + Выборка.СуммаДокумента;
		н = н + 1;
	КонецЦикла;

	Подвал.Параметры.Итого = Итого;
	ТабДок.Вывести(Подвал);
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура Старт(Команда)
	               
	ТабДок = СтартНаСервере();
	ТабДок.Показать();
	
КонецПроцедуры
