
Процедура ПередЗаписью(Отказ, Замещение)
	Если не Замещение тогда
		Для Каждого ТекЗапись Из ЭтотОбъект Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	bon_НастройкаБонусов.ХарактеристикаБонусов
			|ИЗ
			|	РегистрСведений.bon_НастройкаБонусов КАК bon_НастройкаБонусов
			|ГДЕ
			|	bon_НастройкаБонусов.Подразделение = &Подразделение
			|	И bon_НастройкаБонусов.ДатаНач <= &ДатаНач
			|	И bon_НастройкаБонусов.ДатаКон >= &ДатаКон
			|	И bon_НастройкаБонусов.Активен = ИСТИНА";
			
			Запрос.УстановитьПараметр("Подразделение", ТекЗапись.Подразделение);
			Запрос.УстановитьПараметр("ДатаНач", ТекЗапись.ДатаНач);
			Запрос.УстановитьПараметр("ДатаКон", ТекЗапись.ДатаНач);
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() > 0 тогда
				Сообщить("Запись с такими параметрами уже сущевствует!");
				Отказ = Истина;
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
