
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	// проверка на запрет повторного ввода в оборот
	мОбъектыКПроверке = Новый Массив;
	
	Для каждого СтрокаЗаписи Из ЭтотОбъект Цикл
		
		Если СтрокаЗаписи.Статус = Перечисления.bon_СтатусыНоминальныхОбъектов.ВыведенИзОборота Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СтрокаЗаписи.НоминальныйОбъект.Владелец.НакапливаемыйНоминал ИЛИ СтрокаЗаписи.НоминальныйОбъект.Владелец.Многоразовый Тогда
			Продолжить;	
		КонецЕсли;
		
		мОбъектыКПроверке.Добавить(СтрокаЗаписи.НоминальныйОбъект); 
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	bon_СостоянияНоминальныхОбъектов.Номер КАК Номер,
		|	bon_СостоянияНоминальныхОбъектов.НоминальныйОбъект КАК НоминальныйОбъект
		|ИЗ
		|	РегистрСведений.bon_СостоянияНоминальныхОбъектов КАК bon_СостоянияНоминальныхОбъектов
		|ГДЕ
		|	bon_СостоянияНоминальныхОбъектов.Статус = &СтатусВводаВОборот
		|	И bon_СостоянияНоминальныхОбъектов.Номер В(&мОбъектыКПроверке)
		|	И bon_СостоянияНоминальныхОбъектов.НоминальныйОбъект В(&мОбъектыКПроверке)
		|	И bon_СостоянияНоминальныхОбъектов.Регистратор <> &ТекущийДокумент";

	Запрос.УстановитьПараметр("мОбъектыКПроверке", мОбъектыКПроверке);
	Запрос.УстановитьПараметр("СтатусВводаВОборот", Перечисления.bon_СтатусыНоминальныхОбъектов.ВведенВОборот);
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Отбор.Регистратор.Значение);

	РезультатПроверки = Запрос.Выполнить().Выбрать();

	Если РезультатПроверки.Количество() <> 0 Тогда
		Отказ = Истина;	
	КонецЕсли;  	
	
КонецПроцедуры
