////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСведенияОДатеАктуализации();
	
	Если Параметры.Свойство("ПризнакУчетаНаВиртуальномСкладе") Тогда
		ЭСФКлиентСерверПереопределяемый.УстановитьЭлементОтбора(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"ПризнакУчетаНаВиртуальномСкладе",
		Параметры.ПризнакУчетаНаВиртуальномСкладе, 
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	КонецЕсли;

	Если Параметры.Свойство("КодГСВС") Тогда
		ЭСФКлиентСерверПереопределяемый.УстановитьЭлементОтбора(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"КодГСВС",
		Параметры.КодГСВС, 
		ВидСравненияКомпоновкиДанных.Содержит,
		,
		Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("КодГСВСРодителя") Тогда
		ЭСФКлиентСерверПереопределяемый.УстановитьЭлементОтбора(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"Родитель.КодГСВС",
		Параметры.КодГСВСРодителя, 
		ВидСравненияКомпоновкиДанных.Содержит,
		,
		Истина);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КлючУникальности = Новый УникальныйИдентификатор;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВС_ПроверятьОповещенияФоновогоЗадания"
		И ЭтаФорма.КлючУникальности = Источник Тогда
		
		ВСКлиентПереопределяемый.ОбработкаОповещенияВС_ПроверятьОповещенияФоновогоЗадания(ЭтаФорма, Параметр);
		
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТехническаяИнформацияОбОбновленииНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СобытиеЖурналаРегистрации", "ОбменЭСФ.ЗагрузитьСправочникГСВС");	

	ВСКлиентПереопределяемый.ОткрытьФормуЖурналаРегистрации(ПараметрыФормы);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьСведенияОДатеАктуализации()
	ПараметрыМетодаСинхронизации = ЭСФСервер.ПолучитьПараметрыМетода(Неопределено, ВРег("gsvsUpdates"), Неопределено);	
	Если ПараметрыМетодаСинхронизации.Свойство("lastUpdateDate") и ЗначениеЗаполнено(ПараметрыМетодаСинхронизации.lastUpdateDate) Тогда
		ДатаАктуализации = ПараметрыМетодаСинхронизации.lastUpdateDate
	Иначе
		ДатаАктуализации = Неопределено;
	КонецЕсли;	
КонецПроцедуры

