
&НаКлиенте
Процедура ОбновитьВидимость()

	Элементы.Код.Доступность = РольДост();
	Элементы.УслугаДляПродажи.Доступность = РольДост();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РольДост()
    Возврат РольДоступна("bon_Admin");
КонецФункции


&НаКлиенте
Процедура ВидКодаПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

