#Область ПроцедурыИФункцииВыгрузки

//Приводит значение к нужному формату для выгрузки в формате XML
//
Функция ПривестиЗначениеКФорматуСОНО(Значение, ВыгружатьНулевыеЗначения = Ложь) Экспорт
	
	Если Врег(Значение) = "Х" ИЛИ Врег(Значение) = "X" Тогда
		Значение = Истина;
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		Если Значение = Дата('00010101') Тогда
			Значение = "";
		Иначе
			Значение = Лев(Значение,10);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") И Значение = 0 И НЕ ВыгружатьНулевыеЗначения Тогда
		Значение = "";
	ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений") Тогда    
    	МассивЗначение = Значение.ВыгрузитьЗначения();
       	Значение = СтрСоединить(МассивЗначение, ";");
	ИначеЕсли Значение = Неопределено И ВыгружатьНулевыеЗначения Тогда
		Значение = 0;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции


#КонецОбласти
