
Функция ПолучитьТаблицуЗаменыСсылок() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ТипСсылки");
	Результат.Колонки.Добавить("ПравильнаяСсылка");
	Результат.Колонки.Добавить("НеправильнаяСсылка");
	МассивСсылок = swУдалениеДублей.ПолучитьМассивЗаменыСсылок();
	Для Каждого Элемент Из МассивСсылок Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ТипСсылки = Элемент[0];
		НоваяСтрока.ПравильнаяСсылка = Элемент[1];
		НоваяСтрока.НеправильнаяСсылка = Элемент[2];
	КонецЦикла;
	Результат.Свернуть("ТипСсылки,ПравильнаяСсылка,НеправильнаяСсылка");
	Возврат Результат;
КонецФункции
