
&НаКлиенте
Процедура ПомощникПолучитьВСКонтрагента(Команда)
	
	КонтрагентОтбора = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	Для каждого ЭлементНастройки Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		//Использвание - для того чтоб не передавалось значение если галочка не установлена
		Если ТипЗнч(ЭлементНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементНастройки.Использование Тогда
			Если ТипЗнч(ЭлементНастройки.ПравоеЗначение) = Тип("СправочникСсылка.Контрагенты") и ЗначениеЗаполнено(ЭлементНастройки.ПравоеЗначение) Тогда
				КонтрагентОтбора = ЭлементНастройки.ПравоеЗначение;
				Прервать;
			КонецЕсли; 	
		КонецЕсли; 
		
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(КонтрагентОтбора)  Тогда		
		ПараметрыФормы = Новый Структура("Контрагент", КонтрагентОтбора); 	
	КонецЕсли;
	//открытие формы помощника с/без отбора
	ОткрытьФорму("Обработка.ОбменСНТ.Форма.ПомощникПолученияВСКонтрагента", ПараметрыФормы);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = СНТКлиентСервер.ИмяСобытияЗаписьВСКонтрагента() Тогда
		Элементы.Список.Обновить();
	ИначеЕсли ИмяСобытия = "ВС_ПроверятьОповещенияФоновогоЗадания"
		И ЭтаФорма.КлючУникальности = Источник Тогда
		
		СНТКлиентПереопределяемый.ОбработкаОповещенияСНТ_ПроверятьОповещенияФоновогоЗадания(ЭтаФорма, Параметр);
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры




