
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с номенклатурой".
// ОбщийМодуль.РаботаСНоменклатуройКлиентПереопределяемый.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ФормаПоискНоменклатурыПоШтрихкоду

// Процедура, вызываемая из обработчика события формы ПриОткрытии формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма - УправляемаяФорма - форма из обработчика события которой происходит вызов процедуры.
//
Процедура ПоискНоменклатурыПоШтрихкодуПриОткрытии(Форма) Экспорт
	
	//++ НЕ ГОСИС
	РаботаСНоменклатуройКлиентУТ.ПоискНоменклатурыПоШтрихкодуПриОткрытии(Форма);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Процедура, вызываемая из обработчика события формы ПриЗакрытии формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма - УправляемаяФорма - форма из обработчика события которой происходит вызов процедуры.
//  ЗавершениеРаботы - Булево - признак завершения работы.
//
Процедура ПоискНоменклатурыПоШтрихкодуПриЗакрытии(Форма, ЗавершениеРаботы) Экспорт
	
	//++ НЕ ГОСИС
	РаботаСНоменклатуройКлиентУТ.ПоискНоменклатурыПоШтрихкодуПриЗакрытии(Форма, ЗавершениеРаботы);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Процедура, вызываемая из обработчика оповещения формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма - УправляемаяФорма - форма из обработчика события которой происходит вызов процедуры.
//  ИмяСобытия	 - Строка - имя события.
//  Параметр	 - Любой - параметры оповещения.
//  Источник	 - Строка - источник оповещения.
//  ШтрихКоды	 - Массив - массив строк штрихкодов. Заполняется при отработке оповещений от оборудования (Строка).
//
Процедура ПоискНоменклатурыПоШтрихкодуОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ШтрихКоды) Экспорт
	
	//++ НЕ ГОСИС
	РаботаСНоменклатуройКлиентУТ.ПоискНоменклатурыПоШтрихкодуОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ШтрихКоды);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Процедура, вызываемая при обработке выбора формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма - УправляемаяФорма - форма из обработчика события которой происходит вызов процедуры.
//  ВыбранноеЗначение - Любой - выбранное значение.
//  ИсточникВыбора - Любой - источник выбора.
//
Процедура ПоискНоменклатурыПоШтрихкодуОбработкаВыбора(Форма, ВыбранноеЗначение, ИсточникВыбора) Экспорт
	
	//++ НЕ ГОСИС
	РаботаСНоменклатуройКлиентУТ.ПоискНоменклатурыПоШтрихкодуОбработкаВыбора(Форма, ВыбранноеЗначение, ИсточникВыбора);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Процедура, вызываемая при изменении поля Номенклатура формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма	 - УправляемаяФорма - форма поиска номенклатуры по штрихкоду.
//  Элемент	 - ПолеФормы - изменяемое поле формы.
//
Процедура ПоискНоменклатурыПоШтрихкодуНоменклатураПриИзменении(Форма, Элемент) Экспорт
	
	//++ НЕ ГОСИС
	РаботаСНоменклатуройКлиентУТ.ПоискНоменклатурыПоШтрихкодуНоменклатураПриИзменении(Форма, Элемент);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Процедура, вызываемая при создании в поле Номенклатура формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма - УправляемаяФорма - форма из обработчика события которой происходит вызов процедуры.
//  Элемент				 - ПолеФормы - элемент формы.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПоискНоменклатурыПоШтрихкодуНоменклатураСоздание(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	//++ НЕ ГОСИС
	РаботаСНоменклатуройКлиентУТ.ПоискНоменклатурыПоШтрихкодуНоменклатураСоздание(Форма, Элемент, СтандартнаяОбработка);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Процедура, вызываемая при начале выбора в поле Номенклатура формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма - УправляемаяФорма - форма из обработчика события которой происходит вызов процедуры.
//  Элемент				 - ПолеФормы - элемент формы.
//  ДанныеВыбора		 - СписокЗначений - данные выбора..
//  СтандартнаяОбработка - Булево -  признак стандартной обработки.
//
Процедура ПоискНоменклатурыПоШтрихкодуНоменклатураНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	//++ НЕ ГОСИС
	РаботаСНоменклатуройКлиентУТ.ПоискНоменклатурыПоШтрихкодуНоменклатураНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Процедура, вызываемая при изменении поля Характеристика формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма	 - УправляемаяФорма - форма поиска номенклатуры по штрихкоду.
//  Элемент	 - ПолеФормы - изменяемое поле формы.
//
Процедура ПоискНоменклатурыПоШтрихкодуХарактеристикаПриИзменении(Форма, Элемент) Экспорт
	
		
КонецПроцедуры

// Процедура, вызываемая при создании в поле Характеристика формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма - УправляемаяФорма - форма из обработчика события которой происходит вызов процедуры.
//  Элемент				 - ПолеФормы - элемент формы.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПоискНоменклатурыПоШтрихкодуХарактеристикаСоздание(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Процедура, вызываемая при начале выбора в поле Характеристика формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма - УправляемаяФорма - форма из обработчика события которой происходит вызов процедуры.
//  Элемент				 - ПолеФормы - элемент формы.
//  ДанныеВыбора		 - СписокЗначений - данные выбора..
//  СтандартнаяОбработка - Булево -  признак стандартной обработки.
//
Процедура ПоискНоменклатурыПоШтрихкодуХарактеристикаНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

// Процедура открывает форму элемента номенклатуры в случает интерактивного заполнения.
//
// Параметры:
//  ОповещениеОЗавершении - ОбработкаОповещения - обработчик закрытия формы. В обработчик должен передаваться
//                                                параметр НоменклатураСсылка с ссылкой на элемент.
//  АдресДанныхЗаполнения - Строка - адрес временного хранилища с данными номенклатуры.
//
Процедура СоздатьНоменклатуруИнтерактивно(ОповещениеОЗавершении, АдресДанныхЗаполнения) Экспорт 
	
	РаботаСНоменклатуройКлиентУТ.СоздатьНоменклатуруИнтерактивно(ОповещениеОЗавершении, АдресДанныхЗаполнения);
	
КонецПроцедуры

// Процедура управляет возможностью поиска номенклатуры в сервисе 1С:Номенклатура по штрихкоду.
//
// Параметры:
//  ИспользоватьПоискПоШтрихкоду - Булево - флаг использования функционала сервиса.
//
Процедура ИспользоватьПоискПоШтрихкодуВСервисе(ИспользоватьПоискПоШтрихкоду) Экспорт
	
	РаботаСНоменклатуройКлиентУТ.ИспользоватьПоискПоШтрихкодуВСервисе(ИспользоватьПоискПоШтрихкоду);
	
КонецПроцедуры

// Открытие формы значения дополнительного реквизита.
//
// Параметры:
//  РеквизитСсылка	     - Ссылка - ссылка на дополнительный реквизит.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуДополнительногоЗначения(РеквизитСсылка, Владелец) Экспорт
	
	РаботаСНоменклатуройКлиентУТ.ОткрытьФормуДополнительногоЗначения(РеквизитСсылка, Владелец);
	
КонецПроцедуры

// Открытие формы дополнительного реквизита.
//
// Параметры:
//  ПараметрыФормы	 - Структура - параметры формы.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуДополнительногоРеквизита(ПараметрыФормы, Владелец) Экспорт
	
	РаботаСНоменклатуройКлиентУТ.ОткрытьФормуДополнительногоРеквизита(ПараметрыФормы, Владелец);
	
КонецПроцедуры

// Открытие формы номенклатуры.
//
// Параметры:
//  НоменклатураСсылка	 - Ссылка - ссылка на номенклатуру.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуНоменклатуры(НоменклатураСсылка, Владелец) Экспорт
	
	РаботаСНоменклатуройКлиентУТ.ОткрытьФормуНоменклатуры(НоменклатураСсылка, Владелец);
	
КонецПроцедуры

// Открытие формы вида номенклатуры.
//
// Параметры:
//  ВидНоменклатурыСсылка - Ссылка - ссылка на вид номенклатуры.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуВидаНоменклатуры(ВидНоменклатурыСсылка, Владелец) Экспорт
	
	РаботаСНоменклатуройКлиентУТ.ОткрытьФормуВидаНоменклатуры(ВидНоменклатурыСсылка, Владелец);
	
КонецПроцедуры

// Открытие формы списка вида номенклатуры.
//
// Параметры:
//  ВидНоменклатурыСсылка - Ссылка - ссылка на вид номенклатуры.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуСпискаВидаНоменклатуры(ВидНоменклатурыСсылка, Владелец) Экспорт
	
	РаботаСНоменклатуройКлиентУТ.ОткрытьФормуСпискаВидаНоменклатуры(ВидНоменклатурыСсылка, Владелец);
	
КонецПроцедуры

// Открытие формы списка номенклатуры.
//
// Параметры:
//  НоменклатураСсылка	 - Ссылка - ссылка на номенклатуру.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуСпискаНоменклатуры(НоменклатураСсылка, Владелец) Экспорт
	
	РаботаСНоменклатуройКлиентУТ.ОткрытьФормуСпискаНоменклатуры(НоменклатураСсылка, Владелец);
	
КонецПроцедуры

// Обработка загрузки категорий в форме списка вида номенклатуры.
//
// Параметры:
//  СозданныеОбъекты - Массив - ссылки на созданные элементы.
//  Форма			 - УправляемаяФорма - форма списка вида номенклатуры.
//
Процедура ПослеЗагрузкиКатегорий(СозданныеОбъекты, Форма) Экспорт
	
	РаботаСНоменклатуройКлиентУТ.ПослеЗагрузкиКатегорий(СозданныеОбъекты, Форма);
	
КонецПроцедуры

#КонецОбласти
