
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(Отказ, Заголовок)
	Для Каждого СтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл
		Если Не ЗначениеЗаполнено(СтрокаНоминальныеОбъекты.Номер) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В строке " + СтрокаНоминальныеОбъекты.НомерСтроки + " не заполнен Номер", Отказ, Заголовок);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаНоминальныеОбъекты.НоминальныйОбъект) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В строке " + СтрокаНоминальныеОбъекты.НомерСтроки + " не заполнен Номинальный Объект", Отказ, Заголовок);
		КонецЕсли;
		//Если Не ЗначениеЗаполнено(СтрокаНоминальныеОбъекты.Держатель) Тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("В строке " + СтрокаНоминальныеОбъекты.НомерСтроки + " не заполнено Держатель", Отказ, Заголовок);
		//КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ДвиженияПоРегистрам(РежимПроведения, Отказ, Заголовок);

	НаборДвиженийСведения = Движения.bon_СведенияОНоминальныхОбъектах;

	Для Каждого СтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл
		
		НоваяЗапись = НаборДвиженийСведения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаНоминальныеОбъекты);
		НоваяЗапись.Период 					= Дата;
		НоваяЗапись.Автор					= Автор;
		НоваяЗапись.ПериодДействияНачало 	= "";
		НоваяЗапись.ПериодДействияКонец 	= "";
		НоваяЗапись.Подразделение			= ЭтотОбъект.Подразделение; 
		
		спр = СтрокаНоминальныеОбъекты.НоминальныйОбъект.ПолучитьОбъект();   
		спр.Наименование = Строка(СтрокаНоминальныеОбъекты.Держатель);
		спр.Держатель = СтрокаНоминальныеОбъекты.Держатель;
		спр.Записать();
		
		СтрокаНоминальныеОбъекты.НоминальныйОбъект = спр.Ссылка;
		
	КонецЦикла;	
	Записать();	
	
	Если Не Отказ Тогда
		НаборДвиженийСведения.Записать();
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
////////////////////////////////////////////////////////////////////////////////


Процедура ПриКопировании(ОбъектКопирования)
	НоминальныеОбъекты.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	//ПроверитьЗаполнениеШапки(Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиТовары(Отказ, Заголовок);

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, Отказ, Заголовок);
		ПроставитьДержателя();
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

Процедура ПроставитьДержателя()
	
	Для Каждого Строка Из НоминальныеОбъекты Цикл  
		НаборЗаписей = РегистрыСведений.bon_ТелефоныНомОбъектов.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.bon_НоминальныеОбъекты.Установить(Строка.НоминальныйОбъект);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0  Тогда
			Для Каждого Стр Из НаборЗаписей Цикл 
				Если Не ЗначениеЗаполнено(Стр.Контрагенты) Тогда
					Стр.Контрагенты = Строка.Держатель;
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
////////////////////////////////////////////////////////////////////////////////
