////////////////////////////////////////////////////////////////////////////////
// Переопределяемые процедуры, вызываемые из обработчиков форм, таких как:
// "ПриСозданииНаСервере", "ПриЧтенииНаСервере", "ПередЗаписьюНаСервере", 
// "ПослеЗаписи", а также при изменении некоторых реквизитов табличной части,
// таких как "Номенклатура", "Характеристика".
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПредставленияПризнаковПроисхождения() Экспорт
	
	ПредставленияПризнаков = Новый Массив();
	ПредставленияПризнаков.Добавить(НСтр("ru='1 - Товар, включенный в Перечень, ввезенный на территорию РК'"));
	ПредставленияПризнаков.Добавить(НСтр("ru='2 - Товар, не включенный в Перечень, ввезенный на территорию РК'") );
	ПредставленияПризнаков.Добавить(НСтр("ru='3 - Товар, включенный в Перечень, произведенный на территории РК'") );
	ПредставленияПризнаков.Добавить(НСтр("ru='4 - Товар, не включенный в Перечень, произведенный на территории РК'") );
	ПредставленияПризнаков.Добавить(НСтр("ru='5 - Товар, не относящийся к другим признакам'") );
	
	Возврат ПредставленияПризнаков;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
