&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектИнформации = Параметры.ОбъектИнформации;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Infor_ОчередьВыгрузки.Объект,
	               |	Infor_ОчередьВыгрузки.КоличествоПопытокВыгрузки,
	               |	Infor_ОчередьВыгрузки.Приоритет,
	               |	Infor_ОчередьВыгрузки.СтатусВыгрузки,
	               |	Infor_ОчередьВыгрузки.Ошибка
	               |ИЗ
	               |	РегистрСведений.Infor_ОчередьВыгрузки КАК Infor_ОчередьВыгрузки
	               |ГДЕ
	               |	Infor_ОчередьВыгрузки.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", ОбъектИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = СписокОчередьОбмена.Добавить();
		НС.Объект = Выборка.Объект;
		НС.КоличествоПопытокВыгрузки = Выборка.КоличествоПопытокВыгрузки;
		НС.Приоритет = Выборка.Приоритет;
		НС.СтатусВыгрузки = Выборка.СтатусВыгрузки;
		НС.Ошибка = Выборка.Ошибка;		
	КонецЦикла;
	
	ТекстОшибки = "";
	Connection = Неопределено;
	Попытка
		Infor_Интеграция.ПолучитьПодключениеБД(Connection);
		Преф = Infor_Интеграция.ПолучитьПрефиксОбъека(ОбъектИнформации)+"_";
		ТекстНомера = Infor_Интеграция._ПолучитьНомерВМС(Преф, ОбъектИнформации);
		
		ТекстSQL = "SELECT
		|RecordId,
		|'dbo.ImpOutputOrdersShippingFromWMS_'
		|FROM [BUFER].[dbo].[ImpOutputOrdersShippingFromWMS] (nolock)
		|WHERE Docid = '" + ТекстНомера + "'
		|UNION ALL
		|SELECT
		|RecordId,
		|'dbo.ImpInputOrdersFromWMS_'
		|FROM [BUFER].[dbo].[ImpInputOrdersFromWMS] (nolock)
		|WHERE Docid = '" + ТекстНомера + "'";
		RS = Connection.Execute(ТекстSQL);
		Пока RS.EOF = 0 Цикл
			ТекстОшибки = СокрЛП(RS.Fields(1).Value)+СтрЗаменить(СокрЛП(RS.Fields(0).Value),Символы.НПП,"");
			RS.MoveNext();
		КонецЦикла;
		RS.Close();
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Infor_Ошибки.ДатаОшибки КАК ДатаОшибки,
	               |	Infor_Ошибки.ОбъектОшибки,
	               |	Infor_Ошибки.ПричинаОшибки
	               |ИЗ
	               |	РегистрСведений.Infor_Ошибки КАК Infor_Ошибки
	               |ГДЕ
	               |	Infor_Ошибки.ОбъектОшибки = &ОбъектОшибки";
	Если ТекстОшибки <> "" Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	ИЛИ Infor_Ошибки.ОбъектОшибки = &ТекстОшибки";
		Запрос.УстановитьПараметр("ТекстОшибки", ТекстОшибки);
	Иначе
		
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОшибки УБЫВ";
	Запрос.УстановитьПараметр("ОбъектОшибки", ОбъектИнформации);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = СписокОшибкиОбмена.Добавить();
		НС.ДатаОшибки = Выборка.ДатаОшибки;
		НС.ОбъектОшибки = Выборка.ОбъектОшибки;
		НС.ПричинаОшибка = Выборка.ПричинаОшибки;		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Infor_СтатусыОбъектов.Объект,
	               |	Infor_СтатусыОбъектов.СтатусОбъекта
	               |ИЗ
	               |	РегистрСведений.Infor_СтатусыОбъектов КАК Infor_СтатусыОбъектов
	               |ГДЕ
	               |	Infor_СтатусыОбъектов.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", ОбъектИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = СписокСтатусОбмена.Добавить();
		НС.Объект = Выборка.Объект;
		НС.СтатусОбъекта = Выборка.СтатусОбъекта;	
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Infor_ИсторияСтатусовОбъектов.Объект,
	               |	Infor_ИсторияСтатусовОбъектов.СтатусОбъекта,
	               |	Infor_ИсторияСтатусовОбъектов.ДатаИзменения КАК ДатаИзменения
	               |ИЗ
	               |	РегистрСведений.Infor_ИсторияСтатусовОбъектов КАК Infor_ИсторияСтатусовОбъектов
	               |ГДЕ
	               |	Infor_ИсторияСтатусовОбъектов.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаИзменения";
	Запрос.УстановитьПараметр("Объект", ОбъектИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = СписокИсторияСтатусов.Добавить();
		НС.Объект = Выборка.Объект;
		НС.ДатаИзменения = Выборка.ДатаИзменения;
		НС.СтатусОбъекта = Выборка.СтатусОбъекта;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Infor_ИсторияСтатусовВМС.Объект,
	               |	Infor_ИсторияСтатусовВМС.СтатусОбъекта,
	               |	Infor_ИсторияСтатусовВМС.ДатаИзменения КАК ДатаИзменения
	               |ИЗ
	               |	РегистрСведений.Infor_ИсторияСтатусовВМС КАК Infor_ИсторияСтатусовВМС
	               |ГДЕ
	               |	Infor_ИсторияСтатусовВМС.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаИзменения УБЫВ";
	Запрос.УстановитьПараметр("Объект", ОбъектИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = СписокСтатусВМС.Добавить();
		НС.Объект = Выборка.Объект;
		НС.ДатаИзменения = Выборка.ДатаИзменения;
		НС.СтатусОбъекта = Выборка.СтатусОбъекта;
	КонецЦикла;
КонецПроцедуры
