
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ДокументСсылка") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ВыбраннаяФорма = "Форма";
	
	Если Не Параметры.Свойство("ПодключенноеОборудование") Тогда
		
		ПодключенноеОборудование = ПодключаемоеОборудованиеУТВызовСервера.ОборудованиеПодключенноеПоОрганизации(Параметры.Организация);
		ПодключенноеОборудование.Вставить("ФискальныеУстройства", ПодключенноеОборудование.ККТ);
		
		Параметры.Вставить("ПодключенноеОборудование", ПодключенноеОборудование);
		
		Если ПодключенноеОборудование.ФискальныеУстройства.Количество() = 0 Тогда
			ВыбраннаяФорма = "ОшибкаПодключенияОборудования";
		КонецЕсли;
		
	КонецЕсли;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
 		Если НЕ ПечатьФискальныхДокументовРКПереопределяемый.СравнитьВалюты(Параметры.ДокументСсылка) Тогда
			ВыбраннаяФорма = "ОшибкаИспользуемойВалюты";
		КонецЕсли; 
				
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти