
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Перем Заголовок;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Заголовок = "Проверка заполнения документа: ";
		// проверим заполнение обязательных полей ТЧ
		СтруктураОбязательныхПолей = Новый Структура("Номер");
		
		Если НЕ ВидНоминальныхОбъектов.НакапливаемыйНоминал Тогда
			СтруктураОбязательныхПолей.Вставить("Номинал");		
		КонецЕсли;
				
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		// досоздадим номинальные объекты
		Для каждого стрТЧ Из НоминальныеОбъекты Цикл
			Если НЕ ЗначениеЗаполнено(стрТЧ.НоминальныйОбъект) Тогда
				// сначало ищем в справочнике по номеру
				//ПоискЭлемента = Справочники.bon_НоминальныеОбъекты.НайтиПоКоду(стрТЧ.Номер);
				ПоискЭлемента = ПоискПоНомеру(стрТЧ.Номер);
							
				Если ПоискЭлемента.Ссылка.Пустая() Тогда
					// создадим если не нашли
					спр = Справочники.bon_НоминальныеОбъекты.СоздатьЭлемент();
					//спр.Код 	 			= стрТЧ.Номер;
					спр.Владелец 			= ВидНоминальныхОбъектов;
					спр.Наименование		= Строка("Бонусный Счет " + стрТЧ.Номер);
					спр.Записать();
					ПоискЭлемента = спр.Ссылка;
					
					/////
					МенеджерЗаписи = РегистрыСведений.bon_ТелефоныНомОбъектов.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Сотовый 				  = стрТЧ.Номер;  
					Если  ПоискЭлемента <> Справочники.bon_НоминальныеОбъекты.ПустаяСсылка() Тогда
						ОсновНомер = ПроверкаЕслиОсновной(ПоискЭлемента);		
					Иначе 
						ОсновНомер = Истина;	
					КонецЕсли;
					
					ОсновНомер = ПроверкаЕслиОсновной(Спр.Ссылка);

					МенеджерЗаписи.Основной 			  = ОсновНомер;
					МенеджерЗаписи.bon_НоминальныеОбъекты = ПоискЭлемента;
					МенеджерЗаписи.Записать();
					
				ИначеЕсли ПоискЭлемента.ПометкаУдаления Тогда
					// снимем пометку удаления
					спр = ПоискЭлемента.ПолучитьОбъект();
					спр.ПометкаУдаления = Ложь;			
					спр.Записать();	
					ПоискЭлемента = спр.Ссылка;		
				КонецЕсли; 
				стрТЧ.НоминальныйОбъект = ПоискЭлемента;	
			КонецЕсли; 	
		КонецЦикла;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 			
		// пометим на удаление все номинальные объекты	
	КонецЕсли; 
	
	Попытка 	
		Для Каждого ТекСтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл
			Попытка
				Спр = ТекСтрокаНоминальныеОбъекты.НоминальныйОбъект.ПолучитьОбъект();
				Если СОкрЛП(Спр.Держатель) = "" Тогда 
					Спр.Держатель = ТекСтрокаНоминальныеОбъекты.Держатель;
				КонецЕсли;
				Спр.Записать();	
				
				/////
				ПоискЭлемента = ПоискПоНомеру(ТекСтрокаНоминальныеОбъекты.Номер);	
				Если ПоискЭлемента.Ссылка.Пустая() Тогда
					МенеджерЗаписи = РегистрыСведений.bon_ТелефоныНомОбъектов.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Сотовый 				  = ТекСтрокаНоминальныеОбъекты.Номер;
					ОсновНомер = ПроверкаЕслиОсновной(Спр.Ссылка);
					МенеджерЗаписи.Основной 			  = ОсновНомер;
					МенеджерЗаписи.bon_НоминальныеОбъекты = Спр.Ссылка;
					МенеджерЗаписи.Контрагенты 			  = Спр.Держатель;
					МенеджерЗаписи.Записать();
				КонецЕсли;
				
			Исключение
				описание = ОписаниеОшибки();		
			КонецПопытки;	
		КонецЦикла;	
	Исключение
		описание = ОписаниеОшибки();
	КонецПопытки; 

		
КонецПроцедуры

&НаСервере
Функция ПроверкаЕслиОсновной(Номенальный)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	bon_ТелефоныНомОбъектов.Основной КАК Основной
	|ИЗ
	|	РегистрСведений.bon_ТелефоныНомОбъектов КАК bon_ТелефоныНомОбъектов
	|ГДЕ
	|	bon_ТелефоныНомОбъектов.bon_НоминальныеОбъекты = &bon_НоминальныеОбъекты
	|	И bon_ТелефоныНомОбъектов.Основной = ИСТИНА";
	Запрос.УстановитьПараметр("bon_НоминальныеОбъекты",Номенальный); 
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Возврат Ложь;	
	Иначе 
		Возврат Истина;	
	КонецЕсли;
КонецФункции

Функция ПоискПоНомеру(Номер) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	bon_ТелефоныНомОбъектов.bon_НоминальныеОбъекты КАК bon_НоминальныеОбъекты
	|ИЗ
	|	РегистрСведений.bon_ТелефоныНомОбъектов КАК bon_ТелефоныНомОбъектов
	|ГДЕ
	|	bon_ТелефоныНомОбъектов.Сотовый = &Сотовый
	|
	|СГРУППИРОВАТЬ ПО
	|	bon_ТелефоныНомОбъектов.bon_НоминальныеОбъекты";
	Запрос.УстановитьПараметр("Сотовый",Номер);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 тогда
		ПоискЭлемента = Рез[0].bon_НоминальныеОбъекты;
	Иначе 
		ПоискЭлемента = Справочники.bon_НоминальныеОбъекты.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат ПоискЭлемента;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ма_СведенияОНоминальныхОбъектах
	Движения.bon_СведенияОНоминальныхОбъектах.Записывать = Истина;
	Движения.bon_СведенияОНоминальныхОбъектах.Очистить();
	
	Для Каждого ТекСтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл
		
		Движение = Движения.bon_СведенияОНоминальныхОбъектах.Добавить();
		
		Движение.Период 				= НачалоДня(Дата);
		Движение.Номер 					= ТекСтрокаНоминальныеОбъекты.Номер;
		Движение.НоминальныйОбъект 		= ТекСтрокаНоминальныеОбъекты.НоминальныйОбъект;
		Движение.Держатель			 	= ТекСтрокаНоминальныеОбъекты.Держатель;
		Движение.ПериодДействияНачало 	= ПериодДействияНачало;
		Движение.ПериодДействияКонец 	= ПериодДействияКонец;
		Движение.Автор 					= Автор;
		Движение.Подразделение			= Подразделение; 		
	КонецЦикла;

	// регистр ма_СостоянияНоминальныхОбъектов
	Движения.bon_СостоянияНоминальныхОбъектов.Записывать = Истина;
	Движения.bon_СостоянияНоминальныхОбъектов.Очистить();
	
	Для Каждого ТекСтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл
		
		Движение = Движения.bon_СостоянияНоминальныхОбъектов.Добавить();
		Движение.Период 				= Дата; 
		Движение.Номер 					= ТекСтрокаНоминальныеОбъекты.Номер;
		Движение.НоминальныйОбъект 		= ТекСтрокаНоминальныеОбъекты.НоминальныйОбъект;
		Движение.Статус 				= Перечисления.bon_СтатусыНоминальныхОбъектов.ВведенВОборот;
		
	КонецЦикла;
	

	///Движение ввода по бонусам
	Если ВидНоминальныхОбъектов.Наименование = Строка("Акционные Сертификаты") или ВидНоминальныхОбъектов.Наименование = Строка("Подарочный сертификат") Тогда
		bon_БонуснаяПрограммаСервер.ПоступлениеСертификатовВрем(ЭтотОбъект, НоминальныеОбъекты);
	КонецЕсли;
	
	Если ВидНоминальныхОбъектов.Наименование = Строка("Бонусные счета") или ВидНоминальныхОбъектов.Наименование = Строка("Накопительные карты") Тогда
		bon_БонуснаяПрограммаСервер.ВводВОборотБонусныйСчетСНоменалом(ЭтотОбъект, НоминальныеОбъекты);
	КонецЕсли;
	///---

КонецПроцедуры

