
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СформироватьТаблицуВерсийНаСервере() Экспорт
	
	//УстановитьПривилегированныйРежим(Истина);
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ВерсииОбъектов.Объект КАК Объект,
	//               |	ВерсииОбъектов.НомерВерсии КАК НомерВерсии,
	//               |	ВерсииОбъектов.КонтрольнаяСумма КАК КонтрольнаяСумма,
	//               |	ВерсииОбъектов.ВерсияОбъекта КАК ВерсияОбъекта
	//               |ИЗ
	//               |	Документ.ЗаказКлиента КАК ЗаказКлиента
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	//               |		ПО ЗаказКлиента.Ссылка = ВерсииОбъектов.Объект
	//               |ГДЕ
	//               |	ЗаказКлиента.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	//               |	И ЗаказКлиента.Проведен
	//               |	И ВерсииОбъектов.ЕстьДанныеВерсии";
	//
	//Запрос.УстановитьПараметр("ПериодНачало",    Дата(2021,06,01,09,00,00));
	//Запрос.УстановитьПараметр("ПериодОкончание", Дата(2021,06,01,12,00,00));
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//НаборЗаписей = РегистрыСведений.ИсторияИзмененийДляОтчета.СоздатьНаборЗаписей();
	////НаборЗаписей.Прочитать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	ДанныеИсториии = ВерсионированиеОбъектов.РазборПредставленияОбъектаXML(Выборка.ВерсияОбъекта.Получить(), Выборка.Объект);

	//	Если ТипЗнч(ДанныеИсториии) <> Тип("Структура") Тогда 
	//		Продолжить
	//	КонецЕсли;
	//	
	//	ДатаДокумента  = ДанныеИсториии.Реквизиты.Найти("Date", "НаименованиеРеквизита");
	//	СуммаДокумента = ДанныеИсториии.Реквизиты.Найти("СуммаДокумента", "НаименованиеРеквизита");          
	//	Контрагент     = ДанныеИсториии.Реквизиты.Найти("Контрагент", "НаименованиеРеквизита");
	//	
	//	Если ДатаДокумента = Неопределено 
	//		И СуммаДокумента = Неопределено
	//		И Контрагент = Неопределено Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	НоваяЗапись = НаборЗаписей.Добавить();
	//	НоваяЗапись.Объект           = Выборка.Объект;
	//	НоваяЗапись.НомерВерсии      = Выборка.НомерВерсии;
	//	НоваяЗапись.КонтрольнаяСумма = Выборка.КонтрольнаяСумма;
	//	НоваяЗапись.ДатаДокумента    = ДатаДокумента.ЗначениеРеквизита;
	//	НоваяЗапись.СуммаДокумента   = СуммаДокумента.ЗначениеРеквизита;
	//	НоваяЗапись.Контрагент       = Контрагент.ЗначениеРеквизита;
	//	
	//	//НоваяСтрока = СписокДанных.Добавить();
	//	//НоваяСтрока.ЗаказКлиента   = Выборка.Объект;
	//	//НоваяСтрока.АвторИзменения = Выборка.АвторВерсии;  
	//	//НоваяСтрока.ДатаИзменения  = Выборка.ДатаВерсии;
	//	//НоваяСтрока.НомерВерсии     = Выборка.НомерВерсии;
	//	//НоваяСтрока.ДатаДокумента  = ?(ДатаДокумента = Неопределено, Неопределено, ДатаДокумента.ЗначениеРеквизита);
	//	//НоваяСтрока.СуммаДокумента = ?(СуммаДокумента = Неопределено, Неопределено, СуммаДокумента.ЗначениеРеквизита);         
	//	//НоваяСтрока.Контрагенты    = ?(Контрагент = Неопределено, Неопределено, Контрагент.ЗначениеРеквизита);
	//	//НоваяСтрока.Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '№ %1 / (%2) / %3'"), Выборка.НомерВерсии,
	//	//Строка(Выборка.ДатаВерсии), СокрЛП(Строка(Выборка.АвторВерсии)));
	//	
	//КонецЦикла;
	//
	//НаборЗаписей.Записать();
	
КонецФункции

#КонецЕсли