////////////////////////////////////////////////////////////////////////////////
// Подсистема "Бизнес-сеть".
// ОбщийМодуль.БизнесСеть.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ИнтеграцияСБиблиотекойТехнологияСервиса

// См. процедуру ТарификацияПереопределяемый.ПриФормированииСпискаУслуг
//
Процедура ПриФормированииСпискаУслуг(ПоставщикиУслуг) Экспорт
	
	ПоставщикПортал1СИТС = Неопределено;
	ИдентификаторПоставщикаУслугПортал1СИТС =
		ЭлектронноеВзаимодействиеКлиентСервер.ИдентификаторПоставщикаУслугПортал1СИТС();
	Для каждого ЗначениеМассива Из ПоставщикиУслуг Цикл
		Если ЗначениеМассива.Идентификатор = ИдентификаторПоставщикаУслугПортал1СИТС Тогда
			ПоставщикПортал1СИТС = ЗначениеМассива;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоставщикПортал1СИТС = Неопределено Тогда
		ПоставщикПортал1СИТС = Новый Структура;
		ПоставщикПортал1СИТС.Вставить("Идентификатор", ИдентификаторПоставщикаУслугПортал1СИТС);
		ПоставщикПортал1СИТС.Вставить("Наименование" , НСтр("ru = 'Портал 1С:ИТС'"));
		ПоставщикПортал1СИТС.Вставить("Услуги"       , Новый Массив);
		ПоставщикиУслуг.Добавить(ПоставщикПортал1СИТС);
	КонецЕсли;
	
	Услуги = ПоставщикПортал1СИТС.Услуги;
	
	// Оператор [] используется для исключения ошибки компиляции,
	// если не внедрена Библиотека "Технология сервиса".
	ТипУслугиБезлимитная = Перечисления["ТипыУслуг"]["Безлимитная"];
	
	НоваяУслуга = Новый Структура;
	НоваяУслуга.Вставить("Идентификатор", "1c-bn-access");
	НоваяУслуга.Вставить("Наименование" , НСтр("ru = 'ЭДО без электронной подписи для участников 1С:Бизнес-сеть'"));
	НоваяУслуга.Вставить("ТипУслуги"    , ТипУслугиБезлимитная);
	Услуги.Добавить(НоваяУслуга);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбменДанными

// Выполнение команды сервиса.
//
// Параметры:
//   ПараметрыКоманды - Структура - параметры вызова или имя команды.
//   Отказ - Булево - признак ошибки выполнения.
// Возврат
//   Строка, Массив, Структура - возвращаемые данные сервиса.
//
Функция ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ) Экспорт
	
	// Проверка отказа заполнения параметров.
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Получение и инициализация общих параметров соединения в сервисе.
	СохранятьПараметрыСеанса = Ложь;
	ПараметрыСоединения = Новый Структура(
		СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере().Получить("БизнесСетьПараметрыСоединения"));
	Если НЕ ЗначениеЗаполнено(ПараметрыСоединения) Тогда
		ПараметрыСоединения = ОбщиеНастройкиСервиса();
	КонецЕсли;
	Если Не ПараметрыСоединения.Свойство("СписокТикетов") Тогда
		ПараметрыСоединения.Вставить("СписокТикетов", Неопределено);
	КонецЕсли;
	ПараметрыКоманды.Вставить("ИдентификаторПрограммы", ПараметрыСоединения.ИдентификаторПрограммы);
	
	// Установка настроек соединения.
	ИмяСервиса = "СервисБизнесСеть";
	Если Не ПустаяСтрока(ПараметрыКоманды.Сервис) Тогда
		ИмяСервиса = "Сервис" + ПараметрыКоманды.Сервис;
	КонецЕсли;
	
	ИмяСервера                 = ПараметрыСоединения[ИмяСервиса]["ИмяСервера"];
	Порт                       = ПараметрыСоединения[ИмяСервиса]["Порт"];
	ЗащищенноеСоединение       = ПараметрыСоединения[ИмяСервиса]["ЗащищенноеСоединение"];
	ИспользуетсяАутентификация = ПараметрыСоединения[ИмяСервиса]["ИспользуетсяАутентификация"];
	
	// Установка защищенного соединения.
	ЗащищенноеСоединениеOpenSSL = Неопределено;
	Если ЗащищенноеСоединение Тогда
		ЗащищенноеСоединениеOpenSSL = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС);
	КонецЕсли;
	
	// Установка времени ожидания ответа.
	Если ПараметрыКоманды.Свойство("Таймаут") Тогда
		Таймаут = ПараметрыКоманды.Таймаут;
	Иначе
		Таймаут = 30;
	КонецЕсли;
		
	// Проверка соединения  в сервисом.
	Попытка
		Прокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси(?(ЗащищенноеСоединение, "https", "http"));
		Соединение = Новый HTTPСоединение(ИмяСервера, Порт,,, Прокси, Таймаут, ЗащищенноеСоединениеOpenSSL);
	Исключение
		ТекстСообщения = НСтр("ru='Отсутствует соединение с сервисом 1С:Бизнес-сеть'")
			+ Символы.ПС + НСтр("ru ='Подробности см. в журнале регистрации.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), "БизнесСеть");
		Возврат Неопределено;
	КонецПопытки;

	// Получение тикета сервиса.
	Если ИспользуетсяАутентификация Тогда
		ПолучитьТикет(Соединение, ПараметрыСоединения, ПараметрыКоманды, СохранятьПараметрыСеанса, Отказ);
		Если Отказ ИЛИ ПустаяСтрока(ПараметрыКоманды.Адрес) ИЛИ ПараметрыСоединения.СписокТикетов = Неопределено
			ИЛИ ПараметрыСоединения.СписокТикетов.Получить(ПараметрыКоманды.Права) = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		КлючСоединения = ПараметрыСоединения.СписокТикетов.Получить(ПараметрыКоманды.Права).Ключ;
	КонецЕсли;
	
	// Установка параметров запроса.
	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыКоманды.Адрес);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Если ИспользуетсяАутентификация Тогда
		HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + КлючСоединения);
	КонецЕсли;
	
	Если ПараметрыКоманды.Свойство("Заголовки") Тогда
		Для каждого ПараметрЗаголовка Из ПараметрыКоманды.Заголовки Цикл
			HTTPЗапрос.Заголовки.Вставить(ПараметрЗаголовка.Ключ, ПараметрЗаголовка.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыКоманды.Данные) Тогда
		Если ТипЗнч(ПараметрыКоманды.Данные) = Тип("ДвоичныеДанные") Тогда
			HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ПараметрыКоманды.Данные);
		Иначе
			HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыКоманды.Данные);
		КонецЕсли;
	КонецЕсли;
	
	// Выполнение запроса HTTP к сервису.
	Попытка
		
		Если ПараметрыКоманды.Метод = "get" Тогда
			HTTPОтвет = Соединение.Получить(HTTPЗапрос);
		ИначеЕсли ПараметрыКоманды.Метод = "post" Тогда
			HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли ПараметрыКоманды.Метод = "put" Тогда
			HTTPОтвет = Соединение.Записать(HTTPЗапрос);
		ИначеЕсли ПараметрыКоманды.Метод = "delete" Тогда
			HTTPЗапрос.Заголовки.Вставить("Content-Length", СтрДлина(HTTPЗапрос.ПолучитьТелоКакСтроку()));
			HTTPОтвет = Соединение.Удалить(HTTPЗапрос);
		Иначе
			ВызватьИсключение НСтр("ru = 'Ошибка выполнения команды сервиса.'");
		КонецЕсли;
		
		КодСостояния = HTTPОтвет.КодСостояния;
		Данные = HTTPОтвет.ПолучитьТелоКакСтроку();
		Если ЗначениеЗаполнено(Данные) Тогда
			Данные = ЗначениеИзСтрокиJSON(Данные);
		КонецЕсли;
		
	Исключение
		Отказ = Истина;
		ТекстОшибки = НСтр("ru = 'Ошибка выполнения запроса к сервису.'");
		ПодробныйТекстОшибки = ТекстОшибки + Символы.ПС + ПараметрыКоманды.Адрес + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(ПараметрыКоманды.Наименование,
			ПодробныйТекстОшибки, ТекстОшибки, "БизнесСеть");
		Возврат Неопределено;
	КонецПопытки;
	
	// Обработка результата запроса.
	Результат = ОбработатьОтветСервиса(ПараметрыКоманды, КодСостояния, Данные, Отказ);
	
	// Сохранение данных параметров соединения в параметрах сеанса.
	Если Не Отказ И СохранятьПараметрыСеанса Тогда
		СохранитьПараметрыСоединенияВСеансе(ПараметрыСоединения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Регистрация организаций в сервисе.
//
Процедура ЗарегистрироватьОрганизации(МассивОрганизаций, Отказ, ТребуетсяОбновитьИнтерфейс = Неопределено) Экспорт
	
	Если Не ПравоНастройкиОбменаДокументами() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка подключения программы.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПользователиБизнесСеть.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.ПользователиБизнесСеть КАК ПользователиБизнесСеть";
	ПользователиЗарегистрированы = Не Запрос.Выполнить().Пустой();
	
	Если Не ПользователиЗарегистрированы ИЛИ Не ОрганизацияЗарегистрирована() Тогда
		// Очистка сохраненных данных.
		ПараметрыОчисткиДанных = Новый Структура;
		ПараметрыОчисткиДанных.Вставить("МассивПользователей", Неопределено);
		ПараметрыОчисткиДанных.Вставить("ИдентификаторПрограммы", Неопределено);
		ОбновитьИдентификаторыБизнесСети(ПараметрыОчисткиДанных, Истина);
		// Очистка параметров соединения.
		СохранитьПараметрыСоединенияВСеансе(Неопределено);
		ПользователиЗарегистрированы = Ложь;
	КонецЕсли;
	
	// Проверка регистрации Абонента сервиса 1С:Бизнес-сеть.
	ПараметрыКоманды = ПараметрыКомандыПроверкаРегистрацииАбонента();
	ДанныеСервиса = ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления = Новый Структура;
	ТекущийАбонент = Неопределено;
	
	// Если абонент уже существует, то новый абонент не регистрируется.
	Если ДанныеСервиса = Неопределено
		ИЛИ ДанныеСервиса = Ложь
		ИЛИ (ПользователиЗарегистрированы = Ложь И ДанныеСервиса = Истина) Тогда
		
		// Регистрация абонента и получение его идентификатора.
		ПараметрыМетода = ПараметрыКомандыРегистрацияАбонента(ПараметрыКоманды, Отказ);
		ТекущийАбонент = ВыполнитьКомандуСервиса(ПараметрыМетода, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		ПараметрыОбновления.Вставить("АдминистраторАбонента", ПараметрыКоманды.АдминистраторАбонента);
		ПараметрыОбновления.Вставить("ИдентификаторПрограммы", ПараметрыКоманды.ИдентификаторПрограммы);
		ОбновитьИдентификаторыБизнесСети(ПараметрыОбновления);
	Иначе
		// Получение списка подключенных абонентов, по-умолчанию берем первого абонента из списка.
		ПараметрыКоманды = ПараметрыКомандыПолучитьСписокАбонентов();
		ДанныеСервиса = ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		Если ТипЗнч(ДанныеСервиса) = Тип("Массив") Тогда
			Если ДанныеСервиса.Количество() = 0 Тогда
				Отказ = Истина;
				ВызватьИсключение НСтр("ru = 'Абонент сервиса 1С:Бизнес-сеть не найден.'");
			Иначе
				ТекущийАбонент = ДанныеСервиса[0].id;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийАбонент = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Отсутствуют данные об администраторе абонента.'") ;
	КонецЕсли;
	
	// Подготовка данных для регистрации.
	СписокОрганизаций = Новый ТаблицаЗначений;
	СписокОрганизаций.Колонки.Добавить("Ссылка");
	СписокОрганизаций.Колонки.Добавить("ИНН");
	СписокОрганизаций.Колонки.Добавить("КПП");
	Для каждого ЗначениеМассива Из МассивОрганизаций Цикл
		НоваяСтрока = СписокОрганизаций.Добавить();
		НоваяСтрока.Ссылка = ЗначениеМассива;
	КонецЦикла;
	
	ЗаполнитьРеквизитыОрганизаций(СписокОрганизаций);
	
	// Проверка организаций для регистрации.
	Для каждого СтрокаОрганизаций Из СписокОрганизаций Цикл
		
		ПараметрыКоманды = ПараметрыКомандыПроверкаОрганизации(СтрокаОрганизаций, Отказ);
		ДанныеСервиса = БизнесСеть.ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
		ОрганизацияЗарегистрированаВСервисе = Ложь;
		
		// Если организация уже зарегистрирована, проверим доступ сервису запросом списка входящих документов.
		Если ТипЗнч(ДанныеСервиса) = Тип("Массив") И ДанныеСервиса[0] = Истина Тогда
			
			ОрганизацияЗарегистрированаВСервисе = Истина;
			ПараметрыМетода = Новый Структура;
			ПараметрыМетода.Вставить("Организация",       СтрокаОрганизаций.Ссылка);
			ПараметрыМетода.Вставить("ДатаСинхронизации", КонецГода(ТекущаяДатаСеанса()));
			ПараметрыМетода.Вставить("ОтборТолькоНовые",  Истина);
			ПараметрыМетода.Вставить("БлокироватьСообщенияОбОшибках", Истина);
			ПараметрыМетода.Вставить("РежимРегистрацииОрганизаций", Истина);
			ПараметрыКоманды = ПараметрыКомандыСписокВходящихДокументов(ПараметрыМетода, Отказ);
			Результат = ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
			
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
				
		КонецЕсли;
		
		Если Отказ Тогда
			// Очистка идентификаторов.
			СохранитьПараметрыСоединенияВСеансе(Неопределено);
			Возврат;
		КонецЕсли;
		
		Если Не ОрганизацияЗарегистрированаВСервисе Тогда
			// Регистрация организации.
			ПараметрыМетода = Новый Структура;
			ПараметрыМетода.Вставить("Организация", СтрокаОрганизаций.Ссылка);
			ПараметрыМетода.Вставить("Абонент",     ТекущийАбонент);
			ПараметрыКоманды = ПараметрыКомандыРегистрацияОрганизации(ПараметрыМетода, Отказ);
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
			Результат = ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		// Успешная регистрация организации. Запись статуса в информационную базу.
		ПараметрыОбновления.Вставить("МассивОрганизаций",
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаОрганизаций.Ссылка));
		ОбновитьИдентификаторыБизнесСети(ПараметрыОбновления);
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Обновление пользователей в сервисе и информационной базе.
	ОбновитьПользователейВСервисе(ТекущийАбонент, Ложь, Отказ);
	
	// Проверка и установка функциональной опции.
	КонстантаМенеджер = Константы.ИспользоватьОбменБизнесСеть;
	Если Не КонстантаМенеджер.Получить() Тогда
		КонстантаМенеджер.Установить(Истина);
		ТребуетсяОбновитьИнтерфейс = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Отключение организаций от сервиса.
//
// Параметры:
//  МассивОрганизаций			 - Массив - отключаемые организации.
//  РежимОтключенияВСервисе		 - Булево - Истина - отключение в сервисе, Ложь - только локально.
//  Отказ						 - Булево - Возвращает результат исполнения.
//  ТребуетсяОбновитьИнтерфейс	 - Булево - Возвращает Истина, если после исполнения требуется обновления интерфейса.
//
Процедура ОтключитьОрганизации(МассивОрганизаций, РежимОтключенияВСервисе, Отказ, ТребуетсяОбновитьИнтерфейс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОрганизацииБизнесСеть.Организация КАК Ссылка
	|ИЗ
	|	РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть";
	
	Если МассивОрганизаций <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "ГДЕ ОрганизацииБизнесСеть.Организация В(&МассивОрганизаций)";
		Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	УстановитьПривилегированныйРежим(Ложь);
	
	РежимУдаления = Истина;
	
	Если РежимОтключенияВСервисе Тогда
		
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("МассивОрганизаций", МассивОрганизаций);
		ПараметрыКоманды = ПараметрыКомандыОтключениеОрганизации(ПараметрыМетода, Отказ);
		Результат = ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыОчисткиДанных = Новый Структура("МассивОрганизаций", МассивОрганизаций);
	ОбновитьИдентификаторыБизнесСети(ПараметрыОчисткиДанных, РежимУдаления);
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОрганизацииБизнесСеть.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть";
	
	Запрос.Текст = ТекстЗапроса;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		// Не осталось ни одной подключенной организации, требуется удалить пользователей и идентификатор клиента.
		ПараметрыОчисткиДанных.Вставить("МассивПользователей");
		ПараметрыОчисткиДанных.Вставить("ИдентификаторПрограммы");
		ОбновитьИдентификаторыБизнесСети(ПараметрыОчисткиДанных, РежимУдаления);
		
		// Очистка параметров соединения.
		СохранитьПараметрыСоединенияВСеансе(Неопределено);
		ТребуетсяОбновитьИнтерфейс = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Обновление пользователей в сервисе по данным информационной базы.
//
// Параметры:
//   ТекущийАбонент - Строка - идентификатор абонента в сервисе.
//   ОбновлятьИдентификаторыДоступа - Булево.
//   Результат - Структура - результат выполнения, см БизнесСетьКлиентСервер.ОписаниеРезультатаКомандыСервиса().
//   Отказ - Булево - признак ошибки выполнения.
//
Процедура ОбновитьПользователейВСервисе(ТекущийАбонент, ОбновлятьИдентификаторыДоступа, Отказ) Экспорт
	
	// Получение списка подключенных абонентов, по-умолчанию берем первого абонента из списка.
	Если ТекущийАбонент = Неопределено Тогда
		
		ПараметрыКоманды = ПараметрыКомандыПолучитьСписокАбонентов();
		Результат = ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыКоманды = Новый Структура;
	
	Если ОбновлятьИдентификаторыДоступа Тогда
		
		// Обновление идентификатора информационной базы в сервисе.
		ИдентификаторПрограммы = Строка(Новый УникальныйИдентификатор);
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("ИдентификаторПрограммы", ИдентификаторПрограммы);
		ПараметрыКоманды = ПараметрыКомандыОбновитьИдентификаторПрограммы(ПараметрыМетода);
		Результат = ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыОбновления = Новый Структура("ИдентификаторПрограммы", ИдентификаторПрограммы);
		ОбновитьИдентификаторыБизнесСети(ПараметрыОбновления);
		
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Данные");
	ПараметрыМетода.Вставить("МассивПользователей");
	ПараметрыМетода.Вставить("ИдентификаторПрограммы");
	СформироватьДанныеСинхронизацииПользователя(ПараметрыМетода, ОбновлятьИдентификаторыДоступа);
	
	Если ПараметрыМетода.МассивПользователей.Количество() Тогда
		ПараметрыКоманды = ПараметрыКомандыСинхронизацияПользователей(ПараметрыМетода);
		Результат = ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	// Обновление данных в кэше информационной базы.
	ПараметрыОбновления = Новый Структура("МассивПользователей", ПараметрыМетода.МассивПользователей);
	ОбновитьИдентификаторыБизнесСети(ПараметрыОбновления);
	
	Если ОбновлятьИдентификаторыДоступа Тогда
		СохранитьПараметрыСоединенияВСеансе(Неопределено);
	КонецЕсли;

КонецПроцедуры

// Статус регистрации организации в информационной базе.
//
// Параметры:
//  Организация - ОпределяемыйТип.Организация - ссылка на определяемый справочник Организация.
//                Если ссылка не указана, то проверятся, есть ли регистрация любой организации
//                в информационной базе.
//
// Возвращаемое значение:
//   Булево - признак регистрации организации.
//
Функция ОрганизацияЗарегистрирована(Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОрганизацииБизнесСеть.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
		|ГДЕ
		|	ОрганизацииБизнесСеть.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОрганизацииБизнесСеть.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть";
	КонецЕсли;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область ПараметрыКоманд

Функция ПараметрыКомандыПолучитьРеквизитыУчастника(ПараметрыМетода, Отказ = Неопределено) Экспорт

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	
	Если ПараметрыМетода.Свойство("Ссылка") И ЗначениеЗаполнено(ПараметрыМетода.Ссылка) Тогда
		Если ТипЗнч(ПараметрыМетода.Ссылка) = Метаданные.ОпределяемыеТипы.Организация.Тип.Типы()[0] Тогда
			ПараметрыМетода.ЭтоОрганизация = Истина;
			ЗаполнитьРеквизитыОрганизаций(ПараметрыМетода);
			ПараметрыКоманды.Наименование = НСтр("ru = 'Получение профиля организации.'");
		ИначеЕсли ТипЗнч(ПараметрыМетода.Ссылка) = Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип.Типы()[0] Тогда
			ПараметрыМетода.ЭтоКонтрагент = Истина;
			ЗаполнитьРеквизитыКонтрагентов(ПараметрыМетода);
			ПараметрыКоманды.Наименование = НСтр("ru = 'Получение профиля контрагента.'");
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыМетода.ЭтоОрганизация = Ложь И ПараметрыМетода.ЭтоКонтрагент = Ложь Тогда
		// Если не передан параметр, то считаем что это контрагент.
		ПараметрыМетода.ЭтоКонтрагент = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыМетода.ИНН) Тогда
		Если ПараметрыМетода.Свойство("Ссылка") И ЗначениеЗаполнено(ПараметрыМетода.Ссылка) Тогда
			ТестСообщения = НСтр("ru = 'Не заполнено свойство ""ИНН"" для ""%1"".'");
			ТестСообщения = СтрШаблон(ТестСообщения, ПараметрыМетода.Ссылка);
		Иначе
			ТестСообщения = НСтр("ru = 'Не заполнено свойство ""ИНН"".'");
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТестСообщения,,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстОшибки = "";
	Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(ПараметрыМетода.ИНН, ПараметрыМетода.КПП,
		ПараметрыМетода.Ссылка, Отказ, ТекстОшибки);
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
			НСтр("ru = 'Ошибка чтения данных в 1С:Бизнес-сеть:'") + " " + ТекстОшибки, "БизнесСеть");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыКоманды.Адрес = СтрШаблон("api/core/v1/organizations/%1/%2", Идентификаторы.ИНН, Идентификаторы.КПП);
	ПараметрыКоманды.Метод = "get";
	ПараметрыКоманды.Права = "bn_user";
	ПараметрыКоманды.Ошибки.Вставить(404, Неопределено);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Наименование",     "title");
	Реквизиты.Вставить("НаименованиеЕГРН", "titleFromFns");
	Реквизиты.Вставить("ИНН",              "inn");
	Реквизиты.Вставить("КПП",              "kpp");
	Реквизиты.Вставить("ДатаРегистрации",  "registrationDate");
	Реквизиты.Вставить("Адрес",            "address");
	Реквизиты.Вставить("Описание",         "description");
	Реквизиты.Вставить("ЭлектроннаяПочта", "email");
	Реквизиты.Вставить("Факс",    "fax");
	Реквизиты.Вставить("ОГРН",    "ogrn");
	Реквизиты.Вставить("Телефон", "phone");
	Реквизиты.Вставить("Сайт",    "site");
	ПараметрыКоманды.Вставить("ОбработкаРезультата", Реквизиты);
		
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыПроверкаКонтрагентов(ПараметрыМетода, Отказ = Неопределено) Экспорт

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	
	ДанныеКонтрагентов = Новый ТаблицаЗначений;
	ДанныеКонтрагентов.Колонки.Добавить("Ссылка");
	ДанныеКонтрагентов.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	ДанныеКонтрагентов.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка"));
	Для каждого ЭлементСписка Из ПараметрыМетода.СписокКонтрагентов Цикл
		НоваяСтрока = ДанныеКонтрагентов.Добавить();
		НоваяСтрока.Ссылка = ЭлементСписка;
	КонецЦикла;
	
	ЗаполнитьРеквизитыКонтрагентов(ДанныеКонтрагентов);
	
	// Формирование данных.
	ДанныеЗапроса = Новый Массив;
	Для каждого РеквизитыКонтрагента Из ДанныеКонтрагентов Цикл
		
		ТекстОшибки = "";
		Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(РеквизитыКонтрагента.ИНН, РеквизитыКонтрагента.КПП,
			РеквизитыКонтрагента.Ссылка, Отказ, ТекстОшибки);
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;

		ЭлементЗапроса = Новый Структура;
		ЭлементЗапроса.Вставить("inn", Идентификаторы.ИНН);
		ЭлементЗапроса.Вставить("kpp", Идентификаторы.КПП);
		ДанныеЗапроса.Добавить(ЭлементЗапроса);
		
	КонецЦикла;
	
	ПараметрыКоманды.Наименование = НСтр("ru = 'Проверка регистрации контрагента.'");
	ПараметрыКоманды.Адрес  = "api/core/v1/organizations/existence";
	ПараметрыКоманды.Метод  = "post";
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Данные = ЗначениеВJSON(ДанныеЗапроса);
	ПараметрыКоманды.Ошибки.Вставить(400, НСтр("ru = 'Ошибочное значение ИНН или КПП.'"));
	
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыОтправитьДокумент(ПараметрыМетода, Отказ = Неопределено) Экспорт

	ПараметрыКоманды     = ОписаниеПараметровКомандыСервиса();
	ПараметрыПолучатель  = Неопределено;
	ПараметрыОтправитель = Неопределено;
	
	Если ТипЗнч(ПараметрыМетода.Получатель) = Тип("Структура") Тогда
		ПараметрыПолучатель = ПараметрыМетода.Получатель;
	Иначе
		ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ПараметрыМетода.Получатель, ПараметрыПолучатель);
	КонецЕсли;
	
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ПараметрыМетода.Отправитель, ПараметрыОтправитель);
	
	ТекстОшибки = "";
	ИдентификаторыОтправителя = БизнесСетьКлиентСервер.ИдентификаторыУчастника(ПараметрыОтправитель.ИНН, ПараметрыОтправитель.КПП,
		ПараметрыМетода.Отправитель, Отказ, ТекстОшибки);
	ИдентификаторыПолучателя = БизнесСетьКлиентСервер.ИдентификаторыУчастника(ПараметрыПолучатель.ИНН, ПараметрыПолучатель.КПП,
		ПараметрыМетода.Получатель, Отказ, ТекстОшибки);

	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
			НСтр("ru = 'Ошибка отправки документов через 1С:Бизнес-сеть:'") + " "
			+ ТекстОшибки, "БизнесСеть");
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеОрганизации = Новый Структура;
	СтруктураПолучателя = Новый Структура("inn, kpp", ИдентификаторыПолучателя.ИНН, ИдентификаторыПолучателя.КПП);
	СтруктураОтправителя = Новый Структура("inn, kpp", ИдентификаторыОтправителя.ИНН,	ИдентификаторыОтправителя.КПП);
		
	СтрокаДвоичныхДанных = Base64Строка(ПолучитьИзВременногоХранилища(ПараметрыМетода.АдресХранилища));	
	ДанныеОрганизации.Вставить("destinationOrganization", СтруктураПолучателя);
	ДанныеОрганизации.Вставить("sourceOrganization", СтруктураОтправителя);
	ДанныеОрганизации.Вставить("documentDataType", "v8." + XMLСтрока(ПараметрыМетода.ВидЭД)); // Тип документа.
	ДанныеОрганизации.Вставить("documentData",  СтрокаДвоичныхДанных);
	ДанныеОрганизации.Вставить("documentTitle", ПараметрыМетода.Заголовок);
	ДанныеОрганизации.Вставить("documentGuid",  Строка(ПараметрыМетода.Ссылка.УникальныйИдентификатор()));
	ДанныеОрганизации.Вставить("info",          ПараметрыМетода.СопроводительнаяИнформация);
	ДанныеОрганизации.Вставить("moneyAmount",   ПараметрыМетода.Сумма * 100); // Сумма документа в копейках.
	ДанныеОрганизации.Вставить("metaData",      ПараметрыМетода.Ссылка.Метаданные().Имя); // Доп. информация.
	
	// Добавление представление документа PDF.
	Если ПараметрыМетода.Свойство("АдресХранилищаПредставления") 
		И ЗначениеЗаполнено(ПараметрыМетода.АдресХранилищаПредставления) Тогда
		ДвоичныеДанные = Base64Строка(ПолучитьИзВременногоХранилища(ПараметрыМетода.АдресХранилищаПредставления));
		Если ДвоичныеДанные <> Неопределено Тогда
			ДанныеОрганизации.Вставить("documentPresentationData", ДвоичныеДанные);
			ДанныеОрганизации.Вставить("documentPresentationDataType", "pdf");
		КонецЕсли;
	КонецЕсли;
	
	ПерсональныеДанные = Новый Структура;
	Если ЗначениеЗаполнено(ПараметрыМетода.КонтактноеЛицо) Тогда
		ПерсональныеДанные.Вставить("name", ПараметрыМетода.КонтактноеЛицо);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыМетода.Телефон) Тогда
		ПерсональныеДанные.Вставить("phone", ПараметрыМетода.Телефон);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыМетода.ЭлектроннаяПочта) Тогда
		ПерсональныеДанные.Вставить("email", ПараметрыМетода.ЭлектроннаяПочта);
	КонецЕсли;
	Если ПараметрыМетода.Свойство("УведомлятьПоПочте") Тогда
		ПерсональныеДанные.Вставить("notifyByEmail", ПараметрыМетода.УведомлятьПоПочте);
	КонецЕсли;
	ДанныеОрганизации.Вставить("person", ПерсональныеДанные);
	
	Если ПараметрыМетода.Свойство("ИдентификаторыПредложений") Тогда
		ДанныеОрганизации.Вставить("contextName", "CAMPAIGN"); // Служебное наименование типа.
		ДанныеОрганизации.Вставить("contextIds", ПараметрыМетода.ИдентификаторыПредложений);
	КонецЕсли;
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	
	Данные = ЗначениеВJSON(ДанныеОрганизации);
	
	ПараметрыКоманды.Наименование = НСтр("ru = 'Отправка документа.'");
	ПараметрыКоманды.Данные = Данные;
	ПараметрыКоманды.Адрес = "api/edi/v1/documents";
	ПараметрыКоманды.Метод = "post";
	ПараметрыКоманды.Права = "bn_user";
	ПараметрыКоманды.Ошибки.Вставить(404,
		СтрШаблон(НСтр("ru = 'Ошибка отправки документа %1.'"), ПараметрыМетода.Заголовок));
		
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыСписокВходящихДокументов(ПараметрыМетода, Отказ = Неопределено) Экспорт

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	
	РежимРегистрацииОрганизаций = ?(ПараметрыМетода.Свойство("РежимРегистрацииОрганизаций"),
		ПараметрыМетода.РежимРегистрацииОрганизаций, Ложь);
	
	Если ПараметрыМетода.Свойство("МассивОрганизаций") Тогда
		
		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
			ПараметрыМетода.МассивОрганизаций, "ИНН, КПП");
		МассивСтруктурыДанных = Новый Массив;
		Для каждого ЗначениеМассива Из ПараметрыМетода.МассивОрганизаций Цикл
			
			ТекстОшибки = "";
			Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(РеквизитыОрганизации.Получить(ЗначениеМассива).ИНН,
				РеквизитыОрганизации.Получить(ЗначениеМассива).КПП,	ЗначениеМассива, Отказ, ТекстОшибки);
			Если Отказ Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
					НСтр("ru = 'Ошибка чтения данных 1С:Бизнес-сеть по организации:'") + " "
					+ ТекстОшибки, "БизнесСеть");
				Возврат Неопределено;
			КонецЕсли;
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("inn", Идентификаторы.ИНН);
			СтруктураДанных.Вставить("kpp", Идентификаторы.КПП);
			МассивСтруктурыДанных.Добавить(СтруктураДанных);
			
		КонецЦикла;
		
		Данные = ЗначениеВJSON(МассивСтруктурыДанных);
		
		ПараметрыЗапроса = Новый Структура;
		Если ПараметрыМетода.Свойство("ОтборКонтрагент") Тогда
			РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ПараметрыМетода.ОтборКонтрагент, "ИНН, КПП");
				
			ТекстОшибки = "";
			Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(РеквизитыКонтрагента.ИНН, РеквизитыКонтрагента.КПП,
				ПараметрыМетода.ОтборКонтрагент, Отказ, ТекстОшибки);
			Если Отказ Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
					НСтр("ru = 'Ошибка отбора по контрагенту при чтении документов 1С:Бизнес-сеть:'") + " "
					+ ТекстОшибки, "БизнесСеть");
				Возврат Неопределено;
			КонецЕсли;
			
			ПараметрыЗапроса.Вставить("senderInn", Идентификаторы.ИНН);
			ПараметрыЗапроса.Вставить("senderKpp", Идентификаторы.КПП);
			
		КонецЕсли;
		
		Если ПараметрыМетода.Свойство("ОтборВидДокумента") Тогда
			ВидДокумента = КодироватьСтроку(XMLСтрока(ПараметрыМетода.ОтборВидДокумента),
				СпособКодированияСтроки.КодировкаURL);
			ПараметрыЗапроса.Вставить("docType", "v8." + ВидДокумента);
		КонецЕсли;
		
		// Получение списка документов без данных.
		ПараметрыЗапроса.Вставить("withData", "false");

		Если ПараметрыМетода.Свойство("РежимИсходящихДокументов") Тогда
			ПараметрыЗапроса.Вставить("inbound", ?(ПараметрыМетода.РежимИсходящихДокументов,"false", "true"));
			Если ПараметрыМетода.Свойство("ОтборТолькоНовые") Тогда
				ПараметрыЗапроса.Вставить("deliveryStatus", "SENT");
			КонецЕсли;
		Иначе
			Если ПараметрыМетода.Свойство("ОтборТолькоНовые") Тогда
				ПараметрыЗапроса.Вставить("deliveryStatus", "SENT");
			КонецЕсли;
		КонецЕсли;
		
		СтрокаПараметровЗапроса = ПреобразоватьВСтрокуПараметровHTML(ПараметрыЗапроса);
		
		ПараметрыКоманды.Адрес  = СтрШаблон("api/edi/v1/organizations/documents%1", СтрокаПараметровЗапроса);
		ПараметрыКоманды.Метод  = "post";
		ПараметрыКоманды.Данные = Данные;
		ПараметрыКоманды.Ошибки.Вставить(404, Ложь);
		
	Иначе
		
		ПараметрыОрганизации = Неопределено;
		ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ПараметрыМетода.Организация, ПараметрыОрганизации);
		
		ТекстОшибки = "";
		Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(ПараметрыОрганизации.ИНН, ПараметрыОрганизации.КПП);
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
				НСтр("ru = 'Ошибка чтения документов в 1С:Бизнес-сеть:'") + " " + ТекстОшибки, "БизнесСеть");
			Возврат Неопределено;
		КонецЕсли;
		
		ПараметрыКоманды.Адрес = СтрШаблон("api/edi/v1/organizations/%1/%2/documents?fromTime=%3",
			Идентификаторы.ИНН, Идентификаторы.КПП,	Формат(ПараметрыМетода.ДатаСинхронизации, "ДФ=dd-MM-yyyy-HH-mm-ss"));
		ПараметрыКоманды.Метод = "get";
		ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Не найдена организация в сервисе 1С:Бизнес-сеть.'"));
		
	КонецЕсли;
	
	Если РежимРегистрацииОрганизаций Тогда
		ПараметрыКоманды.Наименование = НСтр("ru = 'Проверка прав организации.'");
		ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Ошибка регистрации организации в сервисе 1С:Бизнес-сеть.
			|Возможно организация зарегистрирована под другой учетной записью.'"));
	Иначе
		ПараметрыКоманды.Наименование = НСтр("ru = 'Получение списка документов.'");
		ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав на получение данных организации в сервисе 1С:Бизнес-сеть.'"));
	КонецЕсли;
	ПараметрыКоманды.Права = "bn_user";
	
	Возврат ПараметрыКоманды;
	
КонецФункции

Функция ПараметрыКомандыПолучитьДокументы(ПараметрыМетода, Отказ = Неопределено) Экспорт

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
		
	ИдентификаторыДокументов = Новый Соответствие;
	Если ПараметрыМетода.Свойство("МассивСсылокНаОбъект") Тогда
		МассивДокументов = Новый Массив;
		
		Для каждого ЗначениеМассива Из ПараметрыМетода.МассивСсылокНаОбъект Цикл
			Если ТипЗнч(ЗначениеМассива) = Тип("Число") ИЛИ ТипЗнч(ЗначениеМассива) = Тип("Строка") Тогда // ТорговыеПредложения.
				УникальныйИдентификатор = ЗначениеМассива;
			Иначе
				УникальныйИдентификатор = Строка(ЗначениеМассива.УникальныйИдентификатор());
			КонецЕсли;
			МассивДокументов.Добавить(УникальныйИдентификатор);
			ИдентификаторыДокументов.Вставить(УникальныйИдентификатор, ЗначениеМассива);
		КонецЦикла; 
		Данные = ЗначениеВJSON(МассивДокументов);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыМетода.Вставить("ИдентификаторыДокументов", ИдентификаторыДокументов);
	
	Адрес = СтрШаблон("api/edi/v1/documents/byIdOrGuid?direction=%1",
		?(ПараметрыМетода.РежимВходящихДокументов, "INBOUND", "OUTBOUND"));
	ПередаватьДанные = Ложь;
	Если ПараметрыМетода.Свойство("withData",     ПередаватьДанные) Тогда
		Адрес = Адрес + СтрШаблон("&withData=%1", Формат(ПередаватьДанные, "БЛ=false; БИ=true"));
	КонецЕсли;
	
	ПараметрыКоманды.Наименование = НСтр("ru = 'Получение документов по списку.'");
	ПараметрыКоманды.Адрес  = Адрес;
	ПараметрыКоманды.Метод  = "post";
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Данные = Данные;
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав на получение документа.'"));
	ПараметрыКоманды.Ошибки.Вставить(404, Ложь);
	
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыУдалитьДокументы(ПараметрыМетода, Отказ = Неопределено) Экспорт

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	РеквизитыОрганизации = Неопределено;
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ПараметрыМетода.Организация, РеквизитыОрганизации);
	Адрес = "api/edi/v1/organizations/%1/%2/documents?direction=%3";
	
	ТекстОшибки = "";
	Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(РеквизитыОрганизации.ИНН, РеквизитыОрганизации.КПП,
		ПараметрыМетода.Организация, Отказ, ТекстОшибки);

	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
			НСтр("ru = 'Ошибка удаления документов в 1С:Бизнес-сеть:'") + " " + ТекстОшибки, "БизнесСеть");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыКоманды.Адрес = СтрШаблон(Адрес, Идентификаторы.ИНН, Идентификаторы.КПП,
		?(ПараметрыМетода.РежимИсходящихДокументов, "OUTBOUND", "INBOUND"));
		
	ПараметрыКоманды.Наименование = НСтр("ru = 'Удаление документов в сервисе.'");
	ПараметрыКоманды.Метод = "post";
	ПараметрыКоманды.Права = "bn_user";
	ПараметрыКоманды.Данные = ЗначениеВJSON(ПараметрыМетода.МассивИдентификаторов);
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав на документ.'"));
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Организация или документ в сервисе не найден.'"));

	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыИзменитьСтатусыДокументов(ПараметрыМетода, Отказ = Неопределено) Экспорт
	
	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	
	Данные = Неопределено;
	ИдентификаторыДокументов = Новый Соответствие;
	Если ПараметрыМетода.Свойство("МассивДанных") Тогда
		
		МассивДокументов = Новый Массив;
		Для каждого ЗначениеМассива Из ПараметрыМетода.МассивДанных Цикл
			СтруктураСтатуса = Новый Структура;
			СтруктураСтатуса.Вставить("id", ЗначениеМассива.Идентификатор);
			Если ВРег(ПараметрыМетода.Статус) = ВРег("Отклонен") Тогда
				Если ЗначениеЗаполнено(ЗначениеМассива.Ссылка) Тогда
					СтруктураСтатуса.Вставить("documentGuid", Строка(ЗначениеМассива.Ссылка.УникальныйИдентификатор()));
				КонецЕсли;
				СтруктураСтатуса.Вставить("metaData", НСтр("ru = 'Дата отклонения:'") + ТекущаяДатаСеанса());
				СтруктураСтатуса.Вставить("deliveryStatus", "REJECTED");
			Иначе // По умолчанию статус "Загружен".
				СтруктураСтатуса.Вставить("documentGuid", Строка(ЗначениеМассива.Ссылка.УникальныйИдентификатор()));
				СтруктураСтатуса.Вставить("metaData", НСтр("ru = 'Дата загрузки:'") + ТекущаяДатаСеанса());
				СтруктураСтатуса.Вставить("deliveryStatus", "DELIVERED");
			КонецЕсли;
			МассивДокументов.Добавить(СтруктураСтатуса);
		КонецЦикла;
		Данные = ЗначениеВJSON(МассивДокументов);
		
	КонецЕсли;
	
	ПараметрыКоманды.Наименование = НСтр("ru = 'Изменение статусов документов.'");
	ПараметрыКоманды.Адрес  = "api/edi/v1/documents/status";
	ПараметрыКоманды.Метод  = "post";
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Данные = Данные;
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав доступа или документ в сервисе не найден.'"));
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Документ в сервисе не найден.'"));
	
	Возврат ПараметрыКоманды;
	
КонецФункции

Функция ПараметрыКомандыОтправкаПриглашенийКонтрагентам(ПараметрыМетода, Отказ = Неопределено) Экспорт
	
	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	
	РеквизитыОрганизации = Неопределено; 
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ПараметрыМетода.Организация, РеквизитыОрганизации);
	
	СписокПриглашений = Новый Массив;
	ТекстОшибки = "";
	Для каждого РеквизитыКонтрагента Из ПараметрыМетода.Данные Цикл
		ДанныеПриглашения = Новый Структура;
		
		Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(РеквизитыКонтрагента.ИНН, РеквизитыКонтрагента.КПП,
			РеквизитыКонтрагента.Наименование, Отказ, ТекстОшибки);
			
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
				НСтр("ru = 'Ошибка отправки приглашения в 1С:Бизнес-сеть:'") + " " + ТекстОшибки, "БизнесСеть");
			Возврат Неопределено;
		КонецЕсли;
		
		ДанныеПриглашения.Вставить("inn",   Идентификаторы.ИНН);
		ДанныеПриглашения.Вставить("kpp",   Идентификаторы.КПП);
		ДанныеПриглашения.Вставить("title", РеквизитыКонтрагента.Наименование);
		ДанныеПриглашения.Вставить("email", РеквизитыКонтрагента.ЭлектроннаяПочта);
		СписокПриглашений.Добавить(ДанныеПриглашения);
	КонецЦикла;
	
	Если ПараметрыМетода.РольОтправителя = "Продавец" Тогда
		РольОтправителя = "shipper";
	ИначеЕсли ПараметрыМетода.РольОтправителя = "Покупатель" Тогда
		РольОтправителя = "customer";
	Иначе
		РольОтправителя = "general";
	КонецЕсли;
	
	ТекстОшибки = "";
	Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(РеквизитыОрганизации.ИНН, РеквизитыОрганизации.КПП,
		ПараметрыМетода.Организация, Отказ, ТекстОшибки);
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
			ТекстОшибки, "БизнесСеть");
		Возврат Неопределено;
	КонецЕсли;

	Адрес = СтрШаблон("api/core/v1/organization/%1/%2/invitations?role=%3",
		Идентификаторы.ИНН, Идентификаторы.КПП, РольОтправителя);
		
	ПараметрыКоманды.Наименование = НСтр("ru = 'Отправка приглашений контрагентам для регистрации в сервисе.'");
	ПараметрыКоманды.Метод  = "post";
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Адрес  = Адрес;
	ПараметрыКоманды.Данные = ЗначениеВJSON(СписокПриглашений);
	ПараметрыКоманды.Ошибки.Вставить(400, НСтр("ru = 'Превышено максимальное количество приглашений или ошибка параметров.'"));
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав для отправки приглашения.'"));
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Не найдена организация в сервисе.'"));
	
	Возврат ПараметрыКоманды;
	
КонецФункции

Функция ПараметрыКомандыОтправкаПриглашения(ПараметрыМетода, Отказ = Неопределено) Экспорт

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
		
	ПараметрыОрганизации = Неопределено;
	ПараметрыКонтрагента = Неопределено;
	
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ПараметрыМетода.Организация, ПараметрыОрганизации);
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ПараметрыМетода.Контрагент,  ПараметрыКонтрагента);
	
	Если Не ЗначениеЗаполнено(ПараметрыМетода.ЭлектроннаяПочта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан адрес электронной почты контрагента.'")
			+ " " + ПараметрыМетода.Контрагент,,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстОшибки = "";
	ИдентификаторыОрганизации = БизнесСетьКлиентСервер.ИдентификаторыУчастника(ПараметрыОрганизации.ИНН,
		ПараметрыОрганизации.КПП, ПараметрыМетода.Организация, Отказ, ТекстОшибки);
	ИдентификаторыКонтрагента = БизнесСетьКлиентСервер.ИдентификаторыУчастника(ПараметрыКонтрагента.ИНН,
		ПараметрыКонтрагента.КПП, ПараметрыМетода.Контрагент, Отказ, ТекстОшибки);
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
			НСтр("ru = 'Ошибка отправки приглашения в 1С:Бизнес-сеть:'") + " " + ТекстОшибки, "БизнесСеть");
	КонецЕсли;
	
	ПараметрыКоманды.Наименование = НСтр("ru = 'Отправка приглашения регистрации в сервисе.'");
	Адрес = СтрШаблон("api/core/v1/organizations/%1/%2/invitation?dstEmail=%3&dstTitle=%4&srcInn=%5&srcKpp=%6",
		ИдентификаторыКонтрагента.ИНН, ИдентификаторыКонтрагента.КПП,
		ПараметрыМетода.ЭлектроннаяПочта,
		КодироватьСтроку(ПараметрыКонтрагента.ОфициальноеНаименование, СпособКодированияСтроки.КодировкаURL),
		ИдентификаторыОрганизации.ИНН, ИдентификаторыОрганизации.КПП);
	ПараметрыКоманды.Адрес = Адрес;
	ПараметрыКоманды.Метод = "post";
	ПараметрыКоманды.Права = "bn_user";
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав для отправки приглашения.'"));
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Не найдена организация в сервисе.'"));
	
	Возврат ПараметрыКоманды;
	
КонецФункции

Функция ПараметрыКомандыОтправитьУведомлениеОбОтправке(ПараметрыМетода) Экспорт

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	
	РеквизитыКонтрагента = Неопределено; 
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ПараметрыМетода.Получатель, РеквизитыКонтрагента);
	
	Адрес = "api/core/v1/organization/invitation/?dstEmail=%1&dstTitle=%2&attachDoc=true";
	ПараметрыКоманды.Наименование = НСтр("ru = 'Отправка уведомления об отправке документа.'");
	ПараметрыКоманды.Адрес = СтрШаблон(Адрес, ПараметрыМетода.ЭлектроннаяПочта,
		КодироватьСтроку(РеквизитыКонтрагента.ОфициальноеНаименование, СпособКодированияСтроки.КодировкаURL));
	ПараметрыКоманды.Метод  = "post";
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Данные = ЗначениеВJSON(ПараметрыМетода.МассивИдентификаторов);
	ПараметрыКоманды.Ошибки.Вставить(400, НСтр("ru = 'Ошибка формирования приглашений.'"));
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав доступа к документу в сервисе.'"));
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Не найден документ в сервисе.'"));

	Возврат ПараметрыКоманды;

КонецФункции

#КонецОбласти

#Область ОписаниеПараметров

// Описание контактной информации пользователя.
//
Функция ОписаниеКонтактнойИнформацииПользователя() Экспорт
	
	СтруктураКонтактов = Новый Структура;
	СтруктураКонтактов.Вставить("ФИО", "");
	СтруктураКонтактов.Вставить("ЭлектроннаяПочта", "");
	СтруктураКонтактов.Вставить("Телефон", "");
	
	Возврат СтруктураКонтактов;
	
КонецФункции

Функция ОписаниеПараметровКомандыСервиса() Экспорт
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Сервис",       ""); // Имя сервиса, например "Рубрикатор", по-умолчанию Бизнес-сеть.
	ПараметрыКоманды.Вставить("Наименование", ""); // Полное наименование метода.
	ПараметрыКоманды.Вставить("Адрес",        ""); // Адрес URI метода.
	ПараметрыКоманды.Вставить("Метод",        ""); // Метод HTTP соединения, например POST.
	ПараметрыКоманды.Вставить("Права",        ""); // Необходимые права команды bn_user, bn_its
	ПараметрыКоманды.Вставить("Данные"); // Двоичные данные или строка.
	ПараметрыКоманды.Вставить("Ошибки", Новый Соответствие); // Соответствие ошибок, например "404", "Не найдено".
	ПараметрыКоманды.Вставить("БлокироватьСообщенияОбОшибках"); // Не выводить сообщения об ошибках.
	ПараметрыКоманды.Вставить("ОбработкаРезультата"); // Описание конвертации данных результата.
	
	Возврат ПараметрыКоманды;
		
КонецФункции

#КонецОбласти

#Область ПреобразованиеДанных

// Получение значения в формате JSON.
//
Функция ЗначениеВJSON(Данные, ПараметрыЗаписи = Неопределено) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Возврат списка доступных для обмена видов документов со строковым представлением.
//
// Возвращаемое значение:
//   СписокЗначений - список с видами электронных документов.
//
Функция ВидыДокументовСервиса() Экспорт
	
	СписокВидовЭД = Новый СписокЗначений;
	СписокВидовЭД.Добавить(Перечисления.ВидыЭД.АктИсполнитель,    НСтр("ru = 'Акт выполненных работ'"));
	СписокВидовЭД.Добавить(Перечисления.ВидыЭД.АктНаПередачуПрав, НСтр("ru = 'Акт передачи прав'"));
	СписокВидовЭД.Добавить(Перечисления.ВидыЭД.ОтветНаЗаказ,      НСтр("ru = 'Заказ покупателя'"));
	СписокВидовЭД.Добавить(Перечисления.ВидыЭД.ЗаказТовара,       НСтр("ru = 'Заказ поставщику'"));
	СписокВидовЭД.Добавить(Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиОтправитель,
		НСтр("ru = 'Корректировка стоимости'"));
	СписокВидовЭД.Добавить(Перечисления.ВидыЭД.ТОРГ12Продавец,    НСтр("ru = 'Товарная накладная'"));
	СписокВидовЭД.Добавить(Перечисления.ВидыЭД.ОтчетОПродажахКомиссионногоТовара,
		НСтр("ru = 'Отчет о продажах комиссионного товара'"));
	СписокВидовЭД.Добавить(Перечисления.ВидыЭД.ОтчетОСписанииКомиссионногоТовара,
		НСтр("ru = 'Отчет о списании комиссионного товара'"));
	СписокВидовЭД.Добавить(Перечисления.ВидыЭД.ПрайсЛист,         НСтр("ru = 'Прайс-лист'"));
	СписокВидовЭД.Добавить(Перечисления.ВидыЭД.СчетНаОплату,      НСтр("ru = 'Счет на оплату'"));
		
	Возврат СписокВидовЭД;
	
КонецФункции

// Возвращает признак установки функциональной опции 1С:Бизнес-сеть.
//
Функция ИспользоватьОбменБизнесСеть() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьОбменБизнесСеть");
	
КонецФункции

// Изменение использования регламентного задания.
//
// Параметры:
//  ИмяЗадания			- Строка - наименование регламентного задания.
//  ИмяПараметра		- Строка - наименование параметра, например "Использование".
//  ЗначениеПараметра	- Произвольный - признак использования регламентного задания.
//
Процедура ИзменитьРегламентноеЗадание(ИмяЗадания, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	ПараметрыПоиска = Новый Структура("Метаданные", ИмяЗадания);
	МассивРегламентныхЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыПоиска);
	РегламентноеЗадание = ?(МассивРегламентныхЗаданий.Количество() = 0, Неопределено, МассивРегламентныхЗаданий[0]);
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить(ИмяПараметра, ЗначениеПараметра);
	РегламентныеЗаданияСервер.ИзменитьЗадание(РегламентноеЗадание.УникальныйИдентификатор, ПараметрыЗадания);

КонецПроцедуры

// Заполнение реквизитов контрагентов.
//
// Параметры:
//   Данные - Структура, ТаблицаЗначений:
//     * Ссылка - СправочникСсылка - ссылка контрагента (обязательный).
//     * Наименование - Строка - полное наименование контрагента.
//     * ИНН - Строка - ИНН.
//     * КПП - Строка - КПП.
//
Процедура ЗаполнитьРеквизитыКонтрагентов(Данные) Экспорт

	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП
	|ИЗ
	|	&Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В(&СписокСсылок)";
	
	ИмяСправочникаКонтрагенты = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяПрикладногоСправочника("Контрагенты");
	РеквизитНаименование = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("НаименованиеКонтрагента");
	РеквизитИНН = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННКонтрагента");
	РеквизитКПП = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППКонтрагента");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Контрагенты", "Справочник." + ИмяСправочникаКонтрагенты);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Контрагенты.Наименование", "Контрагенты." + РеквизитНаименование);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Контрагенты.ИНН", "Контрагенты." + РеквизитИНН);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Контрагенты.КПП", "Контрагенты." + РеквизитКПП);
	Запрос.Текст = ТекстЗапроса;
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		СписокСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Данные.Ссылка);
	ИначеЕсли ТипЗнч(Данные) = Тип("ТаблицаЗначений") Тогда
		СписокСсылок = Данные.ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокСсылок", СписокСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Данные.Вставить("Наименование", Выборка.Наименование);
			Данные.Вставить("ИНН", Выборка.ИНН);
			Данные.Вставить("КПП", Выборка.КПП);
			Прервать;
		ИначеЕсли ТипЗнч(Данные) = Тип("ТаблицаЗначений") Тогда
			ЗаполнитьЗначенияСвойств(Данные.Найти(Выборка.Ссылка, "Ссылка"), Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполнение реквизитов организаций.
//
// Параметры:
//   Данные - Структура, ТаблицаЗначений:
//     * Ссылка - СправочникСсылка - ссылка организации (обязательный).
//     * Наименование - Строка - полное наименование организации.
//     * ИНН - Строка - ИНН.
//     * КПП - Строка - КПП.
//
Процедура ЗаполнитьРеквизитыОрганизаций(Данные) Экспорт

	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.Наименование КАК Наименование,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП
	|ИЗ
	|	&Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&СписокСсылок)";
	
	ИмяСправочникаОрганизации = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяПрикладногоСправочника("Организации");
	РеквизитНаименование = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("НаименованиеОрганизации");
	РеквизитИНН = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННОрганизации");
	РеквизитКПП = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППОрганизации");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Организации", "Справочник." + ИмяСправочникаОрганизации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организации.Наименование", "Организации." + РеквизитНаименование);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организации.ИНН",          "Организации." + РеквизитИНН);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организации.КПП",          "Организации." + РеквизитКПП);
	Запрос.Текст = ТекстЗапроса;
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		СписокСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Данные.Ссылка);
	ИначеЕсли ТипЗнч(Данные) = Тип("ТаблицаЗначений") Тогда
		СписокСсылок = Данные.ВыгрузитьКолонку("Ссылка");
		Если Данные.Колонки.Найти("Наименование") = Неопределено Тогда
			Данные.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
		КонецЕсли;
		Если Данные.Колонки.Найти("ИНН") = Неопределено Тогда
			Данные.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
		КонецЕсли;
		Если Данные.Колонки.Найти("КПП") = Неопределено Тогда
			Данные.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка"));
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокСсылок", СписокСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Данные.Вставить("Наименование", Выборка.Наименование);
			Данные.Вставить("ИНН", Выборка.ИНН);
			Данные.Вставить("КПП", Выборка.КПП);
			Прервать;
		ИначеЕсли ТипЗнч(Данные) = Тип("ТаблицаЗначений") Тогда
			ЗаполнитьЗначенияСвойств(Данные.Найти(Выборка.Ссылка, "Ссылка"), Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Права

// Проверяет возможность настройки взаимодействия в сервисе 1С:Бизнес-сеть для текущего пользователя.
//
// Возвращаемое значение:
//  Булево - наличие права на настройку обмена документами.
//
Функция ПравоНастройкиОбменаДокументами(ВыводитьСообщение = Ложь) Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьПраво = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ОрганизацииБизнесСеть);
	
	Если Не ЕстьПраво И ВыводитьСообщение Тогда
		ЭлектронноеВзаимодействиеСлужебный.СообщитьПользователюОНарушенииПравДоступа();
	КонецЕсли;
	
	Возврат ЕстьПраво;
	
КонецФункции

// Проверяет возможность чтения данных обмена документами в сервисе 1С:Бизнес-сеть для текущего пользователя.
//
// Параметры:
//  ВыводитьСообщение - Булево - признак необходимости вывода сообщения о недостаточности прав.
// 
// Возвращаемое значение:
//  Булево - наличие права на чтение настроек обмена документами.
//
Функция ПравоЧтенияНастроекОбменаДокументами(ВыводитьСообщение = Ложь) Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьПраво = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ОрганизацииБизнесСеть);
	
	Если Не ЕстьПраво И ВыводитьСообщение Тогда
		ЭлектронноеВзаимодействиеСлужебный.СообщитьПользователюОНарушенииПравДоступа();
	КонецЕсли;
		
	Возврат ЕстьПраво;
		
КонецФункции

// Проверяет возможность выполнения обмена документами в сервисе 1С:Бизнес-сеть для текущего пользователя.
//
// Параметры:
//  ВыводитьСообщение - Булево - признак необходимости вывода сообщения о недостаточности прав.
// 
// Возвращаемое значение:
//  Булево - наличие права на выполнение обмена.
//
Функция ПравоВыполненияОбменаДокументами(Пользователь = Неопределено, ВыводитьСообщение = Ложь) Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь(Пользователь) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьПраво = ПравоДоступа("Просмотр", Метаданные.ОбщиеКоманды.ВходящиеДокументыБизнесСеть, Пользователь)
		И ПравоЧтенияНастроекОбменаДокументами();
	
	Если Не ЕстьПраво И ВыводитьСообщение Тогда
		ЭлектронноеВзаимодействиеСлужебный.СообщитьПользователюОНарушенииПравДоступа();
	КонецЕсли;
		
	Возврат ЕстьПраво;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеТикетов

// Получение тикета в сервисе, в том числе из кэша.
//
Процедура ПолучитьТикет(Соединение, ПараметрыСоединения, ПараметрыКоманды, СохранятьПараметрыСеанса, Отказ)
	
	СвойстваТикета = Неопределено;
	
	// Проверка тикета в кэше.
	Если ПараметрыСоединения.Свойство("СписокТикетов") И ЗначениеЗаполнено(ПараметрыСоединения.СписокТикетов) Тогда
		СвойстваТикета = ПараметрыСоединения.СписокТикетов.Получить(ПараметрыКоманды.Права);
	КонецЕсли;
	
	// Проверка ключа в кэше и его срока действия.
	Если СвойстваТикета = Неопределено ИЛИ ТекущаяДатаСеанса() > СвойстваТикета.СрокЖизни Тогда
		
		// Подготовка и получение нового ключа.
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("ИдентификаторПрограммы", ПараметрыСоединения.ИдентификаторПрограммы);
		ПараметрыМетода.Вставить("Права", ПараметрыКоманды.Права);
		
		ПараметрыТикета = ПараметрыКомандыПолучениеКлюча(ПараметрыМетода, Отказ);
		ПараметрыТикета.Вставить("Права", ПараметрыКоманды.Права);
		ПолучитьНовыйТикет(Соединение, ПараметрыСоединения, ПараметрыТикета, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		СохранятьПараметрыСеанса = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Получение нового временного тикета в сервисе.
//
Процедура ПолучитьНовыйТикет(Соединение, ПараметрыСоединения, ПараметрыТикета, Отказ)

	КлючКлиента = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ПараметрыСоединения.ИдентификаторПрограммы + ":"));
	ТребуетсяПолноеОбновлениеТикета = Истина;
	
	// Проверка и обновление ключа по ключу регенерации refresh_token.
	СтруктураТикета = Неопределено;
	Если ПараметрыСоединения.Свойство("СписокТикетов") И ЗначениеЗаполнено(ПараметрыСоединения.СписокТикетов) Тогда
		СтруктураТикета = ПараметрыСоединения.СписокТикетов.Получить(ПараметрыТикета.Права);
	КонецЕсли;
	
	Если СтруктураТикета <> Неопределено Тогда
		АдресРесурса = "oauth/token?grant_type=refresh_token&refresh_token=" + СтруктураТикета.КлючРегенерации;
		
		Попытка
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic " + КлючКлиента);
			HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение
			Отказ = Истина;
			ВидОперации = НСтр("ru = 'Получение тикета'");
			ТекстОшибки = НСтр("ru = 'Ошибка соединения с сервисом 1С:Бизнес-сеть.'");
			ПодробныйТекстОшибки = ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, ТекстОшибки, "БизнесСеть");
		КонецПопытки;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			// Еще не истек срок жизни refresh-token.
			ТребуетсяПолноеОбновлениеТикета = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяПолноеОбновлениеТикета Тогда
		
		АдресРесурса = "oauth/token?grant_type=password&username=" + ПараметрыТикета.Логин
			+ "&password=" + КодироватьСтроку(ПараметрыТикета.Пароль, СпособКодированияСтроки.КодировкаURL);
		Попытка
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic " + КлючКлиента);
			HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение
			Отказ = Истина;
			ВидОперации = НСтр("ru = 'Получение тикета'");
			ТекстОшибки = НСтр("ru = 'Ошибка соединения с сервисом 1С:Бизнес-сеть.'");
			ПодробныйТекстОшибки = ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, ТекстОшибки, "БизнесСеть");
		КонецПопытки;
			
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ЗначениеИзСтрокиJSON(HTTPОтвет.ПолучитьТелоКакСтроку());
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		Отказ = Истина;
		ВидОперации = НСтр("ru = 'Аутентификация'");
		ТекстОшибки = НСтр("ru = 'Ошибка аутентификации в сервисе 1С:Бизнес-сеть.'");
		ПодробныйТекстОшибки = ТекстОшибки + Символы.ПС + СтрШаблон(НСтр("ru = 'Код состояния: %1.'"), HTTPОтвет.КодСостояния);
		Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("error_description") Тогда
			ПодробныйТекстОшибки = ПодробныйТекстОшибки + Символы.ПС + Результат.error_description;
		КонецЕсли;
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, ТекстОшибки, "БизнесСеть");
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСоединения.СписокТикетов) = Тип("ФиксированноеСоответствие") Тогда
		СписокТикетов = Новый Соответствие(ПараметрыСоединения.СписокТикетов);
	Иначе
		СписокТикетов = Новый Соответствие;
	КонецЕсли;
	
	// Сохранение тикета в кэше.
	СтруктураТикета = СписокТикетов[ПараметрыТикета.Права];
	СтруктураТикета = Новый Структура;
	СтруктураТикета.Вставить("Логин", ПараметрыТикета.Логин);
	СтруктураТикета.Вставить("Ключ", Результат.access_token);
	СтруктураТикета.Вставить("СрокЖизни", ТекущаяДатаСеанса() + Результат.expires_in);
	СтруктураТикета.Вставить("КлючРегенерации", Результат.refresh_token);
	СписокТикетов[ПараметрыТикета.Права] = Новый ФиксированнаяСтруктура(СтруктураТикета);
	ПараметрыСоединения.СписокТикетов = Новый ФиксированноеСоответствие(СписокТикетов);
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыКоманд

Функция ПараметрыКомандыПолучениеКлюча(ПараметрыМетода, Отказ = Неопределено)

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	
	ПараметрыКоманды.Вставить("Логин");
	ПараметрыКоманды.Вставить("Пароль");
	ПараметрыКоманды.Наименование = НСтр("ru = 'Получение тикета'");
	
	Если ПараметрыМетода.Права = "bn_its" Тогда
		
		Если ОбщегоНазначения.РазделениеВключено() Тогда
			УстановитьПривилегированныйРежим(Истина);
			ДанныеАутентификации = ИнтернетПоддержкаПользователей.ТикетАутентификацииНаПорталеПоддержки("1c-bn-access");
			УстановитьПривилегированныйРежим(Ложь);
			Если ЗначениеЗаполнено(ДанныеАутентификации.КодОшибки) Тогда
				Если ДанныеАутентификации.КодОшибки = "НеверныйЛогинИлиПароль" Тогда
					ИнтернетПоддержкаПользователейПодключена = Ложь;
				КонецЕсли;
				ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось подключиться к порталу интернет-поддержки по причине:
					           |%1'"),
					ДанныеАутентификации.СообщениеОбОшибке);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки,,,, Отказ);
				Возврат Неопределено;
			КонецЕсли;
			ПараметрыКоманды.Логин  = "AUTH_TOKEN";
			ПараметрыКоманды.Пароль = ДанныеАутентификации.Тикет;
			
		Иначе
			УстановитьПривилегированныйРежим(Истина);
			ПараметрыАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
			УстановитьПривилегированныйРежим(Ложь);
			Если ТипЗнч(ПараметрыАутентификации) = Тип("Структура") Тогда
				ПараметрыКоманды.Логин  = ПараметрыАутентификации.Логин;
				ПараметрыКоманды.Пароль = ПараметрыАутентификации.Пароль;
			Иначе
				ТекстОшибки = НСтр("ru = 'Отсутствует подключение к Интернет-поддержке пользователей.'");
				ТекстСообщения = ТекстОшибки + Символы.ПС + НСтр("ru ='Подробности см. в журнале регистрации.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
					ТекстОшибки, "БизнесСеть");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ПараметрыМетода.Свойство("АдминистраторАбонента") Тогда
		
		ПараметрыКоманды.Логин  = ПараметрыМетода.АдминистраторАбонента.Логин;
		ПараметрыКоманды.Пароль = ПараметрыМетода.АдминистраторАбонента.Пароль;
		
	ИначеЕсли ПараметрыМетода.Права = "bn_user" Тогда
		
		СтруктураИдентификации = ПараметрыАутентификацииПользователя();
		Если СтруктураИдентификации <> Неопределено Тогда
			ПараметрыКоманды.Логин  = СтруктураИдентификации.Логин;
			ПараметрыКоманды.Пароль = СтруктураИдентификации.Пароль;
		Иначе
			Если БизнесСеть.ОрганизацияЗарегистрирована() Тогда
				ТекстОшибки = НСтр("ru = 'Недостаточно прав для работы с сервисом 1С:Бизнес-сеть.
										 |Обратитесь к администратору.'");
			Иначе
				ТекстОшибки = НСтр("ru = 'Отсутствуют зарегистрированные организации в сервисе 1С:Бизнес-сеть.'");
			КонецЕсли;
			ТекстСообщения = ТекстОшибки + Символы.ПС + НСтр("ru ='Подробности см. в журнале регистрации.'");
			ТекстОшибки = НСтр("ru = 'Ошибка аутентификации в сервисе.'") + Символы.ПС + ТекстОшибки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
				ТекстОшибки, "БизнесСеть");
		КонецЕсли;
		
	КонецЕсли;

	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыПроверкаРегистрацииАбонента()

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	ПараметрыКоманды.Наименование = НСтр("ru = 'Проверка регистрации в сервисе.'");
	ПараметрыКоманды.Адрес = "api/core/v1/subscribers/existence";
	ПараметрыКоманды.Метод = "get";
	ПараметрыКоманды.Права = "bn_its";
		
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыРегистрацияАбонента(ПараметрыМетода, Отказ)

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	ПараметрыКоманды.Наименование = НСтр("ru = 'Регистрация организации в сервисе 1С:Бизнес-сеть.'");
	ПараметрыКоманды.Адрес  = "api/core/v1/subscribers";
	ПараметрыКоманды.Метод  = "post";
	ПараметрыКоманды.Данные = СформироватьДанныеРегистрацииАбонента(ПараметрыМетода, Отказ);
	ПараметрыКоманды.Права  = "bn_its";
	ПараметрыКоманды.Вставить("Идентификатор", ПараметрыМетода.ИдентификаторПрограммы);
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Ошибка регистрации организации в сервисе.'"));
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав для регистрации в сервисе.'"));
	
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыПолучитьСписокАбонентов()

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	ПараметрыКоманды.Наименование = НСтр("ru = 'Запрос списка абонентов.'");
	ПараметрыКоманды.Адрес = "api/core/v1/subscribers?withAdministrativePermissionsOnly=true";
	ПараметрыКоманды.Метод = "get";
	ПараметрыКоманды.Права = "bn_user";
	
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыРегистрацияОрганизации(ПараметрыМетода, Отказ)

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	РеквизитыОрганизации = Неопределено;
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ПараметрыМетода.Организация, РеквизитыОрганизации);
	
	ТекстОшибки = "";
	Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(РеквизитыОрганизации.ИНН, РеквизитыОрганизации.КПП,
		ПараметрыМетода.Организация, Отказ, ТекстОшибки);
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
			НСтр("ru = 'Ошибка регистрации организации в 1С:Бизнес-сеть:'") + " "+ ТекстОшибки, "БизнесСеть");
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеОрганизации = Новый Структура;
	ДанныеОрганизации.Вставить("inn", Идентификаторы.ИНН);
	ДанныеОрганизации.Вставить("kpp", Идентификаторы.КПП);
	
	Если РеквизитыОрганизации.Свойство("СокращенноеНаименование") Тогда
		НаименованиеОрганизации = РеквизитыОрганизации.СокращенноеНаименование;
	Иначе
		НаименованиеОрганизации = РеквизитыОрганизации.ПолноеНаименование;
	КонецЕсли;
	Если ПустаяСтрока(НаименованиеОрганизации) Тогда
		Отказ = Истина;
		ТекстОшибки = НСтр("ru = 'Не заполнено наименование организации.'");
		ПодробныйТекстОшибки = ТекстОшибки + Символы.ПС + ПараметрыКоманды.Адрес + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(НСтр("ru = 'Регистрация организации'"),
			ПодробныйТекстОшибки, ТекстОшибки, "БизнесСеть");
		Возврат Неопределено;
	КонецЕсли;
	ДанныеОрганизации.Вставить("title", НаименованиеОрганизации);
	
	ПараметрыКоманды.Наименование = НСтр("ru = 'Регистрация организации.'");
	ПараметрыКоманды.Адрес  = СтрШаблон("api/core/v1/subscribers/%1/organizations",
		Формат(ПараметрыМетода.Абонент, "ЧГ="));
	ПараметрыКоманды.Метод  = "post";
	ПараметрыКоманды.Данные = ЗначениеВJSON(ДанныеОрганизации);
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Ошибка регистрации организации.'"));
	
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыОтключениеОрганизации(ПараметрыМетода, Отказ)

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	СписокОрганизаций = Новый ТаблицаЗначений;
	СписокОрганизаций.Колонки.Добавить("Ссылка");
	СписокОрганизаций.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	СписокОрганизаций.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка"));
	Для каждого ЗначениеМассива Из ПараметрыМетода.МассивОрганизаций Цикл
		НоваяСтрока = СписокОрганизаций.Добавить();
		НоваяСтрока.Ссылка = ЗначениеМассива;
	КонецЦикла;
	ЗаполнитьРеквизитыОрганизаций(СписокОрганизаций);
	
	Данные = Новый Массив;
	Для каждого СтрокаТаблицы Из СписокОрганизаций Цикл
		ДанныеОрганизации = Новый Структура;
		
		ТекстОшибки = "";
		Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(СтрокаТаблицы.ИНН, СтрокаТаблицы.КПП,
			СтрокаТаблицы.Ссылка, Отказ, ТекстОшибки);
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
				НСтр("ru = 'Ошибка удаления организации в 1С:Бизнес-сеть:'") + " "+ ТекстОшибки, "БизнесСеть");
			Возврат Неопределено;
		КонецЕсли;

		ДанныеОрганизации.Вставить("inn", Идентификаторы.ИНН);
		ДанныеОрганизации.Вставить("kpp", Идентификаторы.КПП);

		Данные.Добавить(ДанныеОрганизации);
	КонецЦикла;
	
	ПараметрыКоманды.Наименование = НСтр("ru = 'Удаление организации из сервиса.'");
	ПараметрыКоманды.Адрес = "api/core/v1/organizations/delete";
	ПараметрыКоманды.Метод = "post";
	ПараметрыКоманды.Данные = ЗначениеВJSON(Данные);
	ПараметрыКоманды.Права = "bn_user";
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Организация не найдена.'"));
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав для удаления организации.'"));
	
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыСинхронизацияПользователей(ПараметрыМетода)

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	ПараметрыКоманды.Наименование = НСтр("ru = 'Синхронизация пользователей в сервисе.'");
	ПараметрыКоманды.Адрес  = СтрШаблон("api/core/v1/subscribers/subscriberMembers/sync?endpointGuid=%1",
		ПараметрыМетода.ИдентификаторПрограммы);
	ПараметрыКоманды.Метод  = "post";
	ПараметрыКоманды.Данные = ПараметрыМетода.Данные;
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Не найдена учетная запись для программы.'"));
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав для выполнения операции.'"));
	ПараметрыКоманды.Ошибки.Вставить(400, НСтр("ru = 'Пользователь принадлежит другой учетной записи.'"));

	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыПроверкаОрганизации(ПараметрыМетода, Отказ)

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	
	ТекстОшибки = "";
	Идентификаторы = БизнесСетьКлиентСервер.ИдентификаторыУчастника(ПараметрыМетода.ИНН, ПараметрыМетода.КПП,
		ПараметрыМетода.Ссылка, Отказ, ТекстОшибки);
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
			НСтр("ru = 'Ошибка проверки организации при регистрации в 1С:Бизнес-сеть:'") + " " + ТекстОшибки, "БизнесСеть");
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЗапроса = Новый Массив;
	
	СтруктураТела = Новый Структура;
	СтруктураТела.Вставить("inn", Идентификаторы.ИНН);
	СтруктураТела.Вставить("kpp", Идентификаторы.КПП); //+
	ДанныеЗапроса.Добавить(СтруктураТела);
	
	ПараметрыКоманды.Наименование = НСтр("ru = 'Проверка регистрации организации.'");
	ПараметрыКоманды.Адрес  = "api/core/v1/organizations/existence";
	ПараметрыКоманды.Метод  = "post";
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Данные = ЗначениеВJSON(ДанныеЗапроса);
	ПараметрыКоманды.Ошибки.Вставить(400, НСтр("ru = 'Ошибочное значение ИНН или КПП.'"));
		
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыОбновитьСтатус(ПараметрыМетода)

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	ИдентификаторыДокументов = Новый Соответствие;
	Если ПараметрыМетода.Свойство("МассивДанных") Тогда
		МассивДокументов = Новый Массив;
		Для каждого ЭлементМассива Из ПараметрыМетода.МассивДанных Цикл
			СтруктураСтатуса = Новый Структура;
			СтруктураСтатуса.Вставить("id", ЭлементМассива.Идентификатор);
			СтруктураСтатуса.Вставить("documentGuid", Строка(ЭлементМассива.Ссылка.УникальныйИдентификатор()));
			СтруктураСтатуса.Вставить("metaData", НСтр("ru = 'Дата загрузки:'") + ТекущаяДатаСеанса());
			МассивДокументов.Добавить(СтруктураСтатуса);
		КонецЦикла;
		Данные = ЗначениеВJSON(МассивДокументов);
	КонецЕсли;
	
	ПараметрыКоманды.Наименование = НСтр("ru = 'Обновление статуса документа.'");
	ПараметрыКоманды.Адрес  = "api/edi/v1/documents/statusDelivered";
	ПараметрыКоманды.Метод  = "post";
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Данные = Данные;
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав доступа или документ в сервисе не найден.'"));
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Документ в сервисе не найден.'"));
		
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыОбновитьИдентификаторПрограммы(ПараметрыМетода)

	ПараметрыКоманды = ОписаниеПараметровКомандыСервиса();
	Данные = Новый Структура;
	Данные.Вставить("title",        Метаданные.Синоним);
	Данные.Вставить("endpointGUID", ПараметрыМетода.ИдентификаторПрограммы);
	
	ПараметрыКоманды.Наименование = НСтр("ru = 'Обновление идентификатора программы.'");
	ПараметрыКоманды.Адрес  = "api/core/v1/endpoint";
	ПараметрыКоманды.Метод  = "put";
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Данные = ЗначениеВJSON(Данные);
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Не найден идентификатор программы.'"));
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав доступа для изменения идентификатора программы.'"));
	
	Возврат ПараметрыКоманды;

КонецФункции

#КонецОбласти

#Область ПреобразованиеДанных

// Общие настройки для подключения к сервису 1С:Бизнес-сеть.
//
Функция ОбщиеНастройкиСервиса()

	ПараметрыСоединения = Новый Структура;
	
	// Сервис 1С:Бизнес-сеть.
	ПараметрыСервисаБизнесСеть = Новый Соответствие;
	ПараметрыСервисаБизнесСеть.Вставить("ИмяСервера", "1cbn.ru");
	ПараметрыСервисаБизнесСеть.Вставить("Порт", 443);
	ПараметрыСервисаБизнесСеть.Вставить("ЗащищенноеСоединение", Истина);
	ПараметрыСервисаБизнесСеть.Вставить("ИспользуетсяАутентификация", Истина);
	ПараметрыСоединения.Вставить("СервисБизнесСеть", Новый ФиксированноеСоответствие(ПараметрыСервисаБизнесСеть));
	
	// Сервис 1С:Рубрикатор.
	ПараметрыСервисаРубрикатор = Новый Соответствие;
	ПараметрыСервисаРубрикатор.Вставить("ИмяСервера", "1cbn.ru");
	ПараметрыСервисаРубрикатор.Вставить("Порт", 443);
	ПараметрыСервисаРубрикатор.Вставить("ЗащищенноеСоединение", Истина);
	ПараметрыСервисаРубрикатор.Вставить("ИспользуетсяАутентификация", Ложь);
	ПараметрыСоединения.Вставить("СервисРубрикатор", Новый ФиксированноеСоответствие(ПараметрыСервисаРубрикатор));
	
	УстановитьПривилегированныйРежим(Истина);
	СсылкаИдентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("РегистрСведений.ПользователиБизнесСеть");
	ИдентификаторПрограммы = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(СсылкаИдентификатор, "ПарольБизнесСеть");
	
	// При инициализации проверка, если нет ни одной записи в регистре, то очищается идентификатор клиента.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПользователиБизнесСеть.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.ПользователиБизнесСеть КАК ПользователиБизнесСеть";
	
	Если Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(СсылкаИдентификатор, Неопределено, "ПарольБизнесСеть");
		ИдентификаторПрограммы = Строка(Новый УникальныйИдентификатор);
		
		// Очистка регистра, могут быть устаревшие записи по пользователям.
		НаборЗаписей = РегистрыСведений.ПользователиБизнесСеть.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		// Очистка регистра, могут быть устаревшие записи по пользователям.
		НаборЗаписей = РегистрыСведений.ОрганизацииБизнесСеть.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	ПараметрыСоединения.Вставить("ИдентификаторПрограммы", ИдентификаторПрограммы);
	
	Возврат ПараметрыСоединения;

КонецФункции

// Формирует строку параметров для HTTP запроса в формате "?Параметр1=Значение1&Параметр2...".
//
// Параметры:
//   ПараметрыЗапроса - Структура - данные для строки, ключ - имя параметра, значение - устанавливаемое значение,
//                                  кириллические символы необходимо закодировать по алгоритму Base64.
//
Функция ПреобразоватьВСтрокуПараметровHTML(ПараметрыЗапроса)
	
	Результат = "";
	Для каждого ЭлементСтруктуры Из ПараметрыЗапроса Цикл
		Результат = Результат + ?(Результат = "", "?", "&") + ЭлементСтруктуры.Ключ + "=" + ЭлементСтруктуры.Значение;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Формирует данные JSON для регистрации абонента в сервисе.
//
// Параметры:
//   ПараметрыКоманды - Структура - данные заполнения.
//   Отказ - Булево - признак отказа выполнения.
//
// Возвращаемое значение:
//   Строка - данные из JSON.
//
Функция СформироватьДанныеРегистрацииАбонента(ПараметрыМетода, Отказ)
	
	ПараметрыАбонента = Новый Структура;
	ПараметрыАбонента.Вставить("title",                        Метаданные.Синоним);
	ПараметрыАбонента.Вставить("restrictAccessByOrganization", Ложь); // Контроль по организациям.
	ПараметрыАбонента.Вставить("restrictAccessByEndpoint",     Ложь); // Контроль по клиентам.
	
	ЛогинПользователя  = Строка(Новый УникальныйИдентификатор);
	ПарольПользователя = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыМетода.Вставить("АдминистраторАбонента", Новый Структура("Пользователь, Логин, Пароль",
		Пользователи.ТекущийПользователь(), ЛогинПользователя, ПарольПользователя));
	
	УчетныеДанные = Новый Структура;
	УчетныеДанные.Вставить("firstName", Строка(Пользователи.ТекущийПользователь()));
	
	// Заполнение пользователя администратор абонента.
	ПользовательСистемы = Новый Структура;
	ПользовательСистемы.Вставить("type",    "AUTOGENERATED");
	ПользовательСистемы.Вставить("login",    ЛогинПользователя);
	ПользовательСистемы.Вставить("password", ПарольПользователя);
	
	Клиент = Новый Структура;
	Клиент.Вставить("endpointGUID", ПараметрыМетода.ИдентификаторПрограммы);
	Клиент.Вставить("title",        Метаданные.Синоним);
	
	МассивКлиентов = Новый Массив;
	МассивКлиентов.Добавить(Клиент);
	ПользовательСистемы.Вставить("endpoints", МассивКлиентов);
	
	МассивПользователей = Новый Массив;
	МассивПользователей.Добавить(ПользовательСистемы);
	УчетныеДанные.Вставить("personAccounts", МассивПользователей);
	
	МассивУчетныхДанных = Новый Массив;
	МассивУчетныхДанных.Добавить(УчетныеДанные);
	
	// Заполнение абонента.
	ПараметрыАбонента.Вставить("members", МассивУчетныхДанных);
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	Данные = ЗначениеВJSON(ПараметрыАбонента);
	
	Возврат Данные;
	
КонецФункции

// Получение таблицы пользователей сервиса в информационной базе.
//
// Возвращаемое значение:
//   ТаблицаЗначений - пользователи информационной базы, подключенные к сервису.
//
Функция ПользователиСервисаВИнформационнойБазе()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получение списка пользователей информационной базы.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Пользователи.Ссылка                      КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ПользователиБизнесСеть.Пользователь ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ                                    КАК Подключен,
	|	ПользователиБизнесСеть.Идентификатор   КАК Идентификатор,
	|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПользователиБизнесСеть КАК ПользователиБизнесСеть
	|		ПО Пользователи.Ссылка = ПользователиБизнесСеть.Пользователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователи.Наименование";
	
	ТаблицаПользователей = Запрос.Выполнить().Выгрузить();
	ТаблицаПользователей.Колонки.Добавить("Пароль");
	ТаблицаПользователей.Колонки.Добавить("Телефон");
	ТаблицаПользователей.Колонки.Добавить("ЭлектроннаяПочта");
	ТаблицаПользователей.Колонки.Добавить("ЭтоАдминистратор");
	
	// Анализ ролей пользователей.
	СтрокиУдаления = Новый Массив;
	СтруктураКонтактовПользователя = БизнесСеть.ОписаниеКонтактнойИнформацииПользователя();
	Для каждого СтрокаТаблицы Из ТаблицаПользователей Цикл
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			СтрокаТаблицы.ИдентификаторПользователяИБ);
		
		Если ПользовательИБ = Неопределено Тогда
			СтрокиУдаления.Добавить(СтрокаТаблицы);
			Продолжить;
		КонецЕсли;
		
		// Для пользователей имеющих административные права устанавливается роль администратора сервиса,
		// для пользователей имеющих права обмена документами, устанавливается роль пользователя сервиса,
		// остальные пользователи не используются в сервисе.
		Если Пользователи.ЭтоПолноправныйПользователь(СтрокаТаблицы.Ссылка)
			ИЛИ	ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ОрганизацииБизнесСеть, СтрокаТаблицы.Ссылка) Тогда
			СтрокаТаблицы.ЭтоАдминистратор = Истина;
		ИначеЕсли ПравоВыполненияОбменаДокументами(СтрокаТаблицы.Ссылка) Тогда
			СтрокаТаблицы.ЭтоАдминистратор = Ложь;
		Иначе
			СтрокиУдаления.Добавить(СтрокаТаблицы);
			Продолжить;
		КонецЕсли;
		
		// Получение наименования роли пользователя и адреса эл.почты.
		БизнесСетьПереопределяемый.ПолучитьКонтактнуюИнформациюПользователя(СтрокаТаблицы.Ссылка, СтруктураКонтактовПользователя);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураКонтактовПользователя);
		
	КонецЦикла;
	
	// Удаление незарегистрированных пользователей.
	Для каждого ЗначениеМассива Из СтрокиУдаления Цикл
		ТаблицаПользователей.Удалить(ЗначениеМассива);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ТаблицаПользователей;
	
КонецФункции

// Установка статус загрузки документа в информационную базы в сервисе.
//
Процедура УстановитьСтатусЗагружен(Идентификатор, Ссылка, Отказ)
	
	МассивДанных = Новый Массив;
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Ссылка", Ссылка);
	СтруктураДанных.Вставить("Идентификатор", Идентификатор);
	МассивДанных.Добавить(СтруктураДанных);
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("МассивДанных", МассивДанных);
	ПараметрыМетода.Вставить("Статус", "Загружен");
	ПараметрыКоманды = ПараметрыКомандыОбновитьСтатус(ПараметрыМетода);
	Результат = БизнесСеть.ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
	
КонецПроцедуры

// Формирование данных JSON для регистрации и синхронизации пользователей в сервисе.
//
// Параметры:
//   ПараметрыСинхронизации - Структура
//     * ИдентификаторПрограммы - Строка - идентификатор программы, подключенной к сервису.
//     * МассивПользователей - Массив - массив пользователей для синхронизации.
//     * Данные - Структура - сформированные данные для регистрации.
//
Процедура СформироватьДанныеСинхронизацииПользователя(ДополнительныеПараметры, ОбновлятьИдентификаторыДоступа)
	
	УстановитьПривилегированныйРежим(Истина);
	Ссылка = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("РегистрСведений.ПользователиБизнесСеть");
	ИдентификаторПрограммы = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Ссылка, "ПарольБизнесСеть");
	УстановитьПривилегированныйРежим(Ложь);
	
	// Получение списка пользователей в информационной базе.
	ПользователиСервиса = ПользователиСервисаВИнформационнойБазе();
		
	// Обработка данных.
	МассивУчетныхДанных = Новый Массив;
	Для каждого СтрокаТаблицы Из ПользователиСервиса Цикл
		
		// Если пользователь не подключен, присваивается новый идентификатор.
		Если ОбновлятьИдентификаторыДоступа ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.Идентификатор) Тогда
			СтрокаТаблицы.Идентификатор = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		
		// Добавление в JSON пользователя.
		ПользовательСистемы = Новый Структура;
		ПользовательСистемы.Вставить("type", "AUTOGENERATED");
		ПользовательСистемы.Вставить("login", СтрокаТаблицы.Идентификатор);
		
		// Пароль при каждом обращении генерируется новый.
		СтрокаТаблицы.Пароль = Строка(Новый УникальныйИдентификатор);
		ПользовательСистемы.Вставить("password", СтрокаТаблицы.Пароль);
		
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(ПользовательСистемы);
		
		// Добавление в JSON учетных данных.
		УчетныеДанные = Новый Структура;
		УчетныеДанные.Вставить("firstName", Строка(СтрокаТаблицы.Ссылка));
		УчетныеДанные.Вставить("personAccounts", МассивПользователей);
		
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(ПользовательСистемы);
		
		ПользовательАбонента = Новый Структура;
		ПользовательАбонента.Вставить("roleTitle", "user");
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЭлектроннаяПочта) Тогда
			ПользовательАбонента.Вставить("corporationEmail", СтрокаТаблицы.ЭлектроннаяПочта);	
		КонецЕсли;
		
		ПользовательАбонента.Вставить("isSubscriberAdministrator", ?(СтрокаТаблицы.ЭтоАдминистратор, "true", "false"));
		ПользовательАбонента.Вставить("person", УчетныеДанные);
		
		МассивУчетныхДанных.Добавить(ПользовательАбонента);
		
	КонецЦикла;
	
	ДополнительныеПараметры.МассивПользователей    = ПользователиСервиса;
	ДополнительныеПараметры.ИдентификаторПрограммы = ИдентификаторПрограммы;
	ДополнительныеПараметры.Данные                 = ЗначениеВJSON(МассивУчетныхДанных);
	
КонецПроцедуры

// Формирование документа ИБ по электронному документу.
//
// Параметры:
//   ПараметрыФормирования - Структура - структура данных формирования.
//   ДанныеФормы - ДанныеФормыКоллекция - форма получатель.
//   ТекстСообщения - Строка - текст при возникновении ошибки.
//   Записывать - Булево - записывать документ.
//   Отказ - Булево - результат выполнения.
//
Процедура СформироватьДокументИБ(ПараметрыФормирования, ДокументСсылка, ТекстСообщения, Записывать,
	ОбновитьСтруктуруРазбора, Отказ) Экспорт
	
	Перем СтрокаОбъекта, ДеревоРазбора;
	
	// В том случае если номенклатура уже была сопоставлена - используется временное хранилище,
	// если сопоставляли вручную - формируется структура разбора еще раз.
	
	Если Не ОбновитьСтруктуруРазбора
		И ЗначениеЗаполнено(ПараметрыФормирования.АдресСтруктурыРазбораЭД)
		И ЭтоАдресВременногоХранилища(ПараметрыФормирования.АдресСтруктурыРазбораЭД) Тогда
		СтруктураРазбора = ПолучитьИзВременногоХранилища(ПараметрыФормирования.АдресСтруктурыРазбораЭД);
	Иначе
		ИмяФайла = ОбменСКонтрагентамиСлужебный.ТекущееИмяВременногоФайла("xml");
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ПараметрыФормирования.ДанныеФайлаРазбора);
		ДвоичныеДанныеФайла.Записать(ИмяФайла);
		
		ИмяФайлаДопДанных = Неопределено;
		Если ЭтоАдресВременногоХранилища(ПараметрыФормирования.ДанныеФайлаДопДанных) Тогда
			ИмяФайлаДопДанных = ПолучитьИмяВременногоФайла("xml");
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ПараметрыФормирования.ДанныеФайлаДопДанных);
			ДвоичныеДанныеФайла.Записать(ИмяФайлаДопДанных);
		КонецЕсли;
		
		СтруктураРазбора = ОбменСКонтрагентамиВнутренний.СформироватьДеревоРазбора(ИмяФайла,
			Перечисления.НаправленияЭД.Входящий, ИмяФайлаДопДанных);
		ЭлектронноеВзаимодействиеСлужебный.УдалитьВременныеФайлы(ИмяФайла);
		ЭлектронноеВзаимодействиеСлужебный.УдалитьВременныеФайлы(ИмяФайлаДопДанных);
	КонецЕсли;
	
	Если СтруктураРазбора <> Неопределено И СтруктураРазбора.Свойство("ДеревоРазбора", ДеревоРазбора)
		И СтруктураРазбора.Свойство("СтрокаОбъекта", СтрокаОбъекта) Тогда
			ОбменСКонтрагентамиСлужебный.СформироватьДокумент(ДеревоРазбора, СтрокаОбъекта, ДокументСсылка,
				ПараметрыФормирования.Контрагент, Записывать, ТекстСообщения, Отказ);
	Иначе
		Отказ = Истина;
	КонецЕсли;

	Если Не Отказ Тогда
		УстановитьСтатусЗагружен(ПараметрыФормирования.Идентификатор, ДокументСсылка, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Возврат данных идентификации пользователя информационной базы из кэша.
//
// Параметры:
//   Пользователь - Справочник.Пользователи - проверяемый пользователь, если не указан, то текущий.
//
// Возвращаемое значение:
//   Структура - структура данных идентификации.
//
Функция ПараметрыАутентификацииПользователя(Пользователь = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Пользователь = Пользователи.СсылкаНеуказанногоПользователя(Истина) Тогда
		// Получение первого пользователя по ролям.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПользователиБизнесСеть.Пользователь КАК Ссылка
		|ИЗ
		|	РегистрСведений.ПользователиБизнесСеть КАК ПользователиБизнесСеть";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ПравоВыполненияОбменаДокументами(Выборка.Ссылка) Тогда
				Пользователь = Выборка.Ссылка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПользователиБизнесСеть.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.ПользователиБизнесСеть КАК ПользователиБизнесСеть
	|ГДЕ
	|	ПользователиБизнесСеть.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураИдентификации = Неопределено;
	Если Выборка.Следующий() Тогда
		СтруктураИдентификации = Новый Структура;
		СтруктураИдентификации.Вставить("Пользователь", Пользователь);
		СтруктураИдентификации.Вставить("Логин", Выборка.Идентификатор);
		Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Пользователь, "ПарольБизнесСеть");
		СтруктураИдентификации.Вставить("Пароль", Пароль);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураИдентификации;
	
КонецФункции

// Сохранение настроек подключения во временном параметре сеанса.
//
// Параметры:
//  ПараметрыСоединения - Структура - сохраняемые параметры.
//
Процедура СохранитьПараметрыСоединенияВСеансе(ПараметрыСоединения)
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыКлиентаНаСервере = Новый Соответствие(ПараметрыСеанса.ПараметрыКлиентаНаСервере);
	
	Если ПараметрыСоединения = Неопределено Тогда
		// Если нет задан параметр, удаляется настройка в параметрах сеанса.
		Если ПараметрыКлиентаНаСервере.Получить("БизнесСетьПараметрыСоединения") <> Неопределено Тогда
			ПараметрыКлиентаНаСервере.Удалить("БизнесСетьПараметрыСоединения")
		КонецЕсли;
	Иначе
		ПараметрыКлиентаНаСервере["БизнесСетьПараметрыСоединения"] = Новый ФиксированнаяСтруктура(ПараметрыСоединения);
	КонецЕсли;
	
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(ПараметрыКлиентаНаСервере);
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

// Обновляет значения идентификаторов Бизнес-сети в программе.
//
// Параметры:
//   ПараметрыОбновления - Структура
//     * МассивОрганизаций - Массив - список организаций.
//     * МассивПользователей - Массив - список пользователей.
//     * АдминистраторАбонента - Структура - данные об администраторе абонента (Пользователь, Логин, Пароль).
//     * ИдентификаторПрограммы - Строка - идентификатор программы.
//   РежимУдаления - Булево - если Истина, удаление идентификаторов, Ложь - сохранение.
//
Процедура ОбновитьИдентификаторыБизнесСети(ПараметрыОбновления, РежимУдаления = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяСправочникаОрганизации = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяПрикладногоСправочника("Организации");
	МенеджерЗаписи = РегистрыСведений.ПользователиБизнесСеть.СоздатьМенеджерЗаписи();
	
	// Обновление сведений об зарегистрированных организациях.
	Если ПараметрыОбновления.Свойство("МассивОрганизаций") И ЗначениеЗаполнено(ПараметрыОбновления.МассивОрганизаций) Тогда
		МенеджерЗаписиОрганизации = РегистрыСведений.ОрганизацииБизнесСеть.СоздатьМенеджерЗаписи();
		Для каждого ЭлементМассива Из ПараметрыОбновления.МассивОрганизаций Цикл
			МенеджерЗаписиОрганизации.Организация = ЭлементМассива;
			МенеджерЗаписиОрганизации.Прочитать();
			Если РежимУдаления Тогда
				МенеджерЗаписиОрганизации.Удалить();
			Иначе
				МенеджерЗаписиОрганизации.Организация = ЭлементМассива;
				МенеджерЗаписиОрганизации.Записать(Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	// Обновление сведений о зарегистрированных пользователях.
	Если ПараметрыОбновления.Свойство("МассивПользователей") Тогда
	
		МассивПользователей = ПараметрыОбновления.МассивПользователей;
		
		Запрос = Новый Запрос;
		Если ЗначениеЗаполнено(МассивПользователей) Тогда
			// Выборка пользователей, переданных в массиве.
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПользователиБизнесСеть.Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.ПользователиБизнесСеть КАК ПользователиБизнесСеть
			|ГДЕ
			|	ПользователиБизнесСеть.Пользователь ССЫЛКА Справочник.Пользователи
			|	И НЕ ПользователиБизнесСеть.Пользователь В (&МассивСсылок)";
			Запрос.УстановитьПараметр("МассивСсылок", МассивПользователей.ВыгрузитьКолонку("Ссылка"));
		Иначе
			// Если не передан массив пользователей, то выберем всех.
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПользователиБизнесСеть.Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.ПользователиБизнесСеть КАК ПользователиБизнесСеть";
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			// Если список пользователей пустой, и значение ссылки это пустой пользователь, то такую запись не удаляем,
			// так как эта запись является администратором абонента в сервисе.
			ЭтоПустойАдминистратор = НЕ ЗначениеЗаполнено(МассивПользователей)
				И (НЕ ЗначениеЗаполнено(Выборка.Пользователь)
				ИЛИ Выборка.Пользователь = Пользователи.СсылкаНеуказанногоПользователя());
			
			Если НЕ ЭтоПустойАдминистратор ИЛИ (ЭтоПустойАдминистратор И РежимУдаления) Тогда
				МенеджерЗаписи.Пользователь = Выборка.Пользователь;
				МенеджерЗаписи.Удалить();
				// Очистка пароля в хранилище.
				ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Выборка.Пользователь, Неопределено, "ПарольБизнесСеть");
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не РежимУдаления Тогда
			Если ЗначениеЗаполнено(МассивПользователей) Тогда
				Для каждого ЭлементМассива Из МассивПользователей Цикл
					МенеджерЗаписи.Пользователь = Справочники[ИмяСправочникаОрганизации].ПустаяСсылка();
					МенеджерЗаписи.Прочитать();
					МенеджерЗаписи.Пользователь = ЭлементМассива.Ссылка;
					МенеджерЗаписи.Идентификатор  = ЭлементМассива.Идентификатор;
					МенеджерЗаписи.Записать(Истина);
					ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ЭлементМассива.Ссылка, 
						ЭлементМассива.Пароль, "ПарольБизнесСеть");
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Обновление сведений об администраторе абонента.
	Если ПараметрыОбновления.Свойство("АдминистраторАбонента") Тогда

		АдминистраторАбонента = ПараметрыОбновления.АдминистраторАбонента;
		МенеджерЗаписи.Пользователь = Справочники[ИмяСправочникаОрганизации].ПустаяСсылка();
		МенеджерЗаписи.Пользователь = АдминистраторАбонента.Пользователь;
		МенеджерЗаписи.Прочитать();
		Если РежимУдаления Тогда
			МенеджерЗаписи.Удалить();
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(АдминистраторАбонента.Пользователь, 
				Неопределено, "ПарольБизнесСеть");
		Иначе
			МенеджерЗаписи.Пользователь = АдминистраторАбонента.Пользователь;
			МенеджерЗаписи.Идентификатор  = АдминистраторАбонента.Логин;
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(АдминистраторАбонента.Пользователь, 
				АдминистраторАбонента.Пароль, "ПарольБизнесСеть");
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
	
	// Обновление сведений об идентификаторе информационной базы.
	Если ПараметрыОбновления.Свойство("ИдентификаторПрограммы") Тогда
		Ссылка = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("РегистрСведений.ПользователиБизнесСеть");
		Если РежимУдаления Тогда
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Ссылка, Неопределено, "ПарольБизнесСеть");
		Иначе
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Ссылка,
				ПараметрыОбновления.ИдентификаторПрограммы, "ПарольБизнесСеть");
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Получение данных из строки в формате JSON.
//
Функция ЗначениеИзСтрокиJSON(Строка)
	
	Результат = Неопределено;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	Попытка
		ЧтениеJSON.УстановитьСтроку(Строка);
		Результат = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), "БизнесСеть");
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Обработка ответа сервиса.
//
// Параметры:
//  ПараметрыКоманды - Структура - параметры команды, см.БизнесСеть.ОписаниеПараметровКомандыСервиса().
//  КодСостояния	 - Строка - код состояния ответа HTTP-соединения.
//  Данные			 - Структура, Строка - возвращаемые данные сервиса.
//  Отказ			 - Булево - результат проверки.
// 
// Возвращаемое значение:
//  Произвольный - возвращаемый результат обработки.
//
Функция ОбработатьОтветСервиса(ПараметрыКоманды, КодСостояния, Данные, Отказ)
	
	// Инициализация возврата ошибки.
	Результат = Неопределено;
	
	Если ПараметрыКоманды.Ошибки.Получить(КодСостояния) <> Неопределено Тогда
		
		ТекстОшибки = ПараметрыКоманды.Ошибки.Получить(КодСостояния);
		Если ТекстОшибки = Ложь Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Отказ = Истина;
		ТекстОшибкиСервиса = "";
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Если Данные.Свойство("message") Тогда
				ТекстОшибкиСервиса = Данные.message;
			ИначеЕсли Данные.Свойство("error_description") Тогда
				ТекстОшибкиСервиса = Данные.error_description;
			КонецЕсли;
		КонецЕсли;
		
		ПодробныйТекстОшибки = ТекстОшибки
			+ ?(КодСостояния > 200, Символы.ПС + НСтр("ru = 'Код состояния:'") + " " + КодСостояния, "")
			+ Символы.ПС + ПараметрыКоманды.Адрес
			+ ?(ТекстОшибкиСервиса = "", "", Символы.ПС + ТекстОшибкиСервиса);
		
		Если Не (ПараметрыКоманды.Свойство("БлокироватьСообщенияОбОшибках")
			И ПараметрыКоманды.БлокироватьСообщенияОбОшибках = Истина) Тогда
			ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(ПараметрыКоманды.Наименование,
				ПодробныйТекстОшибки, ТекстОшибки, "БизнесСеть");
		КонецЕсли;
			
		Результат = ТекстОшибки;
		
	Иначе
		
		Если ЗначениеЗаполнено(ПараметрыКоманды.ОбработкаРезультата) Тогда
			
			Если Не ЗначениеЗаполнено(Данные) Тогда
				Результат = Неопределено;
				Отказ = Истина;
			Иначе
				
				// Метод конвертации данных будет переработан в отдельный рекурсивный метод.
				Если ТипЗнч(ПараметрыКоманды.ОбработкаРезультата) = Тип("Структура")
					И ТипЗнч(Данные) = Тип("Структура") Тогда
					
					// Ожидается, что возвращается структура, которую необходимо привести к определенному составу.
					НовыеДанные = Новый Структура;
					Для каждого ЭлементСтруктуры Из ПараметрыКоманды.ОбработкаРезультата Цикл
						Если Данные.Свойство(ЭлементСтруктуры.Значение) Тогда
							НовыеДанные.Вставить(ЭлементСтруктуры.Ключ, Данные[ЭлементСтруктуры.Значение]);
						КонецЕсли;
					КонецЦикла;
					
				ИначеЕсли ТипЗнч(ПараметрыКоманды.ОбработкаРезультата) = Тип("ТаблицаЗначений")
					И ТипЗнч(Данные) = Тип("Массив") Тогда
					
					// Ожидается таблица значений.
					НовыеДанные = ПараметрыКоманды.ОбработкаРезультата.Скопировать();
					Для каждого ЗначениеМассива Из Данные Цикл
						НоваяСтрока = НовыеДанные.Добавить();
						Для каждого КолонкаТаблицы Из НовыеДанные.Колонки Цикл
							Если ЗначениеМассива.Свойство(КолонкаТаблицы.Заголовок) Тогда
								НоваяСтрока[КолонкаТаблицы.Имя] = ЗначениеМассива[КолонкаТаблицы.Заголовок];
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
					
				ИначеЕсли ТипЗнч(ПараметрыКоманды.ОбработкаРезультата) = Тип("Массив")
					И ПараметрыКоманды.ОбработкаРезультата.Количество() = 1
					И ТипЗнч(Данные) = Тип("Массив") Тогда
					
					// В первой строке содержится структура массива.
					СоставСвойств = ПараметрыКоманды.ОбработкаРезультата[0];
					НовыеДанные = Новый Массив;
					Для каждого ЗначениеМассива Из Данные Цикл
						НовыйЭлемент = Новый Структура;
						Для каждого ЭлементСтруктуры Из СоставСвойств Цикл
							Если ЗначениеМассива.Свойство(ЭлементСтруктуры.Значение) Тогда
								НовыйЭлемент.Вставить(ЭлементСтруктуры.Ключ, ЗначениеМассива[ЭлементСтруктуры.Значение]);
							КонецЕсли;
						КонецЦикла;
						НовыеДанные.Добавить(НовыйЭлемент);
					КонецЦикла;
					
				КонецЕсли;
				
				Результат = НовыеДанные;
				
			КонецЕсли;
			
		Иначе
			Результат = Данные;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
