
Процедура ПередЗаписьюТоварногоДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	Если Не Отказ Тогда
		Заголовок = "Пометка на удаление партий товаров организаций по документу " + Источник.Ссылка;
		swДвиженияТоваровОрганизаций.ПометитьНаУдалениеПартииТоваров(Источник.Ссылка, Отказ, Заголовок);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведенияТоварногоДокумента(Источник, Отказ, РежимПроведения) Экспорт
	Если Не Отказ Тогда
		Заголовок = "Формирование движений по альтернативному учету партий товаров организаций по документу " + Источник.Ссылка;
		swДвиженияТоваровОрганизаций.СформироватьДвижениеТоваров(Источник.Ссылка, Отказ, Заголовок);
	КонецЕсли;
	//Если Не Отказ Тогда
	//	Заголовок = "Формирование движений по особому учету товаров по контрагентам по документу " + Источник.Ссылка;
	//	swОсобыйУчетТоваровПоКонтрагентам.СформироватьДвижениеТоваров(Источник.Ссылка, Отказ, Заголовок);
	//КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведенияТоварногоДокумента(Источник, Отказ) Экспорт
	Если Не Отказ Тогда
		Заголовок = "Отмена движений по альтернативному учету партий товаров организаций по документу " + Источник.Ссылка;
		swДвиженияТоваровОрганизаций.ОтменитьДвижениеТоваров(Источник.Ссылка, Отказ, Заголовок);
	КонецЕсли;
	//Если Не Отказ Тогда
	//	Заголовок = "Отмена движений по особому учету товаров по контрагентам по документу " + Источник.Ссылка;
	//	swОсобыйУчетТоваровПоКонтрагентам.ОтменитьДвижениеТоваров(Источник.Ссылка, Отказ, Заголовок);
	//КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписьюСкладскихДвижений(Источник, Отказ, Замещение) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры