
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
		
		ВызватьИсключение НСтр("ru='Не реализован выбор назначения из этой формы.'"); 
		
	
	НастроитьОтборПоПолучателю();
	
	НастроитьДинамическийСписок();
	
	УстановитьЗаголовокФормы();
	
	МодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере(ЭтаФорма, СтандартнаяОбработка, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборПоПолучателюПриИзменении(Элемент)
	
	УстановитьОтборПоПолучателю();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСписка

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Возврат; // в данной конфигурации действия не предусмотрены

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Возврат; // в данной конфигурации действия не предусмотрены
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтборПоПолучателю()
	
	ОтборПоПолучателю = Параметры.Свойство("Получатель") И ЗначениеЗаполнено(Параметры.Получатель);
	Если ОтборПоПолучателю Тогда
		Если ТипЗнч(Параметры.Получатель) = Тип("СправочникСсылка.Склады") Тогда
			Шаблон = НСтр("ru = 'Потребность на складе: ""%1""'");
		Иначе
			Шаблон = НСтр("ru = 'Потребность в подразделении: ""%1""'");
		КонецЕсли;
		Элементы.ОтборПоПолучателю.Заголовок = СтрШаблон(Шаблон, Параметры.Получатель);
	КонецЕсли;
	Элементы.ОтборПоПолучателю.Видимость = ОтборПоПолучателю;

КонецПроцедуры

&НаСервере
Процедура НастроитьДинамическийСписок()
	
	Возврат; // в данной конфигурации действия не предусмотрены
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ТекстНоменклатура = СтрШаблон(НСтр("ru = 'Номенклатура: %1'"), Параметры.Номенклатура);
	
	Если ЗначениеЗаполнено(Параметры.Характеристика) Тогда
		
		ТекстНоменклатура = ТекстНоменклатура + ", " + СтрШаблон(НСтр("ru = 'Характеристика: %1'"), Параметры.Характеристика);
		
	КонецЕсли;
	
	Заголовок = СтрШаблон(НСтр("ru = 'Выбор назначения (%1)'"), ТекстНоменклатура);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПолучателю()
	
	Элементы.Количество.Видимость = ОтборПоПолучателю;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ОтборПоПолучателю", ОтборПоПолучателю);
	
КонецПроцедуры

#КонецОбласти
