
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагент") Тогда
		ВСКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Контрагент",
		Параметры.Контрагент, 
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ
		);
	КонецЕсли;
	
	Если Параметры.Отбор.Количество() <> 0 Тогда
		Если Параметры.Отбор.Контрагент <> Неопределено Тогда
			
			Если Не ТипЗнч(Параметры.Отбор.Контрагент) = Тип("Массив") Тогда 
				ЗначениеОтбора 		= Параметры.Отбор.Контрагент;
				ВариантСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			Иначе 
				ЗначениеОтбора 		= Параметры.Отбор.Контрагент;
				ВариантСравнения	= ВидСравненияКомпоновкиДанных.ВСписке;
				
				ГруппировкаСписка = Список.КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				ДобавитьГруппировку(ГруппировкаСписка.ПоляГруппировки, "Контрагент");
				
			КонецЕсли;
			
			ЭСФКлиентСерверПереопределяемый.УстановитьЭлементОтбора(
			Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
			"Контрагент",
			ЗначениеОтбора, 
			ВариантСравнения,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьГруппировку(СписокГруппировок, ИмяПоля, Использование = Истина, ТипГруппировки = Неопределено)
	
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	НовыйЭлемент = СписокГруппировок.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовыйЭлемент.Использование = Использование;
	НовыйЭлемент.Поле = Поле;
	НовыйЭлемент.ТипГруппировки = ?(ТипГруппировки = Неопределено, ТипГруппировкиКомпоновкиДанных.Элементы, ТипГруппировки);
	Возврат НовыйЭлемент;
	
КонецФункции
