
&НаСервере
Процедура ЗаполнитьТоварыНаСервере()
	
	
	
	мТовары = РеквизитФормыВЗначение("ТоварыДерево");

	мТовары.Строки.Очистить();
	
	Объект.Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Подразделение = &Подразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.Ссылка.Партнер КАК Партнер,
		|	ЗаказКлиентаТовары.Ссылка.Дизайнер КАК Дизайнер,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
		|	ЗаказКлиентаТовары.Сумма КАК Сумма,
		|	ЗаказКлиентаТовары.new_ЭтоСпецЦена КАК new_ЭтоСпецЦена,
		|	ЗаказКлиентаТовары.Номенклатура.кт_СпецЦена КАК Номенклатуракт_СпецЦена,
		|	ЗаказКлиентаТовары.Номенклатура.кт_РозничнаяЦена КАК Номенклатуракт_РозничнаяЦена,
		|	ЗаказКлиентаТовары.Номенклатура.кт_ОптЦена КАК Номенклатуракт_ОптЦена
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка.Дизайнер <> &Дизайнер
		|	И НЕ ЗаказКлиентаТовары.Отменено
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка,
		|	ЗаказКлиентаТовары.Ссылка.Партнер,
		|	ЗаказКлиентаТовары.Ссылка.Дизайнер,
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.ВидЦены,
		|	ЗаказКлиентаТовары.Сумма,
		|	ЗаказКлиентаТовары.new_ЭтоСпецЦена,
		|	ЗаказКлиентаТовары.Номенклатура.кт_СпецЦена,
		|	ЗаказКлиентаТовары.Номенклатура.кт_РозничнаяЦена,
		|	ЗаказКлиентаТовары.Номенклатура.кт_ОптЦена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ПОМЕСТИТЬ ВТ_Телефон
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.НомерТелефона <> &НомерТелефона
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартнерыКонтактнаяИнформация.Ссылка,
		|	ПартнерыКонтактнаяИнформация.НомерТелефона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ПОМЕСТИТЬ ВТ_ТелефонДизайнера
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.НомерТелефона <> &НомерТелефона
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартнерыКонтактнаяИнформация.Ссылка,
		|	ПартнерыКонтактнаяИнформация.НомерТелефона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Реализация.Ссылка КАК Реализация,
		|	ВТ_Заказы.Ссылка КАК ЗаказКЛиента,
		|	ВТ_Заказы.Партнер КАК Партнер,
		|	ВТ_Заказы.Дизайнер КАК Дизайнер,
		|	ВТ_Заказы.Номенклатура КАК Номенклатура,
		|	ВТ_Заказы.ВидЦены КАК ВидЦены,
		|	ЕСТЬNULL(ВТ_Заказы.Сумма, 0) КАК Сумма,
		|	ВТ_Заказы.new_ЭтоСпецЦена КАК ПризнакСпецЦена,
		|	ЕСТЬNULL(ВТ_Заказы.Номенклатуракт_СпецЦена, 0) КАК СпецЦена,
		|	ЕСТЬNULL(ВТ_Заказы.Номенклатуракт_РозничнаяЦена, 0) КАК РозничнаяЦена,
		|	ЕСТЬNULL(ВТ_Заказы.Номенклатуракт_ОптЦена, 0) КАК ОптЦена,
		|	ВТ_Телефон.НомерТелефона КАК НомерТелефонаКлиента,
		|	ВТ_ТелефонДизайнера.НомерТелефона КАК НомерТелефонаДизайнера,
		|	ВЫБОР
		|		КОГДА ВТ_Заказы.ВидЦены <> NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_Заказы.ВидЦены = &СпецРозн
		|						ТОГДА ЕСТЬNULL(ВТ_Заказы.Сумма, 0) * ЕСТЬNULL(ВТ_Заказы.Номенклатуракт_РозничнаяЦена, 0) / 100
		|					ИНАЧЕ ЕСТЬNULL(ВТ_Заказы.Сумма, 0) * ЕСТЬNULL(ВТ_Заказы.Номенклатуракт_СпецЦена, 0) / 100
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Бонусы
		|ИЗ
		|	ВТ_Реализация КАК ВТ_Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Телефон КАК ВТ_Телефон
		|			ПО ВТ_Заказы.Партнер = ВТ_Телефон.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТелефонДизайнера КАК ВТ_ТелефонДизайнера
		|			ПО ВТ_Заказы.Дизайнер = ВТ_ТелефонДизайнера.Ссылка
		|		ПО ВТ_Реализация.Ссылка.ЗаказКлиента = ВТ_Заказы.Ссылка.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Заказы.Ссылка,
		|	ВТ_Реализация.Ссылка,
		|	ВТ_Заказы.Партнер,
		|	ВТ_Заказы.Дизайнер,
		|	ВТ_Заказы.Номенклатура,
		|	ВТ_Заказы.ВидЦены,
		|	ВТ_Заказы.new_ЭтоСпецЦена,
		|	ВТ_Телефон.НомерТелефона,
		|	ВТ_ТелефонДизайнера.НомерТелефона,
		|	ЕСТЬNULL(ВТ_Заказы.Сумма, 0),
		|	ЕСТЬNULL(ВТ_Заказы.Номенклатуракт_СпецЦена, 0),
		|	ЕСТЬNULL(ВТ_Заказы.Номенклатуракт_РозничнаяЦена, 0),
		|	ЕСТЬNULL(ВТ_Заказы.Номенклатуракт_ОптЦена, 0),
		|	ВЫБОР
		|		КОГДА ВТ_Заказы.ВидЦены <> NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_Заказы.ВидЦены = &СпецРозн
		|						ТОГДА ЕСТЬNULL(ВТ_Заказы.Сумма, 0) * ЕСТЬNULL(ВТ_Заказы.Номенклатуракт_РозничнаяЦена, 0) / 100
		|					ИНАЧЕ ЕСТЬNULL(ВТ_Заказы.Сумма, 0) * ЕСТЬNULL(ВТ_Заказы.Номенклатуракт_СпецЦена, 0) / 100
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(Бонусы)
		|ПО
		|	ЗаказКЛиента";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("Дизайнер", Справочники.Партнеры.ПустаяСсылка());
	Запрос.УстановитьПараметр("НомерТелефона", "");
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("СпецРозн", Справочники.ВидыЦен.НайтиПоНаименованию("Розничная"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	//СоответствиеРодительскиеСтроки = Новый Соответствие();

	ИтогоСумма = 0;
	Пока Выборка.Следующий() Цикл
		
		//НовСтрТовары = Объект.Товары.Добавить();
		//ЗаполнитьЗначенияСвойств(НовСтрТовары, Выборка);
		Если НЕ ЗначениеЗаполнено(Выборка.Реализация) Тогда
			
			РодительскаяСтрока = мТовары.Строки.Добавить();
			РодительскаяСтрока.ЗаказКлиента = Выборка.ЗаказКлиента;
			РодительскаяСтрока.Сумма        = Выборка.Сумма;
			РодительскаяСтрока.Бонусы       = Выборка.Бонусы;
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока 						= РодительскаяСтрока.Строки.Добавить();
		НоваяСтрока.ЗаказКлиента 			= Выборка.ЗаказКлиента;
		НоваяСтрока.Реализация 				= Выборка.Реализация;
		НоваяСтрока.ВидЦены 				= Выборка.ВидЦены;
		НоваяСтрока.Дизайнер 				= Выборка.Дизайнер;
		НоваяСтрока.НомерТелефонаДизайнер 	= Выборка.НомерТелефонаДизайнера;
		НоваяСтрока.Партнер 				= Выборка.Партнер;
		НоваяСтрока.НомерТелефонаКлиента 	= Выборка.НомерТелефонаКлиента;
		НоваяСтрока.Сумма 					= Выборка.Сумма;
		НоваяСтрока.Бонусы 					= ?(ЗначениеЗаполнено(Выборка.ВидЦены), ?(Выборка.ПризнакСпецЦена, Окр(Выборка.Сумма * Выборка.СпецЦена / 100), Окр(Выборка.Сумма * Выборка.РозничнаяЦена / 100)), 0);
		НоваяСтрока.РозЦена 				= Выборка.РозничнаяЦена;
		НоваяСтрока.СпецЦена 				= Выборка.СпецЦена;
		НоваяСтрока.ОптЦена 				= Выборка.ОптЦена;
		НоваяСтрока.Номенклатура 			= Выборка.Номенклатура;
		
			//СоответствиеРодительскиеСтроки.Вставить(Выборка.ЗаказКлиента, НоваяСтрока);
		//КонецЕсли;
	КонецЦикла;
	
	ТаблицаЗначений1 = РеквизитФормыВЗначение("Объект.Товары");
	
	ПреобразоватьВ_ТЗ(мТовары, ТаблицаЗначений1, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	//ЗначениеВРеквизитФормы(ТаблицаЗначений1, "Объект.Товары");

	ЗначениеВРеквизитФормы(мТовары,"ТоварыДерево");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Сообщить("Необходимо зполнить поле ""Дата начала""", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Сообщить("Необходимо зполнить поле ""Дата окончания""", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Сообщить("Необходимо зполнить поле ""Подразделение""", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТоварыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьВ_ТЗ(Данные, ТаблицаЗначений, ГУИД)
	
	Для Каждого Строка Из Данные.Строки Цикл
		
		НовСтрока = Объект.Товары.Добавить();
		НовСтрока.ЗаказКлиента = Строка.ЗаказКлиента;
		ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
		НовСтрока.Родитель = Строка.ЗаказКлиента.УникальныйИдентификатор();
		
		Если Строка.Строки.Количество()>0 Тогда
			ПреобразоватьВ_ТЗ(Строка, ТаблицаЗначений, НовСтрока.Родитель);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыгрузитьТаблицуЗначенийВДеревоЗначений();
	
КонецПроцедуры

Процедура ВыгрузитьТаблицуЗначенийВДеревоЗначений()
	
	мТовары = РеквизитФормыВЗначение("ТоварыДерево");

	мТовары.Строки.Очистить();
	
	Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Реализация) Тогда
			
			РодительскаяСтрока = мТовары.Строки.Добавить();
			РодительскаяСтрока.ЗаказКлиента = СтрокаТаблицы.ЗаказКлиента;
			РодительскаяСтрока.Сумма        = СтрокаТаблицы.Сумма;
			Продолжить;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаТаблицы.Реализация) Тогда
			ЗаполнитьЗначенияСвойств(РодительскаяСтрока.Строки.Добавить(), СтрокаТаблицы);
		//Иначе
		//	ЗаполнитьЗначенияСвойств(СтрокаГруппировки.Строки.Добавить(), СтрокаТаблицы);
		//КонецЕсли;
	КонецЦикла;
		
	ЗначениеВРеквизитФормы(мТовары,"ТоварыДерево");
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСлужебнаяЗаписка(Команда)
	
ТабДок = Новый ТабличныйДокумент;
ЗаполнитьСлужебнуюЗаписку(ТабДок);
ТабДок.Показать();
	
	
КонецПроцедуры


Процедура ЗаполнитьСлужебнуюЗаписку(ТабДок);
	
	Макет  = Документы.кт_РасчетДизайнерскогоВознаграждения.ПолучитьМакет("Макет");
	
	Шапка  = Макет.ПолучитьОбласть("Шапка");
	
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Итог   =  Макет.ПолучитьОбласть("Итог");
	
	Шапка.Параметры.Директор = "Тагирова А.С.";
	
	ТабДок.Вывести(Шапка);
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ1 = Объект.Товары.Выгрузить();
	
	ТЗ = ТЗ1.Скопировать();
	
	ТЗ.Свернуть("Реализация, Дизайнер, НомерТелефонаДизайнера, Партнер, НомерТелефонаКлиента", "Сумма, Бонусы");
	Номер = 0;
	Для Каждого Стр Из ТЗ Цикл 
		Номер = Номер + 1;
		Строка.Параметры.ПорядковыйНомер = Номер;
		Строка.Параметры.ПорядковыйНомер = Номер;
		ТабДок.Вывести(Строка);
		
	КонецЦикла;
КонецПроцедуры
