
&НаСервере
Процедура ОтправитьНаСервере()
	
	ТекстСообщения = Объект.ТекстСМС;
	
	Для Каждого СтрТаб Из Объект.ТаблицаОтправки Цикл
		Если СтрТаб.Отправлено = Ложь и ЗначениеЗаполнено(СтрТаб.НомерТелефона) Тогда
			Дост=Число(88);
			ТелефонСотовыйСМС	= "7"+Прав(СтрТаб.НомерТелефона, 10);
			Структура = смсТрафик.ОтправитьСМССообщениеПоНомеру(ТелефонСотовыйСМС, ТекстСообщения, Дост);
			Ответ = Структура.Описание + " " + Структура.Ид;
			Если Структура.Результат = Истина Тогда
				СтрТаб.Отправлено = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Запись из Объект.ТаблицаОтправки Цикл 
		Если Запись.Отправлено Тогда 
			Объект.ТаблицаОтправки.Удалить(Запись);   
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = Строка("Выберите файл");
	
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;	
	
	//очищаем таблицу и удаляем колонки
	Объект.ТаблицаОтправки.Очистить();
	//подключаемся к эксель
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка
		//Открываем необходимый лист
		Excel.Sheets(1).Select(); // лист 1, по умолчанию
	Исключение
		//Закрываем Excel
		Excel.ActiveWorkbook.Close();
		Excel = 0;
		Сообщить("Файл "+Строка(ИмяФайла)+" не соответствует необходимому формату! Первый лист не найден!");
		//ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	
	//Получим количество строк и колонок.
	//В разных версиях Excel получаются по-разному, поэтому сначала определим версию Excel
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;
	Конецесли;	
	
	Для НС = 2 по ФайлСтрок Цикл // НС указываем с какой строки начинать обработку	
		Состояние("Файл "+Строка(ИмяФайла)+": Обрабатывается первый лист "+Строка(Формат(?(ФайлСтрок=0,0,((100*НС)/ФайлСтрок)),"ЧЦ=3; ЧДЦ=0"))+" %");
		ОбработкаПрерыванияПользователя(); //указав данный оператор, цикл можно прервать в любой момент нажатие ctrl+break	
			//заполняем строку значениями
			ТекущееЗначение = Excel.Cells(НС, 1).Text;
			Если ЗначениеЗаполнено(ТекущееЗначение) Тогда
				НоваяСтрока = Объект.ТаблицаОтправки.Добавить();
				ИмяКолонки = Строка("НомерТелефона");
				НоваяСтрока[ИмяКолонки] = Прав(ТекущееЗначение,10);
			КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТелефоныНаСервере(ПодразделениеИск)
	
	Объект.НеСоответствуют.Очистить();
	Объект.ТабНомПоМаг.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Контрагент КАК Контрагент
	               |ПОМЕСТИТЬ Контрагенты
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	               |	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслуг.Подразделение В (&Подразделение)
	               |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач и &ДатаКон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслуг.Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	               |ИЗ
	               |	Контрагенты КАК Контрагенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |		ПО Контрагенты.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Тип = &Тип
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрагентыКонтактнаяИнформация.НомерТелефона";
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	СписокиПодраз = Новый Массив;
	Если Объект.ПодразделенияДляОтправки.Количество() > 0 Тогда
		Для Каждого СтрДан Из Объект.ПодразделенияДляОтправки Цикл 
			СписокиПодраз.Добавить(СтрДан.Подразделение)	
		КонецЦикла;		
	Иначе 
		Сообщить("Не указано подразделение!!!");
		Возврат;
	КонецЕсли;
	Запрос.УстановитьПараметр("Подразделение", СписокиПодраз);

	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество() > 0 Тогда
		Для Каждого СтрРе Из Рез Цикл 
			Если СтрДлина(СтрРе.НомерТелефона) = 10 Тогда
				НовСтр = Объект.ТабНомПоМаг.Добавить();
				НовСтр.НомерТелефона = СтрРе.НомерТелефона;	
			Иначе 
				НовСтр = Объект.НеСоответствуют.Добавить();
				НовСтр.НомерТелефона = СтрРе.НомерТелефона;		
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТелефоны(Команда)
	ПодразделениеИск = Подразделение;
	ПолучитьТелефоныНаСервере(ПодразделениеИск);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСоответствующие(Команда)
	
	Для Каждого СтрНес Из Объект.НеСоответствуют Цикл
		Если СтрНес.Уд = Ложь и СтрНес.Выб Тогда
			ЕстьСовпад = Ложь;
			Для Каждого СтрСоот Из Объект.ТабНомПоМаг Цикл 
				Если СтрСоот.НомерТелефона = СтрНес.НомерТелефона тогда
					ЕстьСовпад = Истина;
					СтрНес.Уд = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьСовпад = Ложь Тогда
				НовСтр = Объект.ТабНомПоМаг.Добавить();
				НовСтр.НомерТелефона = СтрНес.НомерТелефона;
				СтрНес.Уд = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Для каждого Запись из Объект.НеСоответствуют Цикл 
		Если Запись.Уд и Запись.Выб Тогда 
			Объект.НеСоответствуют.Удалить(Запись);   
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Запись из Объект.НеСоответствуют Цикл 
		Если Запись.Уд и Запись.Выб Тогда 
			Объект.НеСоответствуют.Удалить(Запись);   
		КонецЕсли; 
	КонецЦикла;
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьНаОтправку(Команда)
	
	Объект.ТаблицаОтправки.Очистить();
	
	Для Каждого СтрНес Из Объект.ТабНомПоМаг Цикл
		НовСтр = Объект.ТаблицаОтправки.Добавить();
		НовСтр.НомерТелефона = СтрНес.НомерТелефона;
	КонецЦикла;
	
	Объект.ТабНомПоМаг.Очистить();	
	
КонецПроцедуры
