
//Кт Начало Апаев_О [10.08.2022]
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая()
		ИЛИ Объект.ЗначениеПоказателей.Количество() < 12 Тогда
		
		Месяца = ПолучитьСоответствиеМесяцев();
		
		Для Счетчик = 1 По 12 Цикл		
			НоваяСтрока = Объект.ЗначениеПоказателей.Добавить();
			НоваяСтрока.Месяц = Месяца.Получить(Счетчик);			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеМесяцев()
	
	Месяца = Новый Соответствие;
	Месяца.Вставить(1,  "Январь");
	Месяца.Вставить(2,  "Февраль");
	Месяца.Вставить(3,  "Март");
	Месяца.Вставить(4,  "Апрель");
	Месяца.Вставить(5,  "Май");
	Месяца.Вставить(6,  "Июнь");
	Месяца.Вставить(7,  "Июль");
	Месяца.Вставить(8,  "Август");
	Месяца.Вставить(9,  "Сентябрь");
	Месяца.Вставить(10, "Октябрь");
	Месяца.Вставить(11, "Ноябрь");
	Месяца.Вставить(12, "Декабрь");
	
	Возврат Месяца;
	
КонецФункции
//Кт Окончание Апаев_О [10.08.2022]