
Процедура ПодровнятьКоличествоВСтроке(ТекущаяСтрока) Экспорт
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПлощадьЕдиницы = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура, "ПлощадьЕдиницы");
	Если ЗначениеЗаполнено(ПлощадьЕдиницы) Тогда
		РасчетноеКоличество = ТекущаяСтрока.КоличествоУпаковок / ПлощадьЕдиницы;
		Если Не РасчетноеКоличество = Цел(РасчетноеКоличество) Тогда
			ТекущаяСтрока.КоличествоУпаковок = (Цел(РасчетноеКоличество) + 1) * ПлощадьЕдиницы;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
