
Процедура ОбработкаПроведения(Отказ, Режим)
		
	// регистр ма_СостоянияНоминальныхОбъектов
	Движения.bon_СостоянияНоминальныхОбъектов.Записывать = Истина;
	Движения.bon_СостоянияНоминальныхОбъектов.Очистить();
	
	Для Каждого ТекСтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	bon_СостоянияНоминальныхОбъектов.НоминальныйОбъект КАК НоминальныйОбъект,
		               |	bon_СостоянияНоминальныхОбъектов.Номер КАК Номер
		               |ИЗ
		               |	РегистрСведений.bon_СостоянияНоминальныхОбъектов КАК bon_СостоянияНоминальныхОбъектов
		               |ГДЕ
		               |	bon_СостоянияНоминальныхОбъектов.НоминальныйОбъект = &НоминальныйОбъект
		               |	И bon_СостоянияНоминальныхОбъектов.Статус = &Статус";
		Запрос.УстановитьПараметр("НоминальныйОбъект", ТекСтрокаНоминальныеОбъекты.НоминальныйОбъект); 
		Запрос.УстановитьПараметр("Статус", Перечисления.bon_СтатусыНоминальныхОбъектов.ВведенВОборот); 
		
		Рез = Запрос.Выполнить().Выгрузить();
		
		Если Рез.Количество() > 0 тогда
			Для Каждого Строка Из Рез Цикл 
				Движение = Движения.bon_СостоянияНоминальныхОбъектов.Добавить();
				
				Движение.Период 				= Дата;
				Движение.НоминальныйОбъект 		= Строка.НоминальныйОбъект;
				Движение.Статус 				= Перечисления.bon_СтатусыНоминальныхОбъектов.ВыведенИзОборота;
				Движение.Номер 					= Строка.Номер;
			КонецЦикла;			
		КонецЕсли;

	КонецЦикла;
	
	/////Сделать списание бонусов с сертификатов
	//Если НЕ ВидНоминальныхОбъектов.НакапливаемыйНоминал Тогда	
	//	// получим остаток и спишем его
	//	Движения.bon_ПартииБонусовНаСчетах.Записывать = Истина;
	//	Движения.bon_ПартииБонусовНаСчетах.Очистить();
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	bon_ПартииБонусовНаСчетахОстатки.НоминальныйОбъект,
	//		|	bon_ПартииБонусовНаСчетахОстатки.НоминалОстаток
	//		|ИЗ
	//		|	РегистрНакопления.ма_ОстаткиНоминальныхОбъектов.Остатки(&Период, НоминальныйОбъект В (&НоминальныеОбъекты)) КАК ма_ОстаткиНоминальныхОбъектовОстатки";

	//	Запрос.УстановитьПараметр("НоминальныеОбъекты", НоминальныеОбъекты.Выгрузить());
	//	Запрос.УстановитьПараметр("Период", МоментВремени());
	//	ВыборкаОстатки = Запрос.Выполнить().Выбрать();
	//	Пока ВыборкаОстатки.Следующий() Цикл
	//		Движение = Движения.ма_ОстаткиНоминальныхОбъектов.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период 			= Дата;
	//		Движение.НоминальныйОбъект 	= ВыборкаОстатки.НоминальныйОбъект;
	//		Движение.Номинал 			= ВыборкаОстатки.НоминалОстаток;
	//	КонецЦикла;
	//КонецЕсли;
	
	Если ВидНоминальныхОбъектов.Наименование = Строка("Акционные Сертификаты") Тогда
		bon_БонуснаяПрограммаСервер.ВыводИзОборотовСертификатов(ЭтотОбъект, НоминальныеОбъекты);	
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ); 	
КонецПроцедуры
