
&НаСервере
Функция ПриОткрытииНаСервере()
	ТелефонМенеджераК = Константы.ЦС_ТелефонМенеджера.Получить();
	Возврат ТелефонМенеджераК; 
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
Телефон = ПриОткрытииНаСервере();
Объект.ТелефонМенеджера = Телефон;
Если Объект.ПоказатьВсеСклады тогда
	Элементы.Местонаходение.Доступность = Ложь иначе
		Элементы.Местонаходение.Доступность = Истина; 
	КонецЕсли;		
КонецПроцедуры


&НаСервере
Процедура ТелефонМенеджераПриИзмененииНаСервере(ТелефонМенеджера)
Константы.ЦС_ТелефонМенеджера.Установить(ТелефонМенеджера);	
	
КонецПроцедуры


&НаКлиенте
Процедура ТелефонМенеджераПриИзменении(Элемент)
	Телефон = Объект.ТелефонМенеджера;
	ТелефонМенеджераПриИзмененииНаСервере(Телефон);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = Объект.Пользователь;
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВсеСкладыПриИзменении(Элемент)
	Если Объект.ПоказатьВсеСклады тогда
	Элементы.Местонаходение.Доступность = Ложь иначе
		Элементы.Местонаходение.Доступность = Истина; 
	КонецЕсли;	
	КонецПроцедуры

