#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады") Тогда
		
		СтандартнаяОбработка = Ложь;
		//ограничим выбор значений только используемыми
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий);
		ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.АвторасчетПоFEFOОстатковСерий);
		ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.УправлениеПоFEFOОстаткамиСерий);
		ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий);
		ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям);
		
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий);
	
КонецПроцедуры

#КонецОбласти