
&НаСервере
Процедура ПриОткрытииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьСервер()
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьСервер();	
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектНом = РеквизитФормыВЗначение("Объект");
	ОбъектНом = Параметры.Объект;
	РегПоПредзаказу.Параметры.УстановитьЗначениеПараметра("СсылкаНаНоменклатуру",ОбъектНом.Ссылка);
КонецПроцедуры
