
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.ДатаОперации		= НачалоДня(ТекущаяДата());
	Иначе 
		Элементы.ВидОперации.Доступность		= Ложь;
		Элементы.ДатаОперации.Доступность		= Ложь;
	КонецЕсли;
	
	//Если РольДоступна("ПолныеПрава") Тогда
	
		Элементы.РучнаяКорректировка.Доступность		= Истина;
		Элементы.РучнаяКорректировкаПольз.Доступность	= Истина;
		Элементы.ДляОправкиСМССоздано.Доступность		= Истина;
		
		Если Объект.РучнаяКорректировка = Истина Тогда 
			ЭтаФорма.Элементы.Доп.Видимость = Истина;	
		КонецЕсли;
		
		Если РучнаяКорректировкаПольз = Истина Тогда 
			ЭтаФорма.Элементы.Группа12.Видимость = Истина;	
		КонецЕсли;
		
		Элементы.ДатаОперации.ТолькоПросмотр = Ложь; ///Сергей 11.06.2019 +++ \Дату операцию только Админ может поменять/	
	//КонецЕсли;
	
	Если ЭтаФорма.РучнаяКорректировкаПольз = Истина Тогда 
		ЭтаФорма.Элементы.Группа12.Видимость = Истина;	
	КонецЕсли;
	
	/////18.07.2019 +++
	//Если Объект.Проведен = Ложь и Не РольДоступна("ПолныеПрава") Тогда
	//	ЭтаФорма.Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.ПустаяСсылка();		
	//КонецЕсли;
	/////18.07.2019 ---
	
	///30.09.2019 +++ (Возможность изменение даты операции)
	//Если РольДоступна("мчт_РедакторБонусов") Тогда
	//	Элементы.ДатаОперации.Доступность		= Истина;	
	//Иначе 
	//	Если не РольДоступна("ПолныеПрава") Тогда
	//		Объект.ДатаОперации = ТекущаяДата();  ///Сергей 11.06.2019 +++ \Чтобы дата была текущей/
	//	КонецЕсли;
	//КонецЕсли;
	///30.09.2019 --- (Возможность изменение даты операции)
	
	//Если ЗначениеЗаполнено(ЭтаФорма.Объект.ВидОперации) Тогда
	//	ЭтаФорма.Элементы.ГруппаСтраницы.Видимость = Истина;
	//Иначе 
	//	Если РольДоступна("ПолныеПрава") Тогда
			ЭтаФорма.Элементы.ГруппаСтраницы.Видимость = Истина;
	//	КонецЕсли;	
	//КонецЕсли;
	
	//Если Не РольДоступна("ПолныеПрава") Тогда		
	//	Элементы.РучнаяКорректировка.Видимость		= Ложь;
	//	Элементы.РучнаяКорректировкаПольз.Видимость	= Ложь;
	//КонецЕсли;
	
	ОбновитьВидимость();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	ОбновитьВидимостьСерв()
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьСерв()
	
	Если Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.ЗачислениеБонусныхБалловИзБуфера Тогда   
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаКонвертация;
		Если Не РольДоступна("ПолныеПрава") Тогда		
			Элементы.Характеристики_для_отправки_СМС.Видимость	= Ложь;
			Элементы.Отправленные_СМС_о_Начисление.Видимость	= Ложь;
		КонецЕсли;
		Если Объект.Ссылка.Пустая() Тогда
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Истина;
		Иначе 
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Ложь;
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.СписаниеБонусныхБаллов Тогда   
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаКонвертация;		
		
		Если не РольДоступна("ПолныеПрава") и Не ЗначениеЗаполнено(Объект.ДатаОперации) Тогда
			Объект.ДатаОперации = НачалоДня(ТекущаяДата());	
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.СписаниеОтрицательныхБонусныхБалловВОстатке Тогда   
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаСписанияМинусов;
		
		Если не РольДоступна("ПолныеПрава") и Не ЗначениеЗаполнено(Объект.ДатаОперации) Тогда
			Объект.ДатаОперации = НачалоДня(ТекущаяДата());	
		КонецЕсли;

	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.КорректировкаБуфера Тогда  
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаКорректировкаБуфера;
		Если НЕ РольДоступна("ПолныеПрава") тогда
			Элементы.ПартииБонусовДляРедактированияБуфер.Видимость = Истина;
			Элементы.ПартииБонусовДляРедактированияОстаток.Видимость = Ложь;
		КонецЕсли;
		Если Объект.Ссылка.Пустая() Тогда
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Истина;
		Иначе 
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Ложь;
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.КорректировкаОстатка Или 
		Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.АвтоформированиеНачислениеОстаткаПеренос Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаКорректировкаБуфера;
		Если НЕ РольДоступна("ПолныеПрава") тогда
			Элементы.ПартииБонусовДляРедактированияБуфер.Видимость = Ложь;
			Элементы.ПартииБонусовДляРедактированияОстаток.Видимость = Истина;
		КонецЕсли;	
		Если Объект.Ссылка.Пустая() Тогда
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Истина;          
		Иначе 
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Ложь;
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.ОтправкаСМСоПредстоящемСписание Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаОтправкиСМС;
		Если Не ЗначениеЗаполнено(Объект.СуммаУвед) тогда
			Объект.СуммаУвед = Число(500);
		КонецЕсли;
		
		Если Объект.Ссылка.Пустая() Тогда
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Истина;
		Иначе 
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Ложь;
		КонецЕсли;	
		Объект.ДатаСписания							= ТекущаяДата();
		///
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.НачислениеИОтправкаСМС Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ПартииБонусовДляНачисленияИОтправкиСМС;
		Если Не ЗначениеЗаполнено(Объект.СуммаУвед) тогда
			Объект.СуммаУвед = Число(500);
		КонецЕсли;
		
		Если Объект.Ссылка.Пустая() Тогда
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Истина;
		Иначе 
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Ложь;
		КонецЕсли;	
		//Объект.ДатаСписания							= ТекущаяДата();	
	//
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.АнонсированиеСписанияБонусов Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаОтправкиСМС;
		ЭтаФорма.Элементы.СМСПольз.Видимость = Истина;
	//Иначе 
	//	ЭтаФорма.Элементы.ДатаОперации.Доступность	= Ложь;
	//	Объект.ДатаОперации							= Дата("00010101");
		//Элементы.ГруппаВидыДокумента.ТекущаяСтраница	= 
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.Отправка_СМС_о_Начислении Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.Отправка_СМС_о_Начислении;
		ЭтаФорма.Элементы.ДатаОперации.Доступность	= Ложь;	
	///+++Результаты_маркетинговой_активности+++	
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.Результат_маркетинговой_активности Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаРезультаты_маркетинговой_активности;
		Если Объект.Ссылка.Пустая() Тогда
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Истина;          
		Иначе 
			ЭтаФорма.Элементы.ДатаОперации.Доступность	= Ложь;
		КонецЕсли;
	///---Результаты_маркетинговой_активности---
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.КорректировкаБуфераAdmin или 
		 	Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.КорректировкаОстаткаAdmin Тогда   
		Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаКорректировкаБуфераОстатка_Admin;
	КонецЕсли;
	
	///30.09.2019 +++ (Возможность изменение даты операции)
	//Если РольДоступна("мчт_РедакторБонусов") Тогда
		ЭтаФорма.Элементы.ДатаОперации.Доступность	= Истина;
	//КонецЕсли;
	///30.09.2019 --- (Возможность изменение даты операции)
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	//Пров = Число(0);
	//Прав = Число(0);
	//Если Не РольДоступна("ПолныеПрава") Тогда
	//	Если Строка(Объект.ВидОперации) <> Строка("0.2 - Корректировка остатка бонусных баллов (активные бонусы!)") Тогда
	//		Пров = Число(1);
	//	Иначе 
	//		Прав = Число(1);	
	//	КонецЕсли;
	//	
	//	Если  Строка(Объект.ВидОперации) <>  Строка("0.1 - Корректировка нераспределенных партий (только неактивные бонусы!)") Тогда	
	//		Пров = Число(1);
	//	Иначе 
	//		Прав = Число(1);
	//	КонецЕсли;
	//	
	//	Если  Строка(Объект.ВидОперации) <>  Строка("0.3 - Результат Маркетинговой активности") Тогда	
	//		Пров = Число(1);
	//	Иначе 
	//		Прав = Число(1);
	//	КонецЕсли;
	//	
	//	//Если Пров = Число(1) и Прав = Число(0) Тогда
	//	//	 ЭтаФорма.Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.ПустаяСсылка();
	//	//КонецЕсли;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ЭтаФорма.Объект.ВидОперации) и Не РольДоступна("ПолныеПрава") Тогда
	//	ЭтаФорма.Элементы.ГруппаСтраницы.Видимость = Истина;
	//ИначеЕсли Не ЗначениеЗаполнено(ЭтаФорма.Объект.ВидОперации) и Не РольДоступна("ПолныеПрава") и Объект.Проведен = Ложь Тогда
	//	ЭтаФорма.Элементы.ГруппаСтраницы.Видимость = Ложь;	
	//	Объект.ПартииБонусовДляРедактирования.Очистить();
	//КонецЕсли;

	ОбновитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере()
		
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.ПартииБонусовДляКонвертации.Очистить();
	Объект.ПартииБонусовДляКонвертации.Очистить();
	
	ДокументОбъект.ПартииБонусовДляРедактированияБуфера.Очистить();
	Объект.ПартииБонусовДляРедактированияБуфера.Очистить();
	
	ДокументОбъект.ПартииБонусовДляРедактированияОстатка.Очистить();
	Объект.ПартииБонусовДляРедактированияОстатка.Очистить();
	
	ДокументОбъект.ПартииБонусовДляСМС.Очистить();
	Объект.ПартииБонусовДляСМС.Очистить();
	
	ДокументОбъект.ТаблицаДляСписанияОтрицательныхОстатков.Очистить();
	Объект.ПартииБонусовДляСМС.Очистить();
	
	ДокументОбъект.ХарактеристикиДляОтправкиСМСОНачис.Очистить();
	Объект.ХарактеристикиДляОтправкиСМСОНачис.Очистить();

	ДокументОбъект.Результаты_маркетинговой_активности.Очистить();
	Объект.Результаты_маркетинговой_активности.Очистить();

	
	ДокументОбъект.Автозаполнение();
	
	Если Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.ЗачислениеБонусныхБалловИзБуфера Тогда
		Объект.ПартииБонусовДляКонвертации.Загрузить(ДокументОбъект.ПартииБонусовДляКонвертации.Выгрузить());
		Объект.ХарактеристикиДляОтправкиСМСОНачис.Загрузить(ДокументОбъект.ХарактеристикиДляОтправкиСМСОНачис.Выгрузить());
		Объект.ПартииБонусовДляСМС.Загрузить(ДокументОбъект.ПартииБонусовДляСМС.Выгрузить());
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.АвтоформированиеНачислениеОстаткаПеренос Тогда
		Объект.ПартииБонусовДляРедактирования.Загрузить(ДокументОбъект.ПартииБонусовДляРедактирования.Выгрузить());
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.КорректировкаБуфера Тогда  
		Объект.ПартииБонусовДляРедактированияБуфера.Загрузить(ДокументОбъект.ПартииБонусовДляРедактированияБуфера.Выгрузить());
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.КорректировкаОстатка Тогда  
		Объект.ПартииБонусовДляРедактированияОстатка.Загрузить(ДокументОбъект.ПартииБонусовДляРедактированияОстатка.Выгрузить());
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.ОтправкаСМСоПредстоящемСписание Тогда  
		Объект.ПартииБонусовДляСМС.Загрузить(ДокументОбъект.ПартииБонусовДляСМС.Выгрузить());
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.СписаниеБонусныхБаллов Тогда  
		Объект.ПартииБонусовДляКонвертации.Загрузить(ДокументОбъект.ПартииБонусовДляКонвертации.Выгрузить());
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.СписаниеОтрицательныхБонусныхБалловВОстатке Тогда  
		Объект.ТаблицаДляСписанияОтрицательныхОстатков.Загрузить(ДокументОбъект.ТаблицаДляСписанияОтрицательныхОстатков.Выгрузить());
	///+++0.3 - Результат Маркетинговой активности+++	
	ИначеЕсли Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.Результат_маркетинговой_активности Тогда  
		Объект.Результаты_маркетинговой_активности.Загрузить(ДокументОбъект.Результаты_маркетинговой_активности.Выгрузить());
	///---0.3 - Результат Маркетинговой активности---
	КонецЕсли;		
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	
	Если Объект.ПартииБонусовДляКонвертации.Количество() <> 0 ИЛИ
		Объект.ПартииБонусовДляРедактированияБуфера.Количество() <> 0 ИЛИ
		Объект.ПартииБонусовДляРедактированияОстатка.Количество() <> 0 ИЛИ 
		Объект.ПартииБонусовДляСМС.Количество() <> 0 или 
		Объект.ТаблицаДляСписанияОтрицательныхОстатков.Количество() <> 0 Тогда 
		Оповещение = Новый ОписаниеОповещения("Перезаполнить", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Табличная часть не пуста. Перезаполнить?",  РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Очистить табличную часть?");
	Иначе 
		ЗаполнитьДокументНаСервере();
	КонецЕсли;
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда  
		ЗаполнитьДокументНаСервере();
	Иначе 
		Возврат
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПартияПриИзмененииНаСервере()
	
	ЗаполнитьДокументНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПартияПриИзменении(Элемент)
	
	ПартияПриИзмененииНаСервере();
	
КонецПроцедуры

///Сергей +++14.12.2018+++
&НаКлиенте
Процедура ИсключитьИзСписаПриИзменении(Элемент)
	Если Объект.ИсключитьИзСписа = Истина Тогда
		ЭтаФорма.Элементы.Группа1.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.Группа1.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзменении(Элемент)
	Если Объект.РучнаяКорректировка = Истина Тогда
		ЭтаФорма.Элементы.Доп.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.Доп.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПользПриИзменении(Элемент)
	Если ЭтаФорма.РучнаяКорректировкаПольз = Истина Тогда
		ЭтаФорма.Элементы.Группа12.Видимость = Истина;
		Объект.ТекстСМС = Строка("Образец: Успей потратить до ДатаСписания! Доступно: Остаток бонусов clck.ru/FGeuZ");
	Иначе 
		ЭтаФорма.Элементы.Группа12.Видимость = Ложь;
		Объект.ИзменитьТекстСМС = Ложь;
		Объект.ТекстСМС = Строка("Образец: Успей потратить до ДатаСписания! Доступно: Остаток бонусов clck.ru/FGeuZ");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьСМСНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	ДокументОбъект.ОтправитьСМС();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	Если Объект.Проведен = Истина Тогда 
		ЭтаФорма.Объект.ОтправитьСМС = Истина;
		ОтправитьСМСНаСервере();
		Объект.Комментарий = Строка(Объект.Комментарий)+ Строка(" -(СМС Отправлены)");
		Записать();
	Иначе 
		Объект.Комментарий = Строка(Объект.Комментарий)+ Строка(" -(СМС не отправлены)");	
		Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТекстСМСПриИзменении(Элемент)
	Если Объект.ИзменитьТекстСМС = Истина Тогда
		Объект.ТекстСМС = Строка("Успей потратить до ДатаСписания! Доступно: Остаток бонусов clck.ru/FGeuZ");
	Иначе 
		Объект.ТекстСМС = Строка("Образец: Успей потратить до ДатаСписания! Доступно: Остаток бонусов clck.ru/FGeuZ");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьЗаПериодПриИзменении(Элемент)
		Если ЭтаФорма.Объект.ОтобратьЗаПериод = Истина Тогда 
		Элементы.ДатаНачПериода.Доступность = Истина;
		Элементы.ДатаКонПериода.Доступность = Истина;
	Иначе 
		Элементы.ДатаНачПериода.Доступность = Ложь;
		Элементы.ДатаКонПериода.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПартииБонусовДляСМСНоминальныйОбъектПриИзменении(Элемент)
	
	НомОбъект = ЭтаФорма.Элементы.ПартииБонусовДляСМС.ТекущиеДанные.НоминальныйОбъект;
	Если ЗначениеЗаполнено(НомОбъект.Держатель) Тогда
		ЭтаФорма.Элементы.ПартииБонусовДляСМС.ТекущиеДанные.Держатель = НомОбъект.Держатель;
		ЭтаФорма.Элементы.ПартииБонусовДляСМС.ТекущиеДанные.ТелефонСотовыйДержателя = НомОбъект.Держатель.ТелефонСотовый;
		ЭтаФорма.Элементы.ПартииБонусовДляСМС.ТекущиеДанные.НомерСчетаНомОбъект = НомОбъект.Код;
	Иначе 
		Сообщить("У "+НомОбъект.Код+" Нету Держателя!!!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
        Отказ = Истина; СтандартнаяОбработка = Ложь;
    КонецЕсли;
КонецПроцедуры
///Сергей ---14.12.2018---




///Сергей 18.07.2019 +++  НАчисляли только текущей даты кроме админа
&НаКлиенте
Процедура ПартииБонусовДляРедактированияДатаНачисленияПриИзменении(Элемент)
	
	//Если Не РольДоступна("ПолныеПрава") Тогда
	//	Элементы.ПартииБонусовДляРедактирования.ТекущиеДанные.ДатаНачисления = ТекущаяДата();
	//КонецЕсли;
	
КонецПроцедуры
///Сергей 18.07.2019 ---

&НаСервере
Процедура До_Отправлять_СМСНаСервере()
	
	//Врем--09.07.2020
	//Для Каждого Клиента Из Объект.ПартииБонусовДляСМС Цикл 
	//	Если Клиента.ОтправленоСМС = Ложь Тогда 
	//		
	//		ТелефонСотовый	= Клиента.ТелефонСотовыйДержателя;
	//		НомерСчета		= Клиента.НомерСчетаНомОбъект;
	//		ТекстСообщения 	= Клиента.ТекстСМС;
	//		
	//		Дост=Число(88);
	//		Структура = смсТрафик.ОтправитьСМССообщениеПоНомеру(ТелефонСотовый, ТекстСообщения, Дост);
	//		Ответ = Структура.Описание + " " + Структура.Ид;
	//		swWebService.ЗаписатьЛогСообщений("SMS_СписаниеАнонс", Перечисления.ВходящееИсходящееСобытие.Исходящее, "" + Строка(Ответ) + " / "  + " / " + ТелефонСотовый, , );
	//		Если Структура.Результат = Истина Тогда
	//			Клиента.ОтправленоСМС = Истина;
	//			ЭтотОбъект.Записать();
	//		КонецЕсли;
	//			
	//	КонецЕсли;		
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура До_Отправлять_СМС(Команда)
	
	//Врем--09.07.2020
	//Если Объект.Проведен = Истина Тогда
	//	ПровОтправ = Новый Запрос;
	//	ПровОтправ.Текст = "ВЫБРАТЬ
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.Ссылка,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.НомерСтроки,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.НоминальныйОбъект,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.ДатаСписания,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.ДатаОтправкиСМС,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.Остаток,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.Содержание,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.Партия,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.ВремяЖизниБуфера,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.Держатель,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.ТелефонСотовыйДержателя,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.НомерСчетаНомОбъект,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.ОтправленоСМС,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.ТекстСМС,
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.Характеристика
	//	|ИЗ
	//	|	Документ.мчт_УправлениеБонусамиНаСчетах.ПартииБонусовДляСМС КАК мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС
	//	|ГДЕ
	//	|	мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.Ссылка.Ссылка = &Ссылка
	//	|	И мчт_УправлениеБонусамиНаСчетахПартииБонусовДляСМС.ОтправленоСМС = ЛОЖЬ";
	//	ПровОтправ.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//	Рез = ПровОтправ.Выполнить().Выгрузить();
	//	
	//	Если Рез.Количество() > 0 Тогда
	//		До_Отправлять_СМСНаСервере();
	//	Иначе 
	//		Сообщить("Все СМС Отправленны");
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//ДатаКон = Константы.мчт_ДатаВклНоменклотуруВБонуснойПарт.Получить();
	
	ВыпНаСервДан();	
	
	//Если Не РольДоступна("мчт_РедакторБонусов") Тогда
	//	Если Дан > 0 тогда
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыпНаСервДан() 
	
	Дан = Число(0);
	Если Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.КорректировкаБуфера или
		Объект.ВидОперации = Перечисления.bon_ВидыОперацийУправленияБонусами.КорректировкаОстатка Тогда
		Для Каждого Пер Из Объект.ПартииБонусовДляРедактирования Цикл
			
			ТексУв = "";
			///Проверяем ключь выданого
			Если Пер.КлючПримВыдано = Число(0) Тогда 
				Дан = Дан + Число(1);
				ТексУв = Строка("Не указан Ключь связи. №-строка: " +Пер.НомерСтроки+" ");
				Сообщить("");
			КонецЕсли;
			///Проверяем Номенклотуру
			Если Пер.КлючПримВыдано = Число(0) Тогда 
				Дан = Дан + Число(1);	
				ТексУв = ТексУв + Строка(" Не указана Номенклотура. №-строка: " +Пер.НомерСтроки);
			КонецЕсли;	
			Сообщить(ТексУв);
			ТексУв = "";
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры








	
