
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВидБонуса = Сертификат() Тогда
		Элементы.ДатаНачала.Доступность = Истина;
		Элементы.ДатаКонец.Доступность = Истина;
	Иначе 
		Элементы.ДатаНачала.Доступность = Ложь;
		Элементы.ДатаКонец.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Сертификат()
	Возврат Справочники.bon_ВидыНоминальныхОбъектов.НайтиПоКоду("57");	
КонецФункции

&НаКлиенте
Процедура ПоДатеПриИзменении(Элемент)
	
	Если Объект.ПоДате = Истина Тогда
		Элементы.ДатаПереводаИзБуферавОстаток.Доступность = Истина;
		Элементы.ДатаСписанияОстаток.Доступность = Истина;
		
		Элементы.ВремяЖизниБуфера.Доступность = Ложь;
		Элементы.ВремяЖизниОстатков.Доступность = Ложь;
		Объект.ВремяЖизниБуфера = Число(0);
		Объект.ВремяЖизниОстатков = Число(0);
	Иначе 
		Элементы.ДатаПереводаИзБуферавОстаток.Доступность = Ложь;
		Элементы.ДатаСписанияОстаток.Доступность = Ложь;
		Объект.ДатаПереводаИзБуферавОстаток = '00010101';
		Объект.ДатаСписанияОстаток = '00010101';

		Элементы.ВремяЖизниБуфера.Доступность = Истина;
		Элементы.ВремяЖизниОстатков.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОНачислениеПриИзменении(Элемент)
	
	Если Объект.ВключитьОНачисление = Истина Тогда
		Элементы.ТекстСМСОНачислении.ТолькоПросмотр = Ложь;
		Элементы.ОтСуммыБонусовУведОНачисл.ТолькоПросмотр = Ложь;
		Элементы.ДоСуммыБонусовУведОНачисл.ТолькоПросмотр = Ложь;
	Иначе 
		Элементы.ТекстСМСОНачислении.ТолькоПросмотр = Истина;
		Элементы.ОтСуммыБонусовУведОНачисл.ТолькоПросмотр = Истина;
		Элементы.ДоСуммыБонусовУведОНачисл.ТолькоПросмотр = Истина;
		
		Объект.ТекстСМСОНачислении 			= "";
		Объект.ОтСуммыБонусовУведОНачисл 	= Число(0);
		Объект.ДоСуммыБонусовУведОНачисл 	= Число(0);
	КонецЕсли;

КонецПроцедуры


