////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСведенияОДатеАктуализации();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КлючУникальности = Новый УникальныйИдентификатор;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВС_ПроверятьОповещенияФоновогоЗадания"
		И ЭтаФорма.КлючУникальности = Источник Тогда
		
		ВСКлиентПереопределяемый.ОбработкаОповещенияВС_ПроверятьОповещенияФоновогоЗадания(ЭтаФорма, Параметр);
		
		ЗаполнитьСведенияОДатеАктуализации();
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТехническаяИнформацияОбОбновленииНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СобытиеЖурналаРегистрации", "ОбменЭСФ.ЗагрузитьСправочникГСВС");	

	ВСКлиентПереопределяемый.ОткрытьФормуЖурналаРегистрации(ПараметрыФормы);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
&НаСервере
Процедура ЗаполнитьСведенияОДатеАктуализации()
	ПараметрыМетодаСинхронизации = ЭСФСервер.ПолучитьПараметрыМетода(Неопределено, ВРег("gsvsUpdates"), Неопределено);	
	Если ПараметрыМетодаСинхронизации.Свойство("lastUpdateDate") и ЗначениеЗаполнено(ПараметрыМетодаСинхронизации.lastUpdateDate) Тогда
		ДатаАктуализации = ПараметрыМетодаСинхронизации.lastUpdateDate
	Иначе
		ДатаАктуализации = Неопределено;
	КонецЕсли;	
КонецПроцедуры

