////////////////////////////////////////////////////////////////////////////////
// Переопределяемые процедуры, вызываемые из обработчиков форм, таких как:
// "ПриСозданииНаСервере", "ПриЧтенииНаСервере", "ПередЗаписьюНаСервере", 
// "ПослеЗаписи", а также при изменении некоторых реквизитов табличной части,
// таких как "Номенклатура", "Характеристика".
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ЗаполнениеОбработчиковФормы

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - форма, из обработчика события которой происходит вызов процедуры.
//	см. справочную информацию по событиям управляемой формы.
//
Процедура ПослеЗаписи(Форма, ПараметрыЗаписи)Экспорт
	
	ЭСФКлиентУТ.ЗаписьКнигиПокупокПослеЗаписи(Форма, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеНоменклатуры

// Переопределяемая процедура, вызываемая из обработчика реквизита "Номенклатура" табличной части.
//
// Параметры:
// 	ТекущаяСтрока - ДанныеФормыЭлементКоллекции - текущая строка табличной части.
// 	ПараметрыДействия - Структура - допустимые действия для табличной части.
//	КэшированныеЗначения - Структура - Кэшированные значения табличной части.
Процедура НоменклатураПриИзмененииПереопределяемый(ТекущаяСтрока,ПараметрыДействия,КэшированныеЗначения)Экспорт


КонецПроцедуры
  
#КонецОбласти 

#Область ЗаполнениеХарактеристики

// Переопределяемая процедура, вызываемая из обработчика реквизита "Характеристика" табличной части.
//
// Параметры:
// 	ТекущаяСтрока - ДанныеФормыЭлементКоллекции - текущая строка табличной части.
// 	ПараметрыДействия - Структура - допустимые действия для табличной части.
//	КэшированныеЗначения - Структура - Кэшированные значения табличной части.
Процедура ХарактеристикаПриИзмененииПереопределяемый(ТекущаяСтрока,ПараметрыДействия,КэшированныеЗначения)Экспорт


КонецПроцедуры
	
#КонецОбласти 

#Область Общие

// Проверка необходимость вызова сервера при обработке строки табличной части.
//
// Параметры:
// 	ИмяСвойства - Строка -  имя передаваемого свойства.
// 	ПараметрыДействия - Структура - допустимые действия для табличной части.
//
// Возвращаемое значение:
//	Истина
//
Функция ОбработкаТабличнойЧастиНеобходимВызовСервера(ИмяСвойства,ПараметрыДействия)Экспорт

	Возврат Истина	

КонецФункции   

// Вызывается в формах при выборе команды, которая добавлена программно
//
// Параметры:
//  Форма					 - УправляемаяФорма - форма в которой расположена команда
//  Команда					 - КомандаФормы - выбранная команда
//  ДополнительныеПараметры	 - Структура - дополнительные параметры.
//
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры) Экспорт

	
КонецПроцедуры

#КонецОбласти 

#Область НомераГТДКлиент

Процедура КлючевоеПолеИсточникаПроисхожденияПриИзменении(ДанныеДляИзменения, ИзменятьДанныеТабличнойЧастиПолностью = Ложь, ИмяРеквизитаНомерГТД = "НомерГТД") Экспорт
	
	Если НЕ ИзменятьДанныеТабличнойЧастиПолностью И НЕ ЗначениеЗаполнено(ДанныеДляИзменения[ИмяРеквизитаНомерГТД]) Тогда
		Возврат;
	КонецЕсли;
			
	Режим = РежимДиалогаВопрос.ДаНет;
	ДополнительныеПараметры = Новый Структура;                        
	ДополнительныеПараметры.Вставить("ДанныеДляИзменения", ДанныеДляИзменения);
	ДополнительныеПараметры.Вставить("ИзменятьДанныеТабличнойЧастиПолностью", ИзменятьДанныеТабличнойЧастиПолностью);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаНомерГТД", ИмяРеквизитаНомерГТД);
	
	Если ИзменятьДанныеТабличнойЧастиПолностью Тогда
		
		ТекстВопроса = НСтр("ru='Изменилось ключевое поле источника происхождения. Очистить источники происхождения?
						|Да  - при проведении будут созданы новые источники происхождения
						|Нет - при проведении будут обновлены существующие источники происхождения'");

	Иначе
		
		ТекстВопроса = НСтр("ru='Изменилось ключевое поле источника происхождения. Очистить источник происхождения?
						|Да  - при проведении будет создан новый источник происхождения
						|Нет - при проведении будет обновлен существующий источник происхождения'");
						
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаКлючевоеПолеПриИзменении", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим); 
	
КонецПроцедуры

Процедура ПослеЗакрытияВопросаКлючевоеПолеПриИзменении(Результат, ДополнительныеПараметры) Экспорт
		
	ИмяРеквизитаНомерГТД = ДополнительныеПараметры.ИмяРеквизитаНомерГТД;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры.ИзменятьДанныеТабличнойЧастиПолностью  Тогда
			Для Каждого Строка ИЗ ДополнительныеПараметры.ДанныеДляИзменения Цикл
				Строка[ИмяРеквизитаНомерГТД] = ПредопределенноеЗначение("Справочник.НомераГТД.ПустаяСсылка");
			КонецЦикла;
		Иначе
			ДополнительныеПараметры.ДанныеДляИзменения[ИмяРеквизитаНомерГТД] = ПредопределенноеЗначение("Справочник.НомераГТД.ПустаяСсылка");	
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакПроисхожденияДляВсехСтрок(Форма, ИмяТабличнойЧасти) Экспорт
	
	Объект = Форма.Объект;
	
	НеобходимВопрос = Ложь;
	
	Для Каждого ТекСтрока Из Объект[ИмяТабличнойЧасти] Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ПризнакПроисхождения) Тогда
			НеобходимВопрос = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НеобходимВопрос Тогда
		//задать вопрос
		ТекстВопроса = НСтр("ru = 'Заполненные признаки происхождения будут очищены перед заполнением. Продолжить заполнение?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаполнениеПризнакаВоВсехСтроках", ЭтотОбъект, Новый Структура("Форма, ТабличнаяЧасть", Форма, "Товары"));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Иначе
		//сразу выполняем заполнение
		Форма.ЗаполнитьПризнакПроисхожденияДляСтрокТЧ(ИмяТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПослеЗакрытияВопросаЗаполнениеПризнакаВоВсехСтроках(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Форма.ЗаполнитьПризнакПроисхожденияДляСтрокТЧ(ДополнительныеПараметры.ТабличнаяЧасть);
	
КонецПроцедуры

#КонецОбласти
