
#Область ПрограммныйИнтерфейс

// Разбирает строку URI на составные части и возвращает в виде структуры.
//
Функция СтруктураURI(АдресСервиса) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресСервиса);
	
КонецФункции

// Возвращает объект ИнтернетПрокси для доступа в Интернет.
//
Функция ПолучитьПрокси(URLИлиПротокол) Экспорт
	
	Возврат ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси(URLИлиПротокол);
	
КонецФункции

Процедура УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение);
	
КонецПроцедуры

Функция РазложитьСтрокуВМассивСлов(Знач Значение, РазделителиСлов = Неопределено) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Значение, РазделителиСлов);
	
КонецФункции

#КонецОбласти
