
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр БонусыСотрудников 
	Движения.БонусыСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаРасчеты Из Расчеты Цикл
		Движение = Движения.БонусыСотрудников.Добавить();
		Движение.Период = МесяцРасчета;
		Движение.МесяцРасчета = МесяцРасчета;
		Движение.Подразделение = ТекСтрокаРасчеты.Подразделение;
		Движение.Сотрудник = ТекСтрокаРасчеты.Сотрудник;
		Движение.ВидБонуса = ТекСтрокаРасчеты.ВидБонуса;
		Движение.СуммаБонусов = ТекСтрокаРасчеты.СуммаБонусов;
		Движение.СуммаВыручки = ТекСтрокаРасчеты.СуммаВыручки;
		Движение.БонусныйПроцент = ТекСтрокаРасчеты.БонусныйПроцент;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Автор.Пустая() тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры


