
//Кт Начало Апаев_О [10.08.2022]
Процедура ПередЗаписью(Отказ)
	
	Год = НачалоГода(Год);
	
	ПроверитьНаличиеПоказателей(Год);
	
	Если ЗначениеЗаполнено(Год) И ЗначениеПоказателей.Количество() = 12 Тогда
		
		Для Каждого Строка Из ЗначениеПоказателей Цикл
			
			НомерМесяца = Строка.НомерСтроки; 
			Месяц 	    = Строка(НомерМесяца);
			
			Если СтрДлина(Месяц) = 1 Тогда
				Месяц = "0" + Месяц;
			КонецЕсли;
			
			Строка.Период = Дата(Формат(Год, "ДФ=yyyy") + Месяц + "01");
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеПоказателей(Год)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	кт_ЗначенияПоказателейВыручки.Ссылка КАК Показатель
	|ИЗ
	|	Справочник.кт_ЗначенияПоказателейВыручки КАК кт_ЗначенияПоказателейВыручки
	|ГДЕ
	|	кт_ЗначенияПоказателейВыручки.Год = &Год
	|	И кт_ЗначенияПоказателейВыручки.ПлановыеПоказатели = &ПлановыеПоказатели
	|	И НЕ кт_ЗначенияПоказателейВыручки.Ссылка = &Показатель
	|
	|СГРУППИРОВАТЬ ПО
	|	кт_ЗначенияПоказателейВыручки.Ссылка";
	
	Запрос.УстановитьПараметр("Год", Год);
	Запрос.УстановитьПараметр("ПлановыеПоказатели", ПлановыеПоказатели);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос.УстановитьПараметр("Показатель", Ссылка);	
	Иначе
		Запрос.УстановитьПараметр("Показатель", Справочники.кт_ЗначенияПоказателейВыручки.ПустаяСсылка());
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Если ПлановыеПоказатели = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В системе уже указаны плановые показатели за " + Формат(Год, "ДФ=yyyy") + " год!");	
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В системе уже указаны показатели за " + Формат(Год, "ДФ=yyyy") + " год!");
		КонецЕсли;
		
		Отказ = Истина;	
		
	КонецЕсли;
	
КонецПроцедуры
//Кт Окончание Апаев_О [10.08.2022]