

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПроверкаОбновленияДанныхМодуляОбменаСБитрикс24();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданаИзмененаНастройка" тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСинхронизациюИзменений(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкаСинхронизации", Элементы.Список.ТекущиеДанные.Ссылка);
	ПараметрыФормы.Вставить("ВидСинхронизации"		, 2);
	ПараметрыФормы.Вставить("ПолнаяСинхронизация"	, Ложь);
	ПараметрыФормы.Вставить("ВыполнятьЗагрузку"		, Неопределено);
	ПараметрыФормы.Вставить("ВыполнятьВыгрузку"		, Неопределено);
	
	ОткрытьФорму("Справочник.Б24_НастройкиСинхронизацииСБитрикс24.Форма.ФормаВыполнениеСинхронизации", ПараметрыФормы, , Элементы.Список.ТекущиеДанные.Ссылка);
	
КонецПроцедуры
