
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// проверим проведение документов перед созданием ЭАВР, чтобы избежать модульных ошибок
	ПослеПроверкиПроведения = Новый ОписаниеОповещения("ПослеПроверкиПроведения", ЭтотОбъект);
	УправлениеПечатьюКлиент.ПроверитьПроведенностьДокументов(ПослеПроверкиПроведения, ПараметрКоманды, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиПроведения(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		АВРКлиент.ВыполнитьКомандуСоздатьЭАВР(Результат);
	КонецЕсли;

КонецПроцедуры

